#pragma once
#include "FN_Basic.h"

#include "FN_AOE_Ninja_SmokeBomb_Cloud_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AOE_Ninja_SmokeBomb_Cloud
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C
// 0x0044 (0x03D4)
class AAOE_Ninja_SmokeBomb_Cloud_C : public AFortAreaOfEffectCloud
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0390 (0x0004)
	class UPostProcessComponent*                                                                         SmokePP;                                           // 0x0394 (0x0004)
	class UParticleSystemComponent*                                                                      SmokePersist;                                      // 0x0398 (0x0004)
	class UCapsuleComponent*                                                                             Capsule1;                                          // 0x039C (0x0004)
	float                                                                                                FadeIn_Alpha_9E8A507645603872B5DEF2BFE57392D1;     // 0x03A0 (0x0004)
	ETimelineDirection                                                                                   FadeIn__Direction_9E8A507645603872B5DEF2BFE57392D1; // 0x03A4 (0x0001)
	uint8_t                                                                                              UnknownData_3A5[0x3];                              // 0x03A5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FadeIn;                                            // 0x03A8 (0x0004)
	float                                                                                                PPFade_PPWeight_A4DD1BCE429C2F31EB8EB5856B27E063;  // 0x03AC (0x0004)
	ETimelineDirection                                                                                   PPFade__Direction_A4DD1BCE429C2F31EB8EB5856B27E063; // 0x03B0 (0x0001)
	uint8_t                                                                                              UnknownData_3B1[0x3];                              // 0x03B1 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            PPFade;                                            // 0x03B4 (0x0004)
	FVector                                                                                              TX_Size;                                           // 0x03B8 (0x000C)
	float                                                                                                FadeInTime;                                        // 0x03C4 (0x0004)
	float                                                                                                FadeOutTime;                                       // 0x03C8 (0x0004)
	bool                                                                                                 FadingInOrOut_;                                    // 0x03CC (0x0001)
	uint8_t                                                                                              UnknownData_3CD[0x3];                              // 0x03CD (0x0003) MISSED OFFSET
	float                                                                                                AOELifespan;                                       // 0x03D0 (0x0004)
public:
	void OnRep_AOELifespan(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:OnRep_AOELifespan
	void OnRep_Lifespan(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:OnRep_Lifespan
	void UserConstructionScript(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:UserConstructionScript
	void FadeIn__FinishedFunc(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:FadeIn__FinishedFunc
	void FadeIn__UpdateFunc(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:FadeIn__UpdateFunc
	void PPFade__FinishedFunc(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:PPFade__FinishedFunc
	void PPFade__UpdateFunc(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:PPFade__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:ReceiveBeginPlay
	void BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:BndEvt__Capsule1_K2Node_ComponentBoundEvent_425_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:BndEvt__Capsule1_K2Node_ComponentBoundEvent_445_ComponentEndOverlapSignature__DelegateSignature
	void ExtraLifespan(float AOELifespan); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:ExtraLifespan
	void ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/AOE_Ninja_SmokeBomb_Cloud.AOE_Ninja_SmokeBomb_Cloud_C:ExecuteUbergraph_AOE_Ninja_SmokeBomb_Cloud
public:
	static class UClass* StaticClass();
};

