#pragma once
#include "FN_Basic.h"

#include "FN_AIModule_enums.h"
#include "FN_AIModule_structs.h"
#include "FN_AIModule_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTasks_enums.h"
#include "FN_GameplayTasks_structs.h"
#include "FN_GameplayTasks_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AIModule
*/

// Class /Script/AIModule.AISense
// 0x0048 (0x0064)
class UAISense : public UObject
{
public:
	FColor                                                                                               DebugDrawColor;                                    // 0x001C (0x0004)
	FString                                                                                              DebugName;                                         // 0x0020 (0x000C)
	float                                                                                                DefaultExpirationAge;                              // 0x002C (0x0004)
	EAISenseNotifyType                                                                                   NotifyType;                                        // 0x0030 (0x0001)
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bWantsNewPawnNotification : 1;                     // 0x0034 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bAutoRegisterAllPawnsAsSources : 1;                // 0x0034 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_35[0x3];                               // 0x0035 (0x0003) MISSED OFFSET
	class UAIPerceptionSystem*                                                                           PerceptionSystemInstance;                          // 0x0038 (0x0004)
	uint8_t                                                                                              UnknownData_3C[0x28];                              // 0x003C (0x0028) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Sight
// 0x00A4 (0x0108)
class UAISense_Sight : public UAISense
{
public:
	uint8_t                                                                                              UnknownData_64[0x84];                              // 0x0064 (0x0084) MISSED OFFSET
	int32_t                                                                                              MaxTracesPerTick;                                  // 0x00E8 (0x0004)
	int32_t                                                                                              MinQueriesPerTimeSliceCheck;                       // 0x00EC (0x0004)
	double                                                                                               MaxTimeSlicePerTick;                               // 0x00F0 (0x0008)
	float                                                                                                HighImportanceQueryDistanceThreshold;              // 0x00F8 (0x0004)
	uint8_t                                                                                              UnknownData_FC[0x4];                               // 0x00FC (0x0004) MISSED OFFSET
	float                                                                                                MaxQueryImportance;                                // 0x0100 (0x0004)
	float                                                                                                SightLimitQueryImportance;                         // 0x0104 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Hearing
// 0x004C (0x00B0)
class UAISense_Hearing : public UAISense
{
public:
	TArray<FAINoiseEvent>                                                                                NoiseEvents;                                       // 0x0064 (0x000C)
	float                                                                                                SpeedOfSoundSq;                                    // 0x0070 (0x0004)
	uint8_t                                                                                              UnknownData_74[0x3C];                              // 0x0074 (0x003C) MISSED OFFSET
public:
	static void ReportNoiseEvent(class UObject* WorldContext, FVector NoiseLocation, float Loudness, class AActor* Instigator, float MaxRange, FName Tag); // Function /Script/AIModule.AISense_Hearing:ReportNoiseEvent
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Damage
// 0x000C (0x0070)
class UAISense_Damage : public UAISense
{
public:
	TArray<FAIDamageEvent>                                                                               RegisteredEvents;                                  // 0x0064 (0x000C)
public:
	static void ReportDamageEvent(class UObject* WorldContext, class AActor* DamagedActor, class AActor* Instigator, float DamageAmount, FVector EventLocation, FVector HitLocation); // Function /Script/AIModule.AISense_Damage:ReportDamageEvent
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Touch
// 0x000C (0x0070)
class UAISense_Touch : public UAISense
{
public:
	TArray<FAITouchEvent>                                                                                RegisteredEvents;                                  // 0x0064 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Team
// 0x000C (0x0070)
class UAISense_Team : public UAISense
{
public:
	TArray<FAITeamStimulusEvent>                                                                         RegisteredEvents;                                  // 0x0064 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISense_Prediction
// 0x000C (0x0070)
class UAISense_Prediction : public UAISense
{
public:
	TArray<FAIPredictionEvent>                                                                           RegisteredEvents;                                  // 0x0064 (0x000C)
public:
	static void RequestPawnPredictionEvent(class APawn* Requestor, class AActor* PredictedActor, float PredictionTime); // Function /Script/AIModule.AISense_Prediction:RequestPawnPredictionEvent
	static void RequestControllerPredictionEvent(class AAIController* Requestor, class AActor* PredictedActor, float PredictionTime); // Function /Script/AIModule.AISense_Prediction:RequestControllerPredictionEvent
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIHotSpotManager
// 0x0000 (0x001C)
class UAIHotSpotManager : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.GenericTeamAgentInterface
// 0x0000 (0x001C)
class UGenericTeamAgentInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.PathFollowingComponent
// 0x014C (0x01D8)
class UPathFollowingComponent : public UActorComponent
{
public:
	uint8_t                                                                                              UnknownData_8C[0x28];                              // 0x008C (0x0028) MISSED OFFSET
	class UNavMovementComponent*                                                                         MovementComp;                                      // 0x00B4 (0x0004)
	uint8_t                                                                                              UnknownData_B8[0x8];                               // 0x00B8 (0x0008) MISSED OFFSET
	class ANavigationData*                                                                               MyNavData;                                         // 0x00C0 (0x0004)
	uint8_t                                                                                              UnknownData_C4[0x8C];                              // 0x00C4 (0x008C) MISSED OFFSET
	uint8_t                                                                                              bUseVisibilityTestsSimplification : 1;             // 0x0150 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_151[0x87];                             // 0x0151 (0x0087) MISSED OFFSET
public:
	void OnActorBump(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult Hit); // Function /Script/AIModule.PathFollowingComponent:OnActorBump
	FVector GetPathDestination() const; // Function /Script/AIModule.PathFollowingComponent:GetPathDestination
	EPathFollowingAction GetPathActionType() const; // Function /Script/AIModule.PathFollowingComponent:GetPathActionType
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.CrowdFollowingComponent
// 0x0040 (0x0218)
class UCrowdFollowingComponent : public UPathFollowingComponent
{
public:
	uint8_t                                                                                              UnknownData_1D8[0x4];                              // 0x01D8 (0x0004) MISSED OFFSET
	FVector                                                                                              CrowdAgentMoveDirection;                           // 0x01DC (0x000C)
	class UCharacterMovementComponent*                                                                   CharacterMovement;                                 // 0x01E8 (0x0004)
	FNavAvoidanceMask                                                                                    AvoidanceGroup;                                    // 0x01EC (0x0004)
	FNavAvoidanceMask                                                                                    GroupsToAvoid;                                     // 0x01F0 (0x0004)
	FNavAvoidanceMask                                                                                    GroupsToIgnore;                                    // 0x01F4 (0x0004)
	uint8_t                                                                                              UnknownData_1F8[0x20];                             // 0x01F8 (0x0020) MISSED OFFSET
public:
	void SuspendCrowdSteering(bool bSuspend); // Function /Script/AIModule.CrowdFollowingComponent:SuspendCrowdSteering
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIController
// 0x0048 (0x02D0)
class AAIController : public AController
{
public:
	uint8_t                                                                                              UnknownData_288[0x1C];                             // 0x0288 (0x001C) MISSED OFFSET
	uint8_t                                                                                              bStopAILogicOnUnposses : 1;                        // 0x02A4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bLOSflag : 1;                                      // 0x02A4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bSkipExtraLOSChecks : 1;                           // 0x02A4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bAllowStrafe : 1;                                  // 0x02A4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bWantsPlayerState : 1;                             // 0x02A4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              UnknownData_2A5[0x3];                              // 0x02A5 (0x0003) MISSED OFFSET
	class UPathFollowingComponent*                                                                       PathFollowingComponent;                            // 0x02A8 (0x0004)
	class UBrainComponent*                                                                               BrainComponent;                                    // 0x02AC (0x0004)
	class UAIPerceptionComponent*                                                                        PerceptionComponent;                               // 0x02B0 (0x0004)
	class UPawnActionsComponent*                                                                         ActionsComp;                                       // 0x02B4 (0x0004)
	class UBlackboardComponent*                                                                          Blackboard;                                        // 0x02B8 (0x0004)
	class UGameplayTasksComponent*                                                                       CachedGameplayTasksComponent;                      // 0x02BC (0x0004)
	struct FAIModule_AIMoveCompletedSignature__DelegateSignature                                         ReceiveMoveCompleted;                              // 0x02C0 (0x000C)
	uint8_t                                                                                              UnknownData_2CC[0x4];                              // 0x02CC (0x0004) MISSED OFFSET
public:
	bool UseBlackboard(class UBlackboardData* BlackboardAsset, class UBlackboardComponent* BlackboardComponent); // Function /Script/AIModule.AIController:UseBlackboard
	void SetMoveBlockDetection(bool bEnable); // Function /Script/AIModule.AIController:SetMoveBlockDetection
	bool RunBehaviorTree(class UBehaviorTree* BTAsset); // Function /Script/AIModule.AIController:RunBehaviorTree
	void OnUsingBlackBoard(class UBlackboardComponent* BlackboardComp, class UBlackboardData* BlackboardAsset); // Function /Script/AIModule.AIController:OnUsingBlackBoard
	void OnUnpossess(class APawn* UnpossessedPawn); // Function /Script/AIModule.AIController:OnUnpossess
	void OnPossess(class APawn* PossessedPawn); // Function /Script/AIModule.AIController:OnPossess
	void OnGameplayTaskResourcesClaimed(FGameplayResourceSet NewlyClaimed, FGameplayResourceSet FreshlyReleased); // Function /Script/AIModule.AIController:OnGameplayTaskResourcesClaimed
	EPathFollowingRequestResult MoveToLocation(FVector Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, class UClass* FilterClass, bool bAllowPartialPath); // Function /Script/AIModule.AIController:MoveToLocation
	EPathFollowingRequestResult MoveToActor(class AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, class UClass* FilterClass, bool bAllowPartialPath); // Function /Script/AIModule.AIController:MoveToActor
	void K2_SetFocus(class AActor* NewFocus); // Function /Script/AIModule.AIController:K2_SetFocus
	void K2_SetFocalPoint(FVector FP); // Function /Script/AIModule.AIController:K2_SetFocalPoint
	void K2_ClearFocus(); // Function /Script/AIModule.AIController:K2_ClearFocus
	bool HasPartialPath() const; // Function /Script/AIModule.AIController:HasPartialPath
	class UPathFollowingComponent* GetPathFollowingComponent() const; // Function /Script/AIModule.AIController:GetPathFollowingComponent
	EPathFollowingStatus GetMoveStatus() const; // Function /Script/AIModule.AIController:GetMoveStatus
	FVector GetImmediateMoveDestination() const; // Function /Script/AIModule.AIController:GetImmediateMoveDestination
	class AActor* GetFocusActor() const; // Function /Script/AIModule.AIController:GetFocusActor
	FVector GetFocalPointOnActor(class AActor* Actor) const; // Function /Script/AIModule.AIController:GetFocalPointOnActor
	FVector GetFocalPoint() const; // Function /Script/AIModule.AIController:GetFocalPoint
	class UAIPerceptionComponent* GetAIPerceptionComponent(); // Function /Script/AIModule.AIController:GetAIPerceptionComponent
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIDataProvider
// 0x0000 (0x001C)
class UAIDataProvider : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIPerceptionComponent
// 0x00AC (0x0138)
class UAIPerceptionComponent : public UActorComponent
{
public:
	float                                                                                                HearingRange;                                      // 0x008C (0x0004)
	float                                                                                                LoSHearingRange;                                   // 0x0090 (0x0004)
	float                                                                                                SightRadius;                                       // 0x0094 (0x0004)
	float                                                                                                LoseSightRadius;                                   // 0x0098 (0x0004)
	float                                                                                                PeripheralVisionAngle;                             // 0x009C (0x0004)
	TArray<class UAISenseConfig*>                                                                        SensesConfig;                                      // 0x00A0 (0x000C)
	class UClass*                                                                                        DominantSense;                                     // 0x00AC (0x0004)
	uint8_t                                                                                              UnknownData_B0[0xC];                               // 0x00B0 (0x000C) MISSED OFFSET
	class AAIController*                                                                                 AIOwner;                                           // 0x00BC (0x0004)
	uint8_t                                                                                              UnknownData_C0[0x5C];                              // 0x00C0 (0x005C) MISSED OFFSET
	struct FAIModule_PerceptionUpdatedDelegate__DelegateSignature                                        OnPerceptionUpdated;                               // 0x011C (0x000C)
	struct FAIModule_ActorPerceptionUpdatedDelegate__DelegateSignature                                   OnTargetPerceptionUpdated;                         // 0x0128 (0x000C)
	uint8_t                                                                                              UnknownData_134[0x4];                              // 0x0134 (0x0004) MISSED OFFSET
public:
	void RequestStimuliListenerUpdate(); // Function /Script/AIModule.AIPerceptionComponent:RequestStimuliListenerUpdate
	void OnOwnerEndPlay(EEndPlayReason EndPlayReason); // Function /Script/AIModule.AIPerceptionComponent:OnOwnerEndPlay
	void GetPerceivedHostileActors(TArray<class AActor*> OutActors) const; // Function /Script/AIModule.AIPerceptionComponent:GetPerceivedHostileActors
	void GetPerceivedActors(class UClass* SenseToUse, TArray<class AActor*> OutActors) const; // Function /Script/AIModule.AIPerceptionComponent:GetPerceivedActors
	bool GetActorsPerception(class AActor* Actor, FActorPerceptionBlueprintInfo Info); // Function /Script/AIModule.AIPerceptionComponent:GetActorsPerception
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIPerceptionSystem
// 0x00C0 (0x00DC)
class UAIPerceptionSystem : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x40];                              // 0x001C (0x0040) MISSED OFFSET
	TArray<class UAISense*>                                                                              Senses;                                            // 0x005C (0x000C)
	float                                                                                                PerceptionAgingRate;                               // 0x0068 (0x0004)
	uint8_t                                                                                              UnknownData_6C[0x70];                              // 0x006C (0x0070) MISSED OFFSET
public:
	static void ReportPerceptionEvent(class UObject* WorldContext, class UAISenseEvent* PerceptionEvent); // Function /Script/AIModule.AIPerceptionSystem:ReportPerceptionEvent
	void ReportEvent(class UAISenseEvent* PerceptionEvent); // Function /Script/AIModule.AIPerceptionSystem:ReportEvent
	static bool RegisterPerceptionStimuliSource(class UObject* WorldContext, class UClass* Sense, class AActor* Target); // Function /Script/AIModule.AIPerceptionSystem:RegisterPerceptionStimuliSource
	void OnPerceptionStimuliSourceEndPlay(EEndPlayReason EndPlayReason); // Function /Script/AIModule.AIPerceptionSystem:OnPerceptionStimuliSourceEndPlay
	static class UClass* GetSenseClassForStimulus(class UObject* WorldContext, FAIStimulus Stimulus); // Function /Script/AIModule.AIPerceptionSystem:GetSenseClassForStimulus
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AISystem
// 0x008C (0x00C0)
class UAISystem : public UAISystemBase
{
public:
	FStringClassReference                                                                                PerceptionSystemClassName;                         // 0x0034 (0x000C)
	FStringClassReference                                                                                HotSpotManagerClassName;                           // 0x0040 (0x000C)
	float                                                                                                AcceptanceRadius;                                  // 0x004C (0x0004)
	float                                                                                                PathfollowingRegularPathPointAcceptanceRadius;     // 0x0050 (0x0004)
	float                                                                                                PathfollowingNavLinkAcceptanceRadius;              // 0x0054 (0x0004)
	bool                                                                                                 bFinishMoveOnGoalOverlap;                          // 0x0058 (0x0001)
	bool                                                                                                 bAcceptPartialPaths;                               // 0x0059 (0x0001)
	bool                                                                                                 bAllowStrafing;                                    // 0x005A (0x0001)
	bool                                                                                                 bEnableBTAITasks;                                  // 0x005B (0x0001)
	bool                                                                                                 bAllowControllersAsEQSQuerier;                     // 0x005C (0x0001)
	uint8_t                                                                                              UnknownData_5D[0x3];                               // 0x005D (0x0003) MISSED OFFSET
	class UBehaviorTreeManager*                                                                          BehaviorTreeManager;                               // 0x0060 (0x0004)
	class UEnvQueryManager*                                                                              EnvironmentQueryManager;                           // 0x0064 (0x0004)
	class UAIPerceptionSystem*                                                                           PerceptionSystem;                                  // 0x0068 (0x0004)
	TArray<class UAIAsyncTaskBlueprintProxy*>                                                            AllProxyObjects;                                   // 0x006C (0x000C)
	class UAIHotSpotManager*                                                                             HotSpotManager;                                    // 0x0078 (0x0004)
	uint8_t                                                                                              UnknownData_7C[0x44];                              // 0x007C (0x0044) MISSED OFFSET
public:
	void AILoggingVerbose(); // Function /Script/AIModule.AISystem:AILoggingVerbose
	void AIIgnorePlayers(); // Function /Script/AIModule.AISystem:AIIgnorePlayers
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BrainComponent
// 0x003C (0x00C8)
class UBrainComponent : public UActorComponent
{
public:
	uint8_t                                                                                              UnknownData_8C[0x4];                               // 0x008C (0x0004) MISSED OFFSET
	class UBlackboardComponent*                                                                          BlackboardComp;                                    // 0x0090 (0x0004)
	class AAIController*                                                                                 AIOwner;                                           // 0x0094 (0x0004)
	uint8_t                                                                                              UnknownData_98[0x30];                              // 0x0098 (0x0030) MISSED OFFSET
public:
	void StopLogic(FString Reason); // Function /Script/AIModule.BrainComponent:StopLogic
	void RestartLogic(); // Function /Script/AIModule.BrainComponent:RestartLogic
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BehaviorTreeComponent
// 0x00E4 (0x01AC)
class UBehaviorTreeComponent : public UBrainComponent
{
public:
	uint8_t                                                                                              UnknownData_C8[0x18];                              // 0x00C8 (0x0018) MISSED OFFSET
	TArray<class UBTNode*>                                                                               NodeInstances;                                     // 0x00E0 (0x000C)
	uint8_t                                                                                              UnknownData_EC[0xC0];                              // 0x00EC (0x00C0) MISSED OFFSET
public:
	void SetDynamicSubtree(FGameplayTag InjectTag, class UBehaviorTree* BehaviorAsset); // Function /Script/AIModule.BehaviorTreeComponent:SetDynamicSubtree
	float GetTagCooldownEndTime(FGameplayTag CooldownTag) const; // Function /Script/AIModule.BehaviorTreeComponent:GetTagCooldownEndTime
	void AddCooldownTagDuration(FGameplayTag CooldownTag, float CooldownDuration, bool bAddToExistingDuration); // Function /Script/AIModule.BehaviorTreeComponent:AddCooldownTagDuration
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTNode
// 0x0020 (0x003C)
class UBTNode : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
	FString                                                                                              NodeName;                                          // 0x0020 (0x000C)
	class UBehaviorTree*                                                                                 TreeAsset;                                         // 0x002C (0x0004)
	class UBTCompositeNode*                                                                              ParentNode;                                        // 0x0030 (0x0004)
	uint8_t                                                                                              UnknownData_34[0x8];                               // 0x0034 (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTAuxiliaryNode
// 0x0004 (0x0040)
class UBTAuxiliaryNode : public UBTNode
{
public:
	uint8_t                                                                                              UnknownData_3C[0x4];                               // 0x003C (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTDecorator
// 0x0008 (0x0048)
class UBTDecorator : public UBTAuxiliaryNode
{
public:
	uint8_t                                                                                              bInverseCondition : 1;                             // 0x0040 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x80]
	uint8_t                                                                                              UnknownData_41[0x3];                               // 0x0041 (0x0003) MISSED OFFSET
	EBTFlowAbortMode                                                                                     FlowAbortMode;                                     // 0x0044 (0x0001)
	uint8_t                                                                                              UnknownData_45[0x3];                               // 0x0045 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTService
// 0x000C (0x004C)
class UBTService : public UBTAuxiliaryNode
{
public:
	float                                                                                                Interval;                                          // 0x0040 (0x0004)
	float                                                                                                RandomDeviation;                                   // 0x0044 (0x0004)
	uint8_t                                                                                              bCallTickOnSearchStart : 1;                        // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bRestartTimerOnEachActivation : 1;                 // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_49[0x3];                               // 0x0049 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTTaskNode
// 0x0004 (0x0040)
class UBTTaskNode : public UBTNode
{
public:
	uint8_t                                                                                              bIgnoreRestartSelf : 1;                            // 0x003C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_3D[0x3];                               // 0x003D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTTask_PawnActionBase
// 0x0000 (0x0040)
class UBTTask_PawnActionBase : public UBTTaskNode
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTTask_BlackboardBase
// 0x0020 (0x0060)
class UBTTask_BlackboardBase : public UBTTaskNode
{
public:
	FBlackboardKeySelector                                                                               BlackboardKey;                                     // 0x0040 (0x0020)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTTask_MoveDirectlyToward
// 0x0008 (0x0068)
class UBTTask_MoveDirectlyToward : public UBTTask_BlackboardBase
{
public:
	float                                                                                                AcceptableRadius;                                  // 0x0060 (0x0004)
	uint8_t                                                                                              bDisablePathUpdateOnGoalLocationChange : 1;        // 0x0064 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bProjectVectorGoalToNavigation : 1;                // 0x0064 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bAllowStrafe : 1;                                  // 0x0064 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bStopOnOverlap : 1;                                // 0x0064 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_65[0x3];                               // 0x0065 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BTTask_MoveTo
// 0x0010 (0x0070)
class UBTTask_MoveTo : public UBTTask_BlackboardBase
{
public:
	float                                                                                                AcceptableRadius;                                  // 0x0060 (0x0004)
	class UClass*                                                                                        FilterClass;                                       // 0x0064 (0x0004)
	float                                                                                                ObservedBlackboardValueTolerance;                  // 0x0068 (0x0004)
	uint8_t                                                                                              bAllowStrafe : 1;                                  // 0x006C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bAllowPartialPath : 1;                             // 0x006C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bStopOnOverlap : 1;                                // 0x006C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bObserveBlackboardValue : 1;                       // 0x006C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_6D[0x3];                               // 0x006D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.CrowdManager
// 0x008C (0x00A8)
class UCrowdManager : public UObject
{
public:
	class ANavigationData*                                                                               MyNavData;                                         // 0x001C (0x0004)
	TArray<FCrowdAvoidanceConfig>                                                                        AvoidanceConfig;                                   // 0x0020 (0x000C)
	TArray<FCrowdAvoidanceSamplingPattern>                                                               SamplingPatterns;                                  // 0x002C (0x000C)
	int32_t                                                                                              MaxAgents;                                         // 0x0038 (0x0004)
	float                                                                                                MaxAgentRadius;                                    // 0x003C (0x0004)
	int32_t                                                                                              MaxAvoidedAgents;                                  // 0x0040 (0x0004)
	int32_t                                                                                              MaxAvoidedWalls;                                   // 0x0044 (0x0004)
	float                                                                                                NavmeshCheckInterval;                              // 0x0048 (0x0004)
	float                                                                                                PathOptimizationInterval;                          // 0x004C (0x0004)
	uint8_t                                                                                              bResolveCollisions : 1;                            // 0x0050 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_51[0x57];                              // 0x0051 (0x0057) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.PawnAction
// 0x0048 (0x0064)
class UPawnAction : public UObject
{
public:
	class UPawnAction*                                                                                   ChildAction;                                       // 0x001C (0x0004)
	class UPawnAction*                                                                                   ParentAction;                                      // 0x0020 (0x0004)
	class UPawnActionsComponent*                                                                         OwnerComponent;                                    // 0x0024 (0x0004)
	class UObject*                                                                                       Instigator;                                        // 0x0028 (0x0004)
	class UBrainComponent*                                                                               BrainComp;                                         // 0x002C (0x0004)
	uint8_t                                                                                              UnknownData_30[0x20];                              // 0x0030 (0x0020) MISSED OFFSET
	uint8_t                                                                                              bAllowNewSameClassInstance : 1;                    // 0x0050 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bReplaceActiveSameClassInstance : 1;               // 0x0050 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bShouldPauseMovement : 1;                          // 0x0050 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bAlwaysNotifyOnFinished : 1;                       // 0x0050 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_51[0x13];                              // 0x0051 (0x0013) MISSED OFFSET
public:
	EAIRequestPriority GetActionPriority(); // Function /Script/AIModule.PawnAction:GetActionPriority
	void Finish(EPawnActionResult WithResult); // Function /Script/AIModule.PawnAction:Finish
	static class UPawnAction* CreateActionInstance(class UObject* WorldContextObject, class UClass* ActionClass); // Function /Script/AIModule.PawnAction:CreateActionInstance
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.PawnAction_Move
// 0x0034 (0x0098)
class UPawnAction_Move : public UPawnAction
{
public:
	class AActor*                                                                                        GoalActor;                                         // 0x0064 (0x0004)
	FVector                                                                                              GoalLocation;                                      // 0x0068 (0x000C)
	float                                                                                                AcceptableRadius;                                  // 0x0074 (0x0004)
	class UClass*                                                                                        FilterClass;                                       // 0x0078 (0x0004)
	uint8_t                                                                                              bAllowStrafe : 1;                                  // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bFinishOnOverlap : 1;                              // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bUsePathfinding : 1;                               // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bAllowPartialPath : 1;                             // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bProjectGoalToNavigation : 1;                      // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bUpdatePathToGoal : 1;                             // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              bAbortChildActionOnPathChange : 1;                 // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x40]
	uint8_t                                                                                              UnknownData_7D[0x1B];                              // 0x007D (0x001B) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryContext
// 0x0000 (0x001C)
class UEnvQueryContext : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryNode
// 0x0004 (0x0020)
class UEnvQueryNode : public UObject
{
public:
	int32_t                                                                                              VerNum;                                            // 0x001C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryGenerator
// 0x0014 (0x0034)
class UEnvQueryGenerator : public UEnvQueryNode
{
public:
	FString                                                                                              OptionName;                                        // 0x0020 (0x000C)
	class UClass*                                                                                        ItemType;                                          // 0x002C (0x0004)
	uint8_t                                                                                              bAutoSortTests : 1;                                // 0x0030 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryGenerator_ProjectedPoints
// 0x0028 (0x005C)
class UEnvQueryGenerator_ProjectedPoints : public UEnvQueryGenerator
{
public:
	FEnvTraceData                                                                                        ProjectionData;                                    // 0x0034 (0x0028)
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryGenerator_OnCircle
// 0x00D8 (0x0134)
class UEnvQueryGenerator_OnCircle : public UEnvQueryGenerator_ProjectedPoints
{
public:
	FAIDataProviderFloatValue                                                                            CircleRadius;                                      // 0x005C (0x001C)
	FAIDataProviderFloatValue                                                                            SpaceBetween;                                      // 0x0078 (0x001C)
	FAIDataProviderIntValue                                                                              NumberOfPoints;                                    // 0x0094 (0x001C)
	EPointOnCircleSpacingMethod                                                                          PointOnCircleSpacingMethod;                        // 0x00B0 (0x0001)
	uint8_t                                                                                              UnknownData_B1[0x3];                               // 0x00B1 (0x0003) MISSED OFFSET
	FEnvDirection                                                                                        ArcDirection;                                      // 0x00B4 (0x0010)
	FAIDataProviderFloatValue                                                                            ArcAngle;                                          // 0x00C4 (0x001C)
	float                                                                                                AngleRadians;                                      // 0x00E0 (0x0004)
	class UClass*                                                                                        CircleCenter;                                      // 0x00E4 (0x0004)
	bool                                                                                                 bIgnoreAnyContextActorsWhenGeneratingCircle;       // 0x00E8 (0x0001)
	uint8_t                                                                                              UnknownData_E9[0x3];                               // 0x00E9 (0x0003) MISSED OFFSET
	FAIDataProviderFloatValue                                                                            CircleCenterZOffset;                               // 0x00EC (0x001C)
	FEnvTraceData                                                                                        TraceData;                                         // 0x0108 (0x0028)
	uint8_t                                                                                              bDefineArc : 1;                                    // 0x0130 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_131[0x3];                              // 0x0131 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryItemType
// 0x0004 (0x0020)
class UEnvQueryItemType : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryItemType_VectorBase
// 0x0000 (0x0020)
class UEnvQueryItemType_VectorBase : public UEnvQueryItemType
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryItemType_ActorBase
// 0x0000 (0x0020)
class UEnvQueryItemType_ActorBase : public UEnvQueryItemType_VectorBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryItemType_Point
// 0x0000 (0x0020)
class UEnvQueryItemType_Point : public UEnvQueryItemType_VectorBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.EnvQueryTest
// 0x00EC (0x010C)
class UEnvQueryTest : public UEnvQueryNode
{
public:
	int32_t                                                                                              TestOrder;                                         // 0x0020 (0x0004)
	EEnvTestPurpose                                                                                      TestPurpose;                                       // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
	FString                                                                                              TestComment;                                       // 0x0028 (0x000C)
	EEnvTestFilterOperator                                                                               MultipleContextFilterOp;                           // 0x0034 (0x0001)
	EEnvTestScoreOperator                                                                                MultipleContextScoreOp;                            // 0x0035 (0x0001)
	EEnvTestFilterType                                                                                   FilterType;                                        // 0x0036 (0x0001)
	uint8_t                                                                                              UnknownData_37[0x1];                               // 0x0037 (0x0001) MISSED OFFSET
	FAIDataProviderBoolValue                                                                             BoolValue;                                         // 0x0038 (0x001C)
	FAIDataProviderFloatValue                                                                            FloatValueMin;                                     // 0x0054 (0x001C)
	FAIDataProviderFloatValue                                                                            FloatValueMax;                                     // 0x0070 (0x001C)
	uint8_t                                                                                              UnknownData_8C[0x1];                               // 0x008C (0x0001) MISSED OFFSET
	EEnvTestScoreEquation                                                                                ScoringEquation;                                   // 0x008D (0x0001)
	EEnvQueryTestClamping                                                                                ClampMinType;                                      // 0x008E (0x0001)
	EEnvQueryTestClamping                                                                                ClampMaxType;                                      // 0x008F (0x0001)
	FAIDataProviderFloatValue                                                                            ScoreClampMin;                                     // 0x0090 (0x001C)
	FAIDataProviderFloatValue                                                                            ScoreClampMax;                                     // 0x00AC (0x001C)
	FAIDataProviderFloatValue                                                                            ScoringFactor;                                     // 0x00C8 (0x001C)
	FAIDataProviderFloatValue                                                                            SweetSpotValue;                                    // 0x00E4 (0x001C)
	bool                                                                                                 bDefineSweetSpot;                                  // 0x0100 (0x0001)
	uint8_t                                                                                              UnknownData_101[0x7];                              // 0x0101 (0x0007) MISSED OFFSET
	uint8_t                                                                                              bWorkOnFloatValues : 1;                            // 0x0108 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_109[0x3];                              // 0x0109 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIResourceInterface
// 0x0000 (0x001C)
class UAIResourceInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIAsyncTaskBlueprintProxy
// 0x0030 (0x004C)
class UAIAsyncTaskBlueprintProxy : public UObject
{
public:
	struct FAIModule_OAISimpleDelegate__DelegateSignature                                                OnSuccess;                                         // 0x001C (0x000C)
	struct FAIModule_OAISimpleDelegate__DelegateSignature                                                OnFail;                                            // 0x0028 (0x000C)
	uint8_t                                                                                              UnknownData_34[0x18];                              // 0x0034 (0x0018) MISSED OFFSET
public:
	void OnMoveCompleted(FAIRequestID RequestID, EPathFollowingResult MovementResult); // Function /Script/AIModule.AIAsyncTaskBlueprintProxy:OnMoveCompleted
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIBlueprintHelperLibrary
// 0x0000 (0x001C)
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary
{
public:
	static void UnlockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic); // Function /Script/AIModule.AIBlueprintHelperLibrary:UnlockAIResourcesWithAnimation
	static class APawn* SpawnAIFromClass(class UObject* WorldContextObject, class UClass* PawnClass, class UBehaviorTree* BehaviorTree, FVector Location, FRotator Rotation, bool bNoCollisionFail); // Function /Script/AIModule.AIBlueprintHelperLibrary:SpawnAIFromClass
	static void SendAIMessage(class APawn* Target, FName Message, class UObject* MessageSource, bool bSuccess); // Function /Script/AIModule.AIBlueprintHelperLibrary:SendAIMessage
	static void LockAIResourcesWithAnimation(class UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic); // Function /Script/AIModule.AIBlueprintHelperLibrary:LockAIResourcesWithAnimation
	static bool IsValidAIRotation(FRotator Rotation); // Function /Script/AIModule.AIBlueprintHelperLibrary:IsValidAIRotation
	static bool IsValidAILocation(FVector Location); // Function /Script/AIModule.AIBlueprintHelperLibrary:IsValidAILocation
	static bool IsValidAIDirection(FVector DirectionVector); // Function /Script/AIModule.AIBlueprintHelperLibrary:IsValidAIDirection
	static class UBlackboardComponent* GetBlackboard(class AActor* Target); // Function /Script/AIModule.AIBlueprintHelperLibrary:GetBlackboard
	static class AAIController* GetAIController(class AActor* ControlledActor); // Function /Script/AIModule.AIBlueprintHelperLibrary:GetAIController
	static class UAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(class UObject* WorldContextObject, class APawn* Pawn, FVector Destination, class AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap); // Function /Script/AIModule.AIBlueprintHelperLibrary:CreateMoveToProxyObject
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.PawnActionsComponent
// 0x0028 (0x00B4)
class UPawnActionsComponent : public UActorComponent
{
public:
	class APawn*                                                                                         ControlledPawn;                                    // 0x008C (0x0004)
	TArray<FPawnActionStack>                                                                             ActionStacks;                                      // 0x0090 (0x000C)
	TArray<FPawnActionEvent>                                                                             ActionEvents;                                      // 0x009C (0x000C)
	class UPawnAction*                                                                                   CurrentAction;                                     // 0x00A8 (0x0004)
	uint8_t                                                                                              UnknownData_AC[0x8];                               // 0x00AC (0x0008) MISSED OFFSET
public:
	bool K2_PushAction(class UPawnAction* NewAction, EAIRequestPriority Priority, class UObject* Instigator); // Function /Script/AIModule.PawnActionsComponent:K2_PushAction
	static bool K2_PerformAction(class APawn* Pawn, class UPawnAction* Action, EAIRequestPriority Priority); // Function /Script/AIModule.PawnActionsComponent:K2_PerformAction
	EPawnActionAbortState K2_ForceAbortAction(class UPawnAction* ActionToAbort); // Function /Script/AIModule.PawnActionsComponent:K2_ForceAbortAction
	EPawnActionAbortState K2_AbortAction(class UPawnAction* ActionToAbort); // Function /Script/AIModule.PawnActionsComponent:K2_AbortAction
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIPerceptionListenerInterface
// 0x0000 (0x001C)
class UAIPerceptionListenerInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.BehaviorTreeTypes
// 0x0000 (0x001C)
class UBehaviorTreeTypes : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.DetourCrowdAIController
// 0x0000 (0x02D0)
class ADetourCrowdAIController : public AAIController
{
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIDataProvider_QueryParams
// 0x0014 (0x0030)
class UAIDataProvider_QueryParams : public UAIDataProvider
{
public:
	FName                                                                                                ParamName;                                         // 0x001C (0x0008)
	float                                                                                                FloatValue;                                        // 0x0024 (0x0004)
	int32_t                                                                                              IntValue;                                          // 0x0028 (0x0004)
	bool                                                                                                 BoolValue;                                         // 0x002C (0x0001)
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/AIModule.AIModuleBasicGameplayDebuggerObject
// 0x00D4 (0x0138)
class UAIModuleBasicGameplayDebuggerObject : public UGameplayDebuggerBaseObject
{
public:
	FString                                                                                              ControllerName;                                    // 0x0064 (0x000C)
	FString                                                                                              PawnName;                                          // 0x0070 (0x000C)
	FString                                                                                              PawnClass;                                         // 0x007C (0x000C)
	FString                                                                                              DebugIcon;                                         // 0x0088 (0x000C)
	FString                                                                                              MovementBaseInfo;                                  // 0x0094 (0x000C)
	FString                                                                                              MovementModeInfo;                                  // 0x00A0 (0x000C)
	FString                                                                                              PathFollowingInfo;                                 // 0x00AC (0x000C)
	FString                                                                                              CurrentAITask;                                     // 0x00B8 (0x000C)
	FString                                                                                              CurrentAIState;                                    // 0x00C4 (0x000C)
