#pragma once
#include "FN_Basic.h"

#include "FN_AnimGraphRuntime_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AnimGraphRuntime
*/

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_ApplyAdditive
// 0x0028 (0x0048)
struct FAnimNode_ApplyAdditive : public FAnimNode_Base
{
	FPoseLink                                                                                            Base;                                              // 0x0020 (0x000C)
	FPoseLink                                                                                            Additive;                                          // 0x002C (0x000C)
	float                                                                                                Alpha;                                             // 0x0038 (0x0004)
	FInputScaleBias                                                                                      AlphaScaleBias;                                    // 0x003C (0x0008)
	int32_t                                                                                              LODThreshold;                                      // 0x0044 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendListBase
// 0x0068 (0x0088)
struct FAnimNode_BlendListBase : public FAnimNode_Base
{
	TArray<FPoseLink>                                                                                    BlendPose;                                         // 0x0020 (0x000C)
	TArray<float>                                                                                        BlendTime;                                         // 0x002C (0x000C)
	EAlphaBlendOption                                                                                    BlendType;                                         // 0x0038 (0x0001)
	uint8_t                                                                                              UnknownData_39[0x3];                               // 0x0039 (0x0003) MISSED OFFSET
	class UCurveFloat*                                                                                   CustomBlendCurve;                                  // 0x003C (0x0004)
	class UBlendProfile*                                                                                 BlendProfile;                                      // 0x0040 (0x0004)
	TArray<FAlphaBlend>                                                                                  Blends;                                            // 0x0044 (0x000C)
	TArray<float>                                                                                        BlendWeights;                                      // 0x0050 (0x000C)
	TArray<float>                                                                                        RemainingBlendTimes;                               // 0x005C (0x000C)
	int32_t                                                                                              LastActiveChildIndex;                              // 0x0068 (0x0004)
	TArray<FBlendSampleData>                                                                             PerBoneSampleData;                                 // 0x006C (0x000C)
	uint8_t                                                                                              UnknownData_78[0xC];                               // 0x0078 (0x000C) MISSED OFFSET
	bool                                                                                                 bResetChildOnActivation;                           // 0x0084 (0x0001)
	uint8_t                                                                                              UnknownData_85[0x3];                               // 0x0085 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendListByBool
// 0x0004 (0x008C)
struct FAnimNode_BlendListByBool : public FAnimNode_BlendListBase
{
	bool                                                                                                 bActiveValue;                                      // 0x0088 (0x0001)
	uint8_t                                                                                              UnknownData_89[0x3];                               // 0x0089 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendListByEnum
// 0x0010 (0x0098)
struct FAnimNode_BlendListByEnum : public FAnimNode_BlendListBase
{
	TArray<int32_t>                                                                                      EnumToPoseIndex;                                   // 0x0088 (0x000C)
	uint8_t                                                                                              ActiveEnumValue;                                   // 0x0094 (0x0001)
	uint8_t                                                                                              UnknownData_95[0x3];                               // 0x0095 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendListByInt
// 0x0004 (0x008C)
struct FAnimNode_BlendListByInt : public FAnimNode_BlendListBase
{
	int32_t                                                                                              ActiveChildIndex;                                  // 0x0088 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendSpacePlayer
// 0x0094 (0x00DC)
struct FAnimNode_BlendSpacePlayer : public FAnimNode_AssetPlayerBase
{
	float                                                                                                X;                                                 // 0x0048 (0x0004)
	float                                                                                                Y;                                                 // 0x004C (0x0004)
	float                                                                                                Z;                                                 // 0x0050 (0x0004)
	float                                                                                                PlayRate;                                          // 0x0054 (0x0004)
	bool                                                                                                 bLoop;                                             // 0x0058 (0x0001)
	uint8_t                                                                                              UnknownData_59[0x3];                               // 0x0059 (0x0003) MISSED OFFSET
	float                                                                                                StartPosition;                                     // 0x005C (0x0004)
	class UBlendSpaceBase*                                                                               BlendSpace;                                        // 0x0060 (0x0004)
	FBlendFilter                                                                                         BlendFilter;                                       // 0x0064 (0x006C)
	TArray<FBlendSampleData>                                                                             BlendSampleDataCache;                              // 0x00D0 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BlendSpaceEvaluator
// 0x0004 (0x00E0)
struct FAnimNode_BlendSpaceEvaluator : public FAnimNode_BlendSpacePlayer
{
	float                                                                                                NormalizedTime;                                    // 0x00DC (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_SkeletalControlBase
// 0x0028 (0x0048)
struct FAnimNode_SkeletalControlBase : public FAnimNode_Base
{
	FComponentSpacePoseLink                                                                              ComponentPose;                                     // 0x0020 (0x000C)
	float                                                                                                Alpha;                                             // 0x002C (0x0004)
	FInputScaleBias                                                                                      AlphaScaleBias;                                    // 0x0030 (0x0008)
	int32_t                                                                                              LODThreshold;                                      // 0x0038 (0x0004)
	uint8_t                                                                                              UnknownData_3C[0xC];                               // 0x003C (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_CopyPoseFromMesh
// 0x0048 (0x0068)
struct FAnimNode_CopyPoseFromMesh : public FAnimNode_Base
{
	class USkeletalMeshComponent*                                                                        SourceMeshComponent;                               // 0x0020 (0x0004)
	uint8_t                                                                                              UnknownData_24[0x44];                              // 0x0024 (0x0044) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_LayeredBoneBlend
// 0x004C (0x006C)
struct FAnimNode_LayeredBoneBlend : public FAnimNode_Base
{
	FPoseLink                                                                                            BasePose;                                          // 0x0020 (0x000C)
	TArray<FPoseLink>                                                                                    BlendPoses;                                        // 0x002C (0x000C)
	TArray<FInputBlendPose>                                                                              LayerSetup;                                        // 0x0038 (0x000C)
	TArray<float>                                                                                        BlendWeights;                                      // 0x0044 (0x000C)
	bool                                                                                                 bMeshSpaceRotationBlend;                           // 0x0050 (0x0001)
	ECurveBlendOption                                                                                    CurveBlendOption;                                  // 0x0051 (0x0001)
	bool                                                                                                 bHasRelevantPoses;                                 // 0x0052 (0x0001)
	uint8_t                                                                                              UnknownData_53[0x19];                              // 0x0053 (0x0019) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.RandomPlayerSequenceEntry
// 0x0044 (0x0044)
struct FRandomPlayerSequenceEntry
{
	class UAnimSequence*                                                                                 Sequence;                                          // 0x0000 (0x0004)
	float                                                                                                ChanceToPlay;                                      // 0x0004 (0x0004)
	int32_t                                                                                              MinLoopCount;                                      // 0x0008 (0x0004)
	int32_t                                                                                              MaxLoopCount;                                      // 0x000C (0x0004)
	float                                                                                                MinPlayRate;                                       // 0x0010 (0x0004)
	float                                                                                                MaxPlayRate;                                       // 0x0014 (0x0004)
	FAlphaBlend                                                                                          BlendIn;                                           // 0x0018 (0x002C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_RandomPlayer
// 0x0048 (0x0068)
struct FAnimNode_RandomPlayer : public FAnimNode_Base
{
	bool                                                                                                 bShuffleMode;                                      // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	TArray<FRandomPlayerSequenceEntry>                                                                   Entries;                                           // 0x0024 (0x000C)
	uint8_t                                                                                              UnknownData_30[0x38];                              // 0x0030 (0x0038) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_MeshSpaceRefPose
// 0x0000 (0x0020)
struct FAnimNode_MeshSpaceRefPose : public FAnimNode_Base
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_RefPose
// 0x0004 (0x0024)
struct FAnimNode_RefPose : public FAnimNode_Base
{
	ERefPoseType                                                                                         RefPoseType;                                       // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_Root
// 0x000C (0x002C)
struct FAnimNode_Root : public FAnimNode_Base
{
	FPoseLink                                                                                            Result;                                            // 0x0020 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_RotateRootBone
// 0x0020 (0x0040)
struct FAnimNode_RotateRootBone : public FAnimNode_Base
{
	FPoseLink                                                                                            BasePose;                                          // 0x0020 (0x000C)
	float                                                                                                Pitch;                                             // 0x002C (0x0004)
	float                                                                                                Yaw;                                               // 0x0030 (0x0004)
	FRotator                                                                                             MeshToComponent;                                   // 0x0034 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_RotationOffsetBlendSpace
// 0x0010 (0x00EC)
struct FAnimNode_RotationOffsetBlendSpace : public FAnimNode_BlendSpacePlayer
{
	FPoseLink                                                                                            BasePose;                                          // 0x00DC (0x000C)
	int32_t                                                                                              LODThreshold;                                      // 0x00E8 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_SaveCachedPose
// 0x003C (0x005C)
struct FAnimNode_SaveCachedPose : public FAnimNode_Base
{
	FPoseLink                                                                                            Pose;                                              // 0x0020 (0x000C)
	uint8_t                                                                                              UnknownData_2C[0x30];                              // 0x002C (0x0030) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_SequenceEvaluator
// 0x000C (0x0054)
struct FAnimNode_SequenceEvaluator : public FAnimNode_AssetPlayerBase
{
	class UAnimSequenceBase*                                                                             Sequence;                                          // 0x0048 (0x0004)
	float                                                                                                ExplicitTime;                                      // 0x004C (0x0004)
	bool                                                                                                 bShouldLoopWhenInSyncGroup;                        // 0x0050 (0x0001)
	uint8_t                                                                                              UnknownData_51[0x3];                               // 0x0051 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_Slot
// 0x0024 (0x0044)
struct FAnimNode_Slot : public FAnimNode_Base
{
	FPoseLink                                                                                            Source;                                            // 0x0020 (0x000C)
	FName                                                                                                SlotName;                                          // 0x002C (0x0008)
	uint8_t                                                                                              UnknownData_34[0x10];                              // 0x0034 (0x0010) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimationNode_TwoWayBlend
// 0x0024 (0x0044)
struct FAnimationNode_TwoWayBlend : public FAnimNode_Base
{
	FPoseLink                                                                                            A;                                                 // 0x0020 (0x000C)
	FPoseLink                                                                                            B;                                                 // 0x002C (0x000C)
	float                                                                                                Alpha;                                             // 0x0038 (0x0004)
	FInputScaleBias                                                                                      AlphaScaleBias;                                    // 0x003C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimPhysConstraintSetup
// 0x005C (0x005C)
struct FAnimPhysConstraintSetup
{
	AnimPhysLinearConstraintType                                                                         LinearXLimitType;                                  // 0x0000 (0x0001)
	AnimPhysLinearConstraintType                                                                         LinearYLimitType;                                  // 0x0001 (0x0001)
	AnimPhysLinearConstraintType                                                                         LinearZLimitType;                                  // 0x0002 (0x0001)
	uint8_t                                                                                              UnknownData_3[0x1];                                // 0x0003 (0x0001) MISSED OFFSET
	FVector                                                                                              LinearAxesMin;                                     // 0x0004 (0x000C)
	FVector                                                                                              LinearAxesMax;                                     // 0x0010 (0x000C)
	AnimPhysAngularConstraintType                                                                        AngularConstraintType;                             // 0x001C (0x0001)
	AnimPhysTwistAxis                                                                                    TwistAxis;                                         // 0x001D (0x0001)
	uint8_t                                                                                              UnknownData_1E[0x2];                               // 0x001E (0x0002) MISSED OFFSET
	float                                                                                                ConeAngle;                                         // 0x0020 (0x0004)
	float                                                                                                AngularXAngle;                                     // 0x0024 (0x0004)
	float                                                                                                AngularYAngle;                                     // 0x0028 (0x0004)
	float                                                                                                AngularZAngle;                                     // 0x002C (0x0004)
	FVector                                                                                              AngularLimitsMin;                                  // 0x0030 (0x000C)
	FVector                                                                                              AngularLimitsMax;                                  // 0x003C (0x000C)
	AnimPhysTwistAxis                                                                                    AngularTargetAxis;                                 // 0x0048 (0x0001)
	uint8_t                                                                                              UnknownData_49[0x3];                               // 0x0049 (0x0003) MISSED OFFSET
	FVector                                                                                              AngularTarget;                                     // 0x004C (0x000C)
	bool                                                                                                 bLinearFullyLocked;                                // 0x0058 (0x0001)
	uint8_t                                                                                              UnknownData_59[0x3];                               // 0x0059 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimPhysPlanarLimit
// 0x0040 (0x0040)
struct FAnimPhysPlanarLimit
{
	FBoneReference                                                                                       DrivingBone;                                       // 0x0000 (0x000C)
	uint8_t                                                                                              UnknownData_C[0x4];                                // 0x000C (0x0004) MISSED OFFSET
	FTransform                                                                                           PlaneTransform;                                    // 0x0010 (0x0030)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_AnimDynamics
// 0x014C (0x0194)
struct FAnimNode_AnimDynamics : public FAnimNode_SkeletalControlBase
{
	bool                                                                                                 bChain;                                            // 0x0048 (0x0001)
	uint8_t                                                                                              UnknownData_49[0x3];                               // 0x0049 (0x0003) MISSED OFFSET
	FBoneReference                                                                                       BoundBone;                                         // 0x004C (0x000C)
	FBoneReference                                                                                       ChainEnd;                                          // 0x0058 (0x000C)
	FVector                                                                                              BoxExtents;                                        // 0x0064 (0x000C)
	FVector                                                                                              LocalJointOffset;                                  // 0x0070 (0x000C)
	float                                                                                                GravityScale;                                      // 0x007C (0x0004)
	bool                                                                                                 bLinearSpring;                                     // 0x0080 (0x0001)
	bool                                                                                                 bAngularSpring;                                    // 0x0081 (0x0001)
	uint8_t                                                                                              UnknownData_82[0x2];                               // 0x0082 (0x0002) MISSED OFFSET
	float                                                                                                LinearSpringConstant;                              // 0x0084 (0x0004)
	float                                                                                                AngularSpringConstant;                             // 0x0088 (0x0004)
	bool                                                                                                 bEnableWind;                                       // 0x008C (0x0001)
	uint8_t                                                                                              UnknownData_8D[0x3];                               // 0x008D (0x0003) MISSED OFFSET
	float                                                                                                WindScale;                                         // 0x0090 (0x0004)
	bool                                                                                                 bOverrideLinearDamping;                            // 0x0094 (0x0001)
	uint8_t                                                                                              UnknownData_95[0x3];                               // 0x0095 (0x0003) MISSED OFFSET
	float                                                                                                LinearDampingOverride;                             // 0x0098 (0x0004)
	bool                                                                                                 bOverrideAngularDamping;                           // 0x009C (0x0001)
	uint8_t                                                                                              UnknownData_9D[0x3];                               // 0x009D (0x0003) MISSED OFFSET
	float                                                                                                AngularDampingOverride;                            // 0x00A0 (0x0004)
	bool                                                                                                 bDoUpdate;                                         // 0x00A4 (0x0001)
	bool                                                                                                 bDoEval;                                           // 0x00A5 (0x0001)
	uint8_t                                                                                              UnknownData_A6[0x2];                               // 0x00A6 (0x0002) MISSED OFFSET
	int32_t                                                                                              NumSolverIterationsPreUpdate;                      // 0x00A8 (0x0004)
	int32_t                                                                                              NumSolverIterationsPostUpdate;                     // 0x00AC (0x0004)
	FAnimPhysConstraintSetup                                                                             ConstraintSetup;                                   // 0x00B0 (0x005C)
	bool                                                                                                 bUsePlanarLimit;                                   // 0x010C (0x0001)
	uint8_t                                                                                              UnknownData_10D[0x3];                              // 0x010D (0x0003) MISSED OFFSET
	TArray<FAnimPhysPlanarLimit>                                                                         PlanarLimits;                                      // 0x0110 (0x000C)
	AnimPhysCollisionType                                                                                CollisionType;                                     // 0x011C (0x0001)
	uint8_t                                                                                              UnknownData_11D[0x3];                              // 0x011D (0x0003) MISSED OFFSET
	float                                                                                                SphereCollisionRadius;                             // 0x0120 (0x0004)
	uint8_t                                                                                              UnknownData_124[0x70];                             // 0x0124 (0x0070) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_BoneDrivenController
// 0x0044 (0x008C)
struct FAnimNode_BoneDrivenController : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       SourceBone;                                        // 0x0048 (0x000C)
	EComponentType                                                                                       SourceComponent;                                   // 0x0054 (0x0001)
	uint8_t                                                                                              UnknownData_55[0x3];                               // 0x0055 (0x0003) MISSED OFFSET
	class UCurveFloat*                                                                                   DrivingCurve;                                      // 0x0058 (0x0004)
	float                                                                                                Multiplier;                                        // 0x005C (0x0004)
	bool                                                                                                 bUseRange;                                         // 0x0060 (0x0001)
	uint8_t                                                                                              UnknownData_61[0x3];                               // 0x0061 (0x0003) MISSED OFFSET
	float                                                                                                RangeMin;                                          // 0x0064 (0x0004)
	float                                                                                                RangeMax;                                          // 0x0068 (0x0004)
	float                                                                                                RemappedMin;                                       // 0x006C (0x0004)
	float                                                                                                RemappedMax;                                       // 0x0070 (0x0004)
	FBoneReference                                                                                       TargetBone;                                        // 0x0074 (0x000C)
	EComponentType                                                                                       TargetComponent;                                   // 0x0080 (0x0001)
	uint8_t                                                                                              UnknownData_81[0x3];                               // 0x0081 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bAffectTargetTranslationX : 1;                     // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bAffectTargetTranslationY : 1;                     // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bAffectTargetTranslationZ : 1;                     // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bAffectTargetRotationX : 1;                        // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bAffectTargetRotationY : 1;                        // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bAffectTargetRotationZ : 1;                        // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              bAffectTargetScaleX : 1;                           // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x40]
	uint8_t                                                                                              bAffectTargetScaleY : 1;                           // 0x0084 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x80]
	uint8_t                                                                                              bAffectTargetScaleZ : 1;                           // 0x0085 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_86[0x2];                               // 0x0086 (0x0002) MISSED OFFSET
	EDrivenBoneModificationMode                                                                          ModificationMode;                                  // 0x0088 (0x0001)
	uint8_t                                                                                              UnknownData_89[0x3];                               // 0x0089 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_CopyBone
// 0x001C (0x0064)
struct FAnimNode_CopyBone : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       SourceBone;                                        // 0x0048 (0x000C)
	FBoneReference                                                                                       TargetBone;                                        // 0x0054 (0x000C)
	bool                                                                                                 bCopyTranslation;                                  // 0x0060 (0x0001)
	bool                                                                                                 bCopyRotation;                                     // 0x0061 (0x0001)
	bool                                                                                                 bCopyScale;                                        // 0x0062 (0x0001)
	EBoneControlSpace                                                                                    ControlSpace;                                      // 0x0063 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_Fabrik
// 0x0078 (0x00C0)
struct FAnimNode_Fabrik : public FAnimNode_SkeletalControlBase
{
	uint8_t                                                                                              UnknownData_48[0x8];                               // 0x0048 (0x0008) MISSED OFFSET
	FTransform                                                                                           EffectorTransform;                                 // 0x0050 (0x0030)
	EBoneControlSpace                                                                                    EffectorTransformSpace;                            // 0x0080 (0x0001)
	uint8_t                                                                                              UnknownData_81[0x3];                               // 0x0081 (0x0003) MISSED OFFSET
	FBoneReference                                                                                       EffectorTransformBone;                             // 0x0084 (0x000C)
	EBoneRotationSource                                                                                  EffectorRotationSource;                            // 0x0090 (0x0001)
	uint8_t                                                                                              UnknownData_91[0x3];                               // 0x0091 (0x0003) MISSED OFFSET
	FBoneReference                                                                                       TipBone;                                           // 0x0094 (0x000C)
	FBoneReference                                                                                       RootBone;                                          // 0x00A0 (0x000C)
	float                                                                                                Precision;                                         // 0x00AC (0x0004)
	int32_t                                                                                              MaxIterations;                                     // 0x00B0 (0x0004)
	bool                                                                                                 bEnableDebugDraw;                                  // 0x00B4 (0x0001)
	uint8_t                                                                                              UnknownData_B5[0xB];                               // 0x00B5 (0x000B) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_HandIKRetargeting
// 0x0040 (0x0088)
struct FAnimNode_HandIKRetargeting : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       RightHandFK;                                       // 0x0048 (0x000C)
	FBoneReference                                                                                       LeftHandFK;                                        // 0x0054 (0x000C)
	FBoneReference                                                                                       RightHandIK;                                       // 0x0060 (0x000C)
	FBoneReference                                                                                       LeftHandIK;                                        // 0x006C (0x000C)
	TArray<FBoneReference>                                                                               IKBonesToMove;                                     // 0x0078 (0x000C)
	float                                                                                                HandFKWeight;                                      // 0x0084 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_LookAt
// 0x0064 (0x00AC)
struct FAnimNode_LookAt : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       BoneToModify;                                      // 0x0048 (0x000C)
	FBoneReference                                                                                       LookAtBone;                                        // 0x0054 (0x000C)
	FVector                                                                                              LookAtLocation;                                    // 0x0060 (0x000C)
	EAxisOption                                                                                          LookAtAxis;                                        // 0x006C (0x0001)
	bool                                                                                                 bUseLookUpAxis;                                    // 0x006D (0x0001)
	EAxisOption                                                                                          LookUpAxis;                                        // 0x006E (0x0001)
	uint8_t                                                                                              UnknownData_6F[0x1];                               // 0x006F (0x0001) MISSED OFFSET
	float                                                                                                LookAtClamp;                                       // 0x0070 (0x0004)
	EInterpolationBlend                                                                                  InterpolationType;                                 // 0x0074 (0x0001)
	uint8_t                                                                                              UnknownData_75[0x3];                               // 0x0075 (0x0003) MISSED OFFSET
	float                                                                                                InterpolationTime;                                 // 0x0078 (0x0004)
	float                                                                                                InterpolationTriggerThreashold;                    // 0x007C (0x0004)
	bool                                                                                                 bEnableDebug;                                      // 0x0080 (0x0001)
	uint8_t                                                                                              UnknownData_81[0x2B];                              // 0x0081 (0x002B) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_ModifyBone
// 0x0038 (0x0080)
struct FAnimNode_ModifyBone : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       BoneToModify;                                      // 0x0048 (0x000C)
	FVector                                                                                              Translation;                                       // 0x0054 (0x000C)
	FRotator                                                                                             Rotation;                                          // 0x0060 (0x000C)
	FVector                                                                                              Scale;                                             // 0x006C (0x000C)
	EBoneModificationMode                                                                                TranslationMode;                                   // 0x0078 (0x0001)
	EBoneModificationMode                                                                                RotationMode;                                      // 0x0079 (0x0001)
	EBoneModificationMode                                                                                ScaleMode;                                         // 0x007A (0x0001)
	EBoneControlSpace                                                                                    TranslationSpace;                                  // 0x007B (0x0001)
	EBoneControlSpace                                                                                    RotationSpace;                                     // 0x007C (0x0001)
	EBoneControlSpace                                                                                    ScaleSpace;                                        // 0x007D (0x0001)
	uint8_t                                                                                              UnknownData_7E[0x2];                               // 0x007E (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_ObserveBone
// 0x0034 (0x007C)
struct FAnimNode_ObserveBone : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       BoneToObserve;                                     // 0x0048 (0x000C)
	EBoneControlSpace                                                                                    DisplaySpace;                                      // 0x0054 (0x0001)
	bool                                                                                                 bRelativeToRefPose;                                // 0x0055 (0x0001)
	uint8_t                                                                                              UnknownData_56[0x2];                               // 0x0056 (0x0002) MISSED OFFSET
	FVector                                                                                              Translation;                                       // 0x0058 (0x000C)
	FRotator                                                                                             Rotation;                                          // 0x0064 (0x000C)
	FVector                                                                                              Scale;                                             // 0x0070 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_RotationMultiplier
// 0x0020 (0x0068)
struct FAnimNode_RotationMultiplier : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       TargetBone;                                        // 0x0048 (0x000C)
	FBoneReference                                                                                       SourceBone;                                        // 0x0054 (0x000C)
	float                                                                                                Multiplier;                                        // 0x0060 (0x0004)
	EBoneAxis                                                                                            RotationAxisToRefer;                               // 0x0064 (0x0001)
	bool                                                                                                 bIsAdditive;                                       // 0x0065 (0x0001)
	uint8_t                                                                                              UnknownData_66[0x2];                               // 0x0066 (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_SpringBone
// 0x0050 (0x0098)
struct FAnimNode_SpringBone : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       SpringBone;                                        // 0x0048 (0x000C)
	bool                                                                                                 bLimitDisplacement;                                // 0x0054 (0x0001)
	uint8_t                                                                                              UnknownData_55[0x3];                               // 0x0055 (0x0003) MISSED OFFSET
	float                                                                                                MaxDisplacement;                                   // 0x0058 (0x0004)
	float                                                                                                SpringStiffness;                                   // 0x005C (0x0004)
	float                                                                                                SpringDamping;                                     // 0x0060 (0x0004)
	float                                                                                                ErrorResetThresh;                                  // 0x0064 (0x0004)
	bool                                                                                                 bNoZSpring;                                        // 0x0068 (0x0001)
	bool                                                                                                 bTranslateX;                                       // 0x0069 (0x0001)
	bool                                                                                                 bTranslateY;                                       // 0x006A (0x0001)
	bool                                                                                                 bTranslateZ;                                       // 0x006B (0x0001)
	bool                                                                                                 bRotateX;                                          // 0x006C (0x0001)
	bool                                                                                                 bRotateY;                                          // 0x006D (0x0001)
	bool                                                                                                 bRotateZ;                                          // 0x006E (0x0001)
	uint8_t                                                                                              UnknownData_6F[0x29];                              // 0x006F (0x0029) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_Trail
// 0x00F8 (0x0140)
struct FAnimNode_Trail : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       TrailBone;                                         // 0x0048 (0x000C)
	int32_t                                                                                              ChainLength;                                       // 0x0054 (0x0004)
	EAxis                                                                                                ChainBoneAxis;                                     // 0x0058 (0x0001)
	bool                                                                                                 bInvertChainBoneAxis;                              // 0x0059 (0x0001)
	uint8_t                                                                                              UnknownData_5A[0x2];                               // 0x005A (0x0002) MISSED OFFSET
	float                                                                                                TrailRelaxation;                                   // 0x005C (0x0004)
	FRuntimeFloatCurve                                                                                   TrailRelaxationSpeed;                              // 0x0060 (0x0058)
	bool                                                                                                 bLimitStretch;                                     // 0x00B8 (0x0001)
	uint8_t                                                                                              UnknownData_B9[0x3];                               // 0x00B9 (0x0003) MISSED OFFSET
	float                                                                                                StretchLimit;                                      // 0x00BC (0x0004)
	FVector                                                                                              FakeVelocity;                                      // 0x00C0 (0x000C)
	bool                                                                                                 bActorSpaceFakeVel;                                // 0x00CC (0x0001)
	uint8_t                                                                                              UnknownData_CD[0x3];                               // 0x00CD (0x0003) MISSED OFFSET
	FBoneReference                                                                                       BaseJoint;                                         // 0x00D0 (0x000C)
	uint8_t                                                                                              UnknownData_DC[0x64];                              // 0x00DC (0x0064) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_TwoBoneIK
// 0x0044 (0x008C)
struct FAnimNode_TwoBoneIK : public FAnimNode_SkeletalControlBase
{
	FBoneReference                                                                                       IKBone;                                            // 0x0048 (0x000C)
	FVector                                                                                              EffectorLocation;                                  // 0x0054 (0x000C)
	FVector                                                                                              JointTargetLocation;                               // 0x0060 (0x000C)
	FVector2D                                                                                            StretchLimits;                                     // 0x006C (0x0008)
	FName                                                                                                EffectorSpaceBoneName;                             // 0x0074 (0x0008)
	uint8_t                                                                                              bTakeRotationFromEffectorSpace : 1;                // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bMaintainEffectorRelRot : 1;                       // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bAllowStretching : 1;                              // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_7D[0x3];                               // 0x007D (0x0003) MISSED OFFSET
	EBoneControlSpace                                                                                    EffectorLocationSpace;                             // 0x0080 (0x0001)
	EBoneControlSpace                                                                                    JointTargetLocationSpace;                          // 0x0081 (0x0001)
	uint8_t                                                                                              UnknownData_82[0x2];                               // 0x0082 (0x0002) MISSED OFFSET
	FName                                                                                                JointTargetSpaceBoneName;                          // 0x0084 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AnimGraphRuntime.AnimNode_WheelHandler
// 0x0010 (0x0058)
struct FAnimNode_WheelHandler : public FAnimNode_SkeletalControlBase
{
	class UWheeledVehicleMovementComponent*                                                              VehicleSimComponent;                               // 0x0048 (0x0004)
	uint8_t                                                                                              UnknownData_4C[0xC];                               // 0x004C (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

