#pragma once
#include "FN_Basic.h"

#include "FN_AOE_Ninja_DragonSlashTrail_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AOE_Ninja_DragonSlashTrail
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C
// 0x002C (0x03BC)
class AAOE_Ninja_DragonSlashTrail_C : public AFortAreaOfEffectCloud
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0390 (0x0004)
	class UAudioComponent*                                                                               Audio1;                                            // 0x0394 (0x0004)
	class UParticleSystemComponent*                                                                      DamageAreaFX;                                      // 0x0398 (0x0004)
	class UBoxComponent*                                                                                 DamageArea;                                        // 0x039C (0x0004)
	float                                                                                                AOEExtentXY;                                       // 0x03A0 (0x0004)
	float                                                                                                AOEFXFadeTime;                                     // 0x03A4 (0x0004)
	FGameplayTag                                                                                         TC_InsideTail;                                     // 0x03A8 (0x0008)
	class UClass*                                                                                        GE_TailAOE2;                                       // 0x03B0 (0x0004)
	class UClass*                                                                                        GE_TailAOE3;                                       // 0x03B4 (0x0004)
	class UClass*                                                                                        GE_TailAOE4;                                       // 0x03B8 (0x0004)
public:
	void OnSetAOEExtentXY(); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:OnSetAOEExtentXY
	void OnRep_AOEExtentXY(); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:OnRep_AOEExtentXY
	void UserConstructionScript(); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:ReceiveBeginPlay
	void EndAOE(); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:EndAOE
	void BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:BndEvt__BeeArea_K2Node_ComponentBoundEvent_249_ComponentEndOverlapSignature__DelegateSignature
	void ExecuteUbergraph_AOE_Ninja_DragonSlashTrail(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Gadgets/DragonSlash/AOE_Ninja_DragonSlashTrail.AOE_Ninja_DragonSlashTrail_C:ExecuteUbergraph_AOE_Ninja_DragonSlashTrail
public:
	static class UClass* StaticClass();
};

