#pragma once
#include "FN_Basic.h"

#include "FN_AOE_Commando_KeepOutExplosion_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AOE_Commando_KeepOutExplosion
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C
// 0x0014 (0x03A4)
class AAOE_Commando_KeepOutExplosion_C : public AFortAreaOfEffectCloud
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0390 (0x0004)
	class UParticleSystemComponent*                                                                      P_Grenade_Linger;                                  // 0x0394 (0x0004)
	class USphereComponent*                                                                              DamageArea;                                        // 0x0398 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x039C (0x0004)
	float                                                                                                Radius;                                            // 0x03A0 (0x0004)
public:
	void OnRep_Radius(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C:OnRep_Radius
	void UserConstructionScript(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C:ReceiveBeginPlay
	void Send_Info(float Radius); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C:Send_Info
	void ExecuteUbergraph_AOE_Commando_KeepOutExplosion(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C:ExecuteUbergraph_AOE_Commando_KeepOutExplosion
public:
	static class UClass* StaticClass();
};

