#pragma once
#include "FN_Basic.h"

#include "FN_AIModule_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTasks_enums.h"
#include "FN_GameplayTasks_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: AIModule
*/

// ScriptStruct /Script/AIModule.AIRequestID
// 0x0004 (0x0004)
struct FAIRequestID
{
	uint32_t                                                                                             RequestID;                                         // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIStimulus
// 0x003C (0x003C)
struct FAIStimulus
{
	float                                                                                                Age;                                               // 0x0000 (0x0004)
	float                                                                                                ExpirationAge;                                     // 0x0004 (0x0004)
	float                                                                                                Strength;                                          // 0x0008 (0x0004)
	FVector                                                                                              StimulusLocation;                                  // 0x000C (0x000C)
	FVector                                                                                              ReceiverLocation;                                  // 0x0018 (0x000C)
	FName                                                                                                Tag;                                               // 0x0024 (0x0008)
	uint8_t                                                                                              UnknownData_2C[0xC];                               // 0x002C (0x000C) MISSED OFFSET
	uint8_t                                                                                              bSuccessfullySensed : 1;                           // 0x0038 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_39[0x3];                               // 0x0039 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvNamedValue
// 0x0010 (0x0010)
struct FEnvNamedValue
{
	FName                                                                                                ParamName;                                         // 0x0000 (0x0008)
	EAIParamType                                                                                         ParamType;                                         // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	float                                                                                                Value;                                             // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderValue
// 0x0014 (0x0014)
struct FAIDataProviderValue
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	class UProperty*                                                                                     CachedProperty;                                    // 0x0004 (0x0004)
	class UAIDataProvider*                                                                               DataBinding;                                       // 0x0008 (0x0004)
	FName                                                                                                DataField;                                         // 0x000C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderTypedValue
// 0x0004 (0x0018)
struct FAIDataProviderTypedValue : public FAIDataProviderValue
{
	class UClass*                                                                                        PropertyType;                                      // 0x0014 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderFloatValue
// 0x0004 (0x001C)
struct FAIDataProviderFloatValue : public FAIDataProviderTypedValue
{
	float                                                                                                DefaultValue;                                      // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIMoveRequest
// 0x0024 (0x0024)
struct FAIMoveRequest
{
	class AActor*                                                                                        GoalActor;                                         // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0x20];                               // 0x0004 (0x0020) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.PawnActionStack
// 0x0004 (0x0004)
struct FPawnActionStack
{
	class UPawnAction*                                                                                   TopAction;                                         // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.PawnActionEvent
// 0x0010 (0x0010)
struct FPawnActionEvent
{
	class UPawnAction*                                                                                   Action;                                            // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0xC];                                // 0x0004 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.BlackboardKeySelector
// 0x0020 (0x0020)
struct FBlackboardKeySelector
{
	TArray<class UBlackboardKeyType*>                                                                    AllowedTypes;                                      // 0x0000 (0x000C)
	FName                                                                                                SelectedKeyName;                                   // 0x000C (0x0008)
	class UClass*                                                                                        SelectedKeyType;                                   // 0x0014 (0x0004)
	uint8_t                                                                                              SelectedKeyID;                                     // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bNoneIsAllowedValue : 1;                           // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.GenericTeamId
// 0x0001 (0x0001)
struct FGenericTeamId
{
	uint8_t                                                                                              TeamID;                                            // 0x0000 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderBoolValue
// 0x0004 (0x001C)
struct FAIDataProviderBoolValue : public FAIDataProviderTypedValue
{
	bool                                                                                                 DefaultValue;                                      // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderIntValue
// 0x0004 (0x001C)
struct FAIDataProviderIntValue : public FAIDataProviderTypedValue
{
	int32_t                                                                                              DefaultValue;                                      // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDataProviderStructValue
// 0x000C (0x0020)
struct FAIDataProviderStructValue : public FAIDataProviderValue
{
	uint8_t                                                                                              UnknownData_14[0xC];                               // 0x0014 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AISenseAffiliationFilter
// 0x0004 (0x0004)
struct FAISenseAffiliationFilter
{
	uint8_t                                                                                              bDetectEnemies : 1;                                // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bDetectNeutrals : 1;                               // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bDetectFriendlies : 1;                             // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.ActorPerceptionBlueprintInfo
// 0x0014 (0x0014)
struct FActorPerceptionBlueprintInfo
{
	class AActor*                                                                                        Target;                                            // 0x0000 (0x0004)
	TArray<FAIStimulus>                                                                                  LastSensedStimuli;                                 // 0x0004 (0x000C)
	uint8_t                                                                                              bIsHostile : 1;                                    // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDamageEvent
// 0x0024 (0x0024)
struct FAIDamageEvent
{
	float                                                                                                Amount;                                            // 0x0000 (0x0004)
	FVector                                                                                              Location;                                          // 0x0004 (0x000C)
	FVector                                                                                              HitLocation;                                       // 0x0010 (0x000C)
	class AActor*                                                                                        DamagedActor;                                      // 0x001C (0x0004)
	class AActor*                                                                                        Instigator;                                        // 0x0020 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AINoiseEvent
// 0x0028 (0x0028)
struct FAINoiseEvent
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	FVector                                                                                              NoiseLocation;                                     // 0x0004 (0x000C)
	float                                                                                                Loudness;                                          // 0x0010 (0x0004)
	float                                                                                                MaxRange;                                          // 0x0014 (0x0004)
	class AActor*                                                                                        Instigator;                                        // 0x0018 (0x0004)
	FName                                                                                                Tag;                                               // 0x001C (0x0008)
	uint8_t                                                                                              UnknownData_24[0x4];                               // 0x0024 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIPredictionEvent
// 0x000C (0x000C)
struct FAIPredictionEvent
{
	class AActor*                                                                                        Requestor;                                         // 0x0000 (0x0004)
	class AActor*                                                                                        PredictedActor;                                    // 0x0004 (0x0004)
	uint8_t                                                                                              UnknownData_8[0x4];                                // 0x0008 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AISightEvent
// 0x0010 (0x0010)
struct FAISightEvent
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET
	class AActor*                                                                                        SeenActor;                                         // 0x0008 (0x0004)
	class AActor*                                                                                        Observer;                                          // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AITeamStimulusEvent
// 0x0030 (0x0030)
struct FAITeamStimulusEvent
{
	uint8_t                                                                                              UnknownData_0[0x28];                               // 0x0000 (0x0028) MISSED OFFSET
	class AActor*                                                                                        Broadcaster;                                       // 0x0028 (0x0004)
	class AActor*                                                                                        Enemy;                                             // 0x002C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AITouchEvent
// 0x0014 (0x0014)
struct FAITouchEvent
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET
	class AActor*                                                                                        TouchReceiver;                                     // 0x000C (0x0004)
	class AActor*                                                                                        OtherActor;                                        // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.BTDecoratorLogic
// 0x0004 (0x0004)
struct FBTDecoratorLogic
{
	EBTDecoratorLogic                                                                                    Operation;                                         // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x1];                                // 0x0001 (0x0001) MISSED OFFSET
	uint16_t                                                                                             Number;                                            // 0x0002 (0x0002)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.BTCompositeChild
// 0x0020 (0x0020)
struct FBTCompositeChild
{
	class UBTCompositeNode*                                                                              ChildComposite;                                    // 0x0000 (0x0004)
	class UBTTaskNode*                                                                                   ChildTask;                                         // 0x0004 (0x0004)
	TArray<class UBTDecorator*>                                                                          Decorators;                                        // 0x0008 (0x000C)
	TArray<FBTDecoratorLogic>                                                                            DecoratorOps;                                      // 0x0014 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.BehaviorTreeTemplateInfo
// 0x000C (0x000C)
struct FBehaviorTreeTemplateInfo
{
	class UBehaviorTree*                                                                                 Asset;                                             // 0x0000 (0x0004)
	class UBTCompositeNode*                                                                              Template;                                          // 0x0004 (0x0004)
	uint8_t                                                                                              UnknownData_8[0x4];                                // 0x0008 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.BlackboardEntry
// 0x0010 (0x0010)
struct FBlackboardEntry
{
	FName                                                                                                EntryName;                                         // 0x0000 (0x0008)
	class UBlackboardKeyType*                                                                            KeyType;                                           // 0x0008 (0x0004)
	uint8_t                                                                                              bInstanceSynced : 1;                               // 0x000C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.AIDynamicParam
// 0x0030 (0x0030)
struct FAIDynamicParam
{
	FName                                                                                                ParamName;                                         // 0x0000 (0x0008)
	EAIParamType                                                                                         ParamType;                                         // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	float                                                                                                Value;                                             // 0x000C (0x0004)
	FBlackboardKeySelector                                                                               BBKey;                                             // 0x0010 (0x0020)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EQSParametrizedQueryExecutionRequest
// 0x0038 (0x0038)
struct FEQSParametrizedQueryExecutionRequest
{
	class UEnvQuery*                                                                                     QueryTemplate;                                     // 0x0000 (0x0004)
	TArray<FAIDynamicParam>                                                                              QueryConfig;                                       // 0x0004 (0x000C)
	FBlackboardKeySelector                                                                               EQSQueryBlackboardKey;                             // 0x0010 (0x0020)
	EEnvQueryRunMode                                                                                     RunMode;                                           // 0x0030 (0x0001)
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bUseBBKeyForQueryTemplate : 1;                     // 0x0034 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_35[0x3];                               // 0x0035 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvBoolParam_DEPRECATED
// 0x000C (0x000C)
struct FEnvBoolParam_DEPRECATED
{
	bool                                                                                                 Value;                                             // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FName                                                                                                ParamName;                                         // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvBoolParam
// 0x0000 (0x000C)
struct FEnvBoolParam : public FEnvBoolParam_DEPRECATED
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvIntParam_DEPRECATED
// 0x000C (0x000C)
struct FEnvIntParam_DEPRECATED
{
	int32_t                                                                                              Value;                                             // 0x0000 (0x0004)
	FName                                                                                                ParamName;                                         // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvIntParam
// 0x0000 (0x000C)
struct FEnvIntParam : public FEnvIntParam_DEPRECATED
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvFloatParam_DEPRECATED
// 0x000C (0x000C)
struct FEnvFloatParam_DEPRECATED
{
	float                                                                                                Value;                                             // 0x0000 (0x0004)
	FName                                                                                                ParamName;                                         // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvFloatParam
// 0x0000 (0x000C)
struct FEnvFloatParam : public FEnvFloatParam_DEPRECATED
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvQueryResult
// 0x0030 (0x0030)
struct FEnvQueryResult
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET
	class UClass*                                                                                        ItemType;                                          // 0x000C (0x0004)
	uint8_t                                                                                              UnknownData_10[0x10];                              // 0x0010 (0x0010) MISSED OFFSET
	int32_t                                                                                              OptionIndex;                                       // 0x0020 (0x0004)
	int32_t                                                                                              QueryID;                                           // 0x0024 (0x0004)
	uint8_t                                                                                              UnknownData_28[0x8];                               // 0x0028 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvOverlapData
// 0x0020 (0x0020)
struct FEnvOverlapData
{
	float                                                                                                ExtentX;                                           // 0x0000 (0x0004)
	float                                                                                                ExtentY;                                           // 0x0004 (0x0004)
	float                                                                                                ExtentZ;                                           // 0x0008 (0x0004)
	FVector                                                                                              ShapeOffset;                                       // 0x000C (0x000C)
	ECollisionChannel                                                                                    OverlapChannel;                                    // 0x0018 (0x0001)
	EEnvOverlapShape                                                                                     OverlapShape;                                      // 0x0019 (0x0001)
	uint8_t                                                                                              UnknownData_1A[0x2];                               // 0x001A (0x0002) MISSED OFFSET
	uint8_t                                                                                              bOnlyBlockingHits : 1;                             // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bOverlapComplex : 1;                               // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvTraceData
// 0x0028 (0x0028)
struct FEnvTraceData
{
	int32_t                                                                                              VersionNum;                                        // 0x0000 (0x0004)
	class UClass*                                                                                        NavigationFilter;                                  // 0x0004 (0x0004)
	float                                                                                                ProjectDown;                                       // 0x0008 (0x0004)
	float                                                                                                ProjectUp;                                         // 0x000C (0x0004)
	float                                                                                                ExtentX;                                           // 0x0010 (0x0004)
	float                                                                                                ExtentY;                                           // 0x0014 (0x0004)
	float                                                                                                ExtentZ;                                           // 0x0018 (0x0004)
	float                                                                                                PostProjectionVerticalOffset;                      // 0x001C (0x0004)
	ETraceTypeQuery                                                                                      TraceChannel;                                      // 0x0020 (0x0001)
	ECollisionChannel                                                                                    SerializedChannel;                                 // 0x0021 (0x0001)
	EEnvTraceShape                                                                                       TraceShape;                                        // 0x0022 (0x0001)
	EEnvQueryTrace                                                                                       TraceMode;                                         // 0x0023 (0x0001)
	uint8_t                                                                                              bTraceComplex : 1;                                 // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bOnlyBlockingHits : 1;                             // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bCanTraceOnNavMesh : 1;                            // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bCanTraceOnGeometry : 1;                           // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bCanDisableTrace : 1;                              // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bCanProjectDown : 1;                               // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvDirection
// 0x0010 (0x0010)
struct FEnvDirection
{
	class UClass*                                                                                        LineFrom;                                          // 0x0000 (0x0004)
	class UClass*                                                                                        LineTo;                                            // 0x0004 (0x0004)
	class UClass*                                                                                        Rotation;                                          // 0x0008 (0x0004)
	EEnvDirection                                                                                        DirMode;                                           // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.CrowdAvoidanceSamplingPattern
// 0x0018 (0x0018)
struct FCrowdAvoidanceSamplingPattern
{
	TArray<float>                                                                                        Angles;                                            // 0x0000 (0x000C)
	TArray<float>                                                                                        Radii;                                             // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.CrowdAvoidanceConfig
// 0x001C (0x001C)
struct FCrowdAvoidanceConfig
{
	float                                                                                                VelocityBias;                                      // 0x0000 (0x0004)
	float                                                                                                DesiredVelocityWeight;                             // 0x0004 (0x0004)
	float                                                                                                CurrentVelocityWeight;                             // 0x0008 (0x0004)
	float                                                                                                SideBiasWeight;                                    // 0x000C (0x0004)
	float                                                                                                ImpactTimeWeight;                                  // 0x0010 (0x0004)
	float                                                                                                ImpactTimeRange;                                   // 0x0014 (0x0004)
	uint8_t                                                                                              CustomPatternIdx;                                  // 0x0018 (0x0001)
	uint8_t                                                                                              AdaptiveDivisions;                                 // 0x0019 (0x0001)
	uint8_t                                                                                              AdaptiveRings;                                     // 0x001A (0x0001)
	uint8_t                                                                                              AdaptiveDepth;                                     // 0x001B (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvQueryInstanceCache
// 0x0124 (0x0124)
struct FEnvQueryInstanceCache
{
	class UEnvQuery*                                                                                     Template;                                          // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0x120];                              // 0x0004 (0x0120) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/AIModule.EnvQueryRequest
// 0x0048 (0x0048)
struct FEnvQueryRequest
{
	class UEnvQuery*                                                                                     QueryTemplate;                                     // 0x0000 (0x0004)
	class UObject*                                                                                       Owner;                                             // 0x0004 (0x0004)
	class UWorld*                                                                                        World;                                             // 0x0008 (0x0004)
	uint8_t                                                                                              UnknownData_C[0x3C];                               // 0x000C (0x003C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

