#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_AirStrike_Bomb_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_AirStrike_Bomb
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C
// 0x00E8 (0x0500)
class AB_Prj_AirStrike_Bomb_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      Trail_Effect;                                      // 0x041C (0x0004)
	class UAudioComponent*                                                                               supply_drop_incoming_Cue;                          // 0x0420 (0x0004)
	class UStaticMeshComponent*                                                                          Mesh;                                              // 0x0424 (0x0004)
	float                                                                                                FadeDecal_Fade_7B123F94469C61224CB9E39DC9EF01A3;   // 0x0428 (0x0004)
	ETimelineDirection                                                                                   FadeDecal__Direction_7B123F94469C61224CB9E39DC9EF01A3; // 0x042C (0x0001)
	uint8_t                                                                                              UnknownData_42D[0x3];                              // 0x042D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FadeDecal;                                         // 0x0430 (0x0004)
	FVector                                                                                              ParticleGuide_Size;                                // 0x0434 (0x000C)
	class UMaterialInstanceDynamic*                                                                      Material_MID;                                      // 0x0440 (0x0004)
	class UParticleSystem*                                                                               P_Explosion;                                       // 0x0444 (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x0448 (0x000C)
	class USoundBase*                                                                                    Cue_DistantSound;                                  // 0x0454 (0x0004)
	class USoundBase*                                                                                    Cue_CloseSound;                                    // 0x0458 (0x0004)
	float                                                                                                ExplosionRadius;                                   // 0x045C (0x0004)
	int32_t                                                                                              NumberOfBouncesTillExplode;                        // 0x0460 (0x0004)
	int32_t                                                                                              CurrentNumberOfBounces;                            // 0x0464 (0x0004)
	class USoundBase*                                                                                    Cue_GrenadeFuseSound;                              // 0x0468 (0x0004)
	TArray<EObjectTypeQuery>                                                                             NewVar;                                            // 0x046C (0x000C)
	FVector                                                                                              BombStartLocation;                                 // 0x0478 (0x000C)
	class UParticleSystemComponent*                                                                      ImpactReticle_Effect;                              // 0x0484 (0x0004)
	class UParticleSystem*                                                                               P_ImpactReticle;                                   // 0x0488 (0x0004)
	uint8_t                                                                                              UnknownData_48C[0x4];                              // 0x048C (0x0004) MISSED OFFSET
	FTransform                                                                                           BombStartTransform;                                // 0x0490 (0x0030)
	TArray<class AActor*>                                                                                NewVar0;                                           // 0x04C0 (0x000C)
	class UMaterialInterface*                                                                            Ground_Decal;                                      // 0x04CC (0x0004)
	FLinearColor                                                                                         Ground_Decal_Color;                                // 0x04D0 (0x0010)
	class UDecalComponent*                                                                               GridDecal;                                         // 0x04E0 (0x0004)
	FLinearColor                                                                                         Team_Color;                                        // 0x04E4 (0x0010)
	bool                                                                                                 NewVar1;                                           // 0x04F4 (0x0001)
	uint8_t                                                                                              UnknownData_4F5[0x3];                              // 0x04F5 (0x0003) MISSED OFFSET
	float                                                                                                FriendOrFoe;                                       // 0x04F8 (0x0004)
	class UStaticMeshComponent*                                                                          Grid_Static_Mesh_Decal;                            // 0x04FC (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:UserConstructionScript
	void FadeDecal__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:FadeDecal__FinishedFunc
	void FadeDecal__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:FadeDecal__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:ReceiveBeginPlay
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:ReceiveAnyDamage
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:ReceiveHit
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:OnExploded
	void ExecuteUbergraph_B_Prj_AirStrike_Bomb(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Prj_AirStrike_Bomb.B_Prj_AirStrike_Bomb_C:ExecuteUbergraph_B_Prj_AirStrike_Bomb
public:
	static class UClass* StaticClass();
};

