#pragma once
#include "FN_Basic.h"

#include "FN_BP_AnimNotifyState_CameraAnim_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BP_AnimNotifyState_CameraAnim
*/

// BlueprintGeneratedClass /Game/Animation/Game/BP_AnimNotifyState_CameraAnim.BP_AnimNotifyState_CameraAnim_C
// 0x0018 (0x0034)
class UBP_AnimNotifyState_CameraAnim_C : public UAnimNotifyState
{
public:
	float                                                                                                PlayRate;                                          // 0x001C (0x0004)
	float                                                                                                BlendInTime;                                       // 0x0020 (0x0004)
	float                                                                                                BlendOutTime;                                      // 0x0024 (0x0004)
	bool                                                                                                 bLoop;                                             // 0x0028 (0x0001)
	ECameraAnimPlaySpace                                                                                 Shake_Space;                                       // 0x0029 (0x0001)
	uint8_t                                                                                              UnknownData_2A[0x2];                               // 0x002A (0x0002) MISSED OFFSET
	float                                                                                                Shake_Scale;                                       // 0x002C (0x0004)
	class UCameraAnim*                                                                                   CameraAnim;                                        // 0x0030 (0x0004)
public:
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const; // Function /Game/Animation/Game/BP_AnimNotifyState_CameraAnim.BP_AnimNotifyState_CameraAnim_C:Received_NotifyEnd
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const; // Function /Game/Animation/Game/BP_AnimNotifyState_CameraAnim.BP_AnimNotifyState_CameraAnim_C:Received_NotifyBegin
public:
	static class UClass* StaticClass();
};

