#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Constructor_PlasmaPulse_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Constructor_PlasmaPulse
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C
// 0x0044 (0x045C)
class AB_Prj_Constructor_PlasmaPulse_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class USkeletalMeshComponent*                                                                        SK_PlasmaPulse;                                    // 0x041C (0x0004)
	class UAudioComponent*                                                                               Audio1;                                            // 0x0420 (0x0004)
	float                                                                                                Initial_Delay;                                     // 0x0424 (0x0004)
	class USoundBase*                                                                                    PlacementCue;                                      // 0x0428 (0x0004)
	class USoundBase*                                                                                    ExplosionCue;                                      // 0x042C (0x0004)
	class USoundBase*                                                                                    SecondExplosionCue;                                // 0x0430 (0x0004)
	class UParticleSystem*                                                                               P_Explosion;                                       // 0x0434 (0x0004)
	class UClass*                                                                                        B_PostFX;                                          // 0x0438 (0x0004)
	float                                                                                                PostFX_BoxScale;                                   // 0x043C (0x0004)
	bool                                                                                                 PostFX_UseCameraShake;                             // 0x0440 (0x0001)
	bool                                                                                                 Explode;                                           // 0x0441 (0x0001)
	uint8_t                                                                                              UnknownData_442[0x2];                              // 0x0442 (0x0002) MISSED OFFSET
	FVector                                                                                              Impact_Loc;                                        // 0x0444 (0x000C)
	FVector                                                                                              Hit_Normal;                                        // 0x0450 (0x000C)
public:
	void OnRep_Explode(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:OnRep_Explode
	void UserConstructionScript(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:UserConstructionScript
	void FlashShield(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:FlashShield
	void OnStop(FHitResult Hit); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:OnStop
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:ReceiveBeginPlay
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:ReceiveEndPlay
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:OnBounce
	void AttachedObj_Died(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:AttachedObj_Died
	void BaseDestroyed(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:BaseDestroyed
	void ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_PlasmaPulse.B_Prj_Constructor_PlasmaPulse_C:ExecuteUbergraph_B_Prj_Constructor_PlasmaPulse
public:
	static class UClass* StaticClass();
};

