#pragma once
#include "FN_Basic.h"

#include "FN_B_Teleporter_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Teleporter
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C
// 0x02E4 (0x076C)
class AB_Teleporter_C : public ABuildingGameplayActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0488 (0x0004)
	class UPostProcessComponent*                                                                         TeleportPostProcess;                               // 0x048C (0x0004)
	class UProjectileMovementComponent*                                                                  ProjectileMovement;                                // 0x0490 (0x0004)
	class UParticleSystemComponent*                                                                      P_Teleporter_Explo;                                // 0x0494 (0x0004)
	class UParticleSystemComponent*                                                                      P_Teleporter_ReloadRingRays_01;                    // 0x0498 (0x0004)
	class UParticleSystemComponent*                                                                      P_Teleporter_ReloadRing_01;                        // 0x049C (0x0004)
	class UAudioComponent*                                                                               teleporter_recharge_audiocomponent;                // 0x04A0 (0x0004)
	class UStaticMeshComponent*                                                                          DirectionalArrow;                                  // 0x04A4 (0x0004)
	class UStaticMeshComponent*                                                                          Glow;                                              // 0x04A8 (0x0004)
	class UStaticMeshComponent*                                                                          Sm_Teleporter_LightRay_01;                         // 0x04AC (0x0004)
	class UParticleSystemComponent*                                                                      P_Teleporter_Teleported_01;                        // 0x04B0 (0x0004)
	class UParticleSystemComponent*                                                                      P_Teleporter_Active_01;                            // 0x04B4 (0x0004)
	class UStaticMeshComponent*                                                                          Vortex;                                            // 0x04B8 (0x0004)
	class UStaticMeshComponent*                                                                          PortalCollisionCylinder;                           // 0x04BC (0x0004)
	class UStaticMeshComponent*                                                                          BaseCollisionCylinder;                             // 0x04C0 (0x0004)
	class USkeletalMeshComponent*                                                                        SK_Teleporter;                                     // 0x04C4 (0x0004)
	class UAudioComponent*                                                                               Generic_Object_Place_AudioComponent;               // 0x04C8 (0x0004)
	class UAudioComponent*                                                                               Teleport_AudioComponent;                           // 0x04CC (0x0004)
	class UAudioComponent*                                                                               Teleporter_Active_AudioComponent;                  // 0x04D0 (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x04D4 (0x0004)
	float                                                                                                PostProcessTL_Weight_313874CC47D4DBB662B568BCDD322E9F; // 0x04D8 (0x0004)
	ETimelineDirection                                                                                   PostProcessTL__Direction_313874CC47D4DBB662B568BCDD322E9F; // 0x04DC (0x0001)
	uint8_t                                                                                              UnknownData_4DD[0x3];                              // 0x04DD (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            PostProcessTL;                                     // 0x04E0 (0x0004)
	float                                                                                                ScaleLoadingRings_Scale_345064B24064419D4DE5E8B77DB3B3D1; // 0x04E4 (0x0004)
	ETimelineDirection                                                                                   ScaleLoadingRings__Direction_345064B24064419D4DE5E8B77DB3B3D1; // 0x04E8 (0x0001)
	uint8_t                                                                                              UnknownData_4E9[0x3];                              // 0x04E9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            ScaleLoadingRings;                                 // 0x04EC (0x0004)
	float                                                                                                RotateArrowTimeline_LERP_99FA82E342C18773DC608F9F875A3EF9; // 0x04F0 (0x0004)
	ETimelineDirection                                                                                   RotateArrowTimeline__Direction_99FA82E342C18773DC608F9F875A3EF9; // 0x04F4 (0x0001)
	uint8_t                                                                                              UnknownData_4F5[0x3];                              // 0x04F5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            RotateArrowTimeline;                               // 0x04F8 (0x0004)
	float                                                                                                LightrayFade_Fade_67FB9E7D4463CA9FF6EF76A3ABCB0711; // 0x04FC (0x0004)
	ETimelineDirection                                                                                   LightrayFade__Direction_67FB9E7D4463CA9FF6EF76A3ABCB0711; // 0x0500 (0x0001)
	uint8_t                                                                                              UnknownData_501[0x3];                              // 0x0501 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            LightrayFade;                                      // 0x0504 (0x0004)
	FVector                                                                                              GlowMaterialTransitionOut_GlowScaleUp_D9E5F98943366B98E4291E87A0E1761D; // 0x0508 (0x000C)
	float                                                                                                GlowMaterialTransitionOut_Transition_D9E5F98943366B98E4291E87A0E1761D; // 0x0514 (0x0004)
	ETimelineDirection                                                                                   GlowMaterialTransitionOut__Direction_D9E5F98943366B98E4291E87A0E1761D; // 0x0518 (0x0001)
	uint8_t                                                                                              UnknownData_519[0x3];                              // 0x0519 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            GlowMaterialTransitionOut;                         // 0x051C (0x0004)
	FVector                                                                                              GlowMaterialTransitionIn_GlowScaleUp_548E265F40FFA1630EB18389B54EB18C; // 0x0520 (0x000C)
	float                                                                                                GlowMaterialTransitionIn_Transition_548E265F40FFA1630EB18389B54EB18C; // 0x052C (0x0004)
	ETimelineDirection                                                                                   GlowMaterialTransitionIn__Direction_548E265F40FFA1630EB18389B54EB18C; // 0x0530 (0x0001)
	uint8_t                                                                                              UnknownData_531[0x3];                              // 0x0531 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            GlowMaterialTransitionIn;                          // 0x0534 (0x0004)
	float                                                                                                RingSpeedUp_LERP2_53EA52B84A17D3E71A5C89BF02051BB3; // 0x0538 (0x0004)
	float                                                                                                RingSpeedUp_LERP_53EA52B84A17D3E71A5C89BF02051BB3; // 0x053C (0x0004)
	ETimelineDirection                                                                                   RingSpeedUp__Direction_53EA52B84A17D3E71A5C89BF02051BB3; // 0x0540 (0x0001)
	uint8_t                                                                                              UnknownData_541[0x3];                              // 0x0541 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            RingSpeedUp;                                       // 0x0544 (0x0004)
	class AB_Teleporter_C*                                                                               TargetTeleporter;                                  // 0x0548 (0x0004)
	bool                                                                                                 bTeleporting;                                      // 0x054C (0x0001)
	uint8_t                                                                                              UnknownData_54D[0x3];                              // 0x054D (0x0003) MISSED OFFSET
	FText                                                                                                InteractText;                                      // 0x0550 (0x000C)
	class UFortDecoItemDefinition*                                                                       PickupDecoDefinition;                              // 0x055C (0x0004)
	bool                                                                                                 bTeleporterActive;                                 // 0x0560 (0x0001)
	bool                                                                                                 bRecharging;                                       // 0x0561 (0x0001)
	uint8_t                                                                                              UnknownData_562[0x2];                              // 0x0562 (0x0002) MISSED OFFSET
	float                                                                                                RechargeTime;                                      // 0x0564 (0x0004)
	int32_t                                                                                              TeleportCount;                                     // 0x0568 (0x0004)
	TArray<class AActor*>                                                                                ActorsToTeleport;                                  // 0x056C (0x000C)
	float                                                                                                MaxTeleportRange;                                  // 0x0578 (0x0004)
	FText                                                                                                TooFarAwayMessage;                                 // 0x057C (0x000C)
	FVector                                                                                              TargetTeleporterLocation;                          // 0x0588 (0x000C)
	class UMaterialInstanceDynamic*                                                                      Teleporter_MID__0;                                 // 0x0594 (0x0004)
	float                                                                                                RingChargeStartSpeed;                              // 0x0598 (0x0004)
	float                                                                                                RingChargeEndSpeed;                                // 0x059C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Teleporter_MID__1;                                 // 0x05A0 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Glow_MID;                                          // 0x05A4 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Vortex_MID;                                        // 0x05A8 (0x0004)
	FVector                                                                                              GlowSizeScale;                                     // 0x05AC (0x000C)
	bool                                                                                                 bBeingCarried;                                     // 0x05B8 (0x0001)
	bool                                                                                                 bShowGlow;                                         // 0x05B9 (0x0001)
	uint8_t                                                                                              UnknownData_5BA[0x2];                              // 0x05BA (0x0002) MISSED OFFSET
	FVector                                                                                              Teleporter_Size_Placed;                            // 0x05BC (0x000C)
	FVector                                                                                              Teleporter_Size_Held;                              // 0x05C8 (0x000C)
	float                                                                                                DirectionalRayActivate_Delay;                      // 0x05D4 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Lightray_MID;                                      // 0x05D8 (0x0004)
	float                                                                                                Lightray_Light_Intensity;                          // 0x05DC (0x0004)
	FVector                                                                                              Lightray_Size_Length;                              // 0x05E0 (0x000C)
	FLinearColor                                                                                         Glow_Color_Inner__Friendly_;                       // 0x05EC (0x0010)
	FLinearColor                                                                                         Glow_Color_Inner__Enemy_;                          // 0x05FC (0x0010)
	FLinearColor                                                                                         Glow_Color_Outer__Friendly_;                       // 0x060C (0x0010)
	FLinearColor                                                                                         Glow_Color_Outer__Enemy_;                          // 0x061C (0x0010)
	FLinearColor                                                                                         Vortex_Color_Inner__Friendly_;                     // 0x062C (0x0010)
	FLinearColor                                                                                         Vortex_Color_Inner__Enemy_;                        // 0x063C (0x0010)
	FLinearColor                                                                                         Vortex_Color_Outer__Friendly_;                     // 0x064C (0x0010)
	FLinearColor                                                                                         Vortex_Color_Outer__Enemy_;                        // 0x065C (0x0010)
	FLinearColor                                                                                         Vortex_Reflection__Friendly_;                      // 0x066C (0x0010)
	FLinearColor                                                                                         Vortex_Reflection__Enemy_;                         // 0x067C (0x0010)
	FLinearColor                                                                                         Ray_Color_Dark__Friendly_;                         // 0x068C (0x0010)
	FLinearColor                                                                                         Ray_Color_Dark__Enemy_;                            // 0x069C (0x0010)
	FLinearColor                                                                                         Ray_Color_Bright__Friendly_;                       // 0x06AC (0x0010)
	FLinearColor                                                                                         Ray_Color_Bright__Enemy_;                          // 0x06BC (0x0010)
	FLinearColor                                                                                         Teleporter_Light_Color__Friendly_;                 // 0x06CC (0x0010)
	FLinearColor                                                                                         Teleporter_Light_Color__Enemy_;                    // 0x06DC (0x0010)
	FLinearColor                                                                                         Teleporter_Mesh_Emissive__Friendly_;               // 0x06EC (0x0010)
	FLinearColor                                                                                         Teleporter_Mesh_Emissive__Enemy_;                  // 0x06FC (0x0010)
	FLinearColor                                                                                         Streak_Color__Friendly_;                           // 0x070C (0x0010)
	FLinearColor                                                                                         Streak_Color__Enemy_;                              // 0x071C (0x0010)
	FRotator                                                                                             Arrow_Rotation_New;                                // 0x072C (0x000C)
	FRotator                                                                                             Arrow_Rotation_Previous;                           // 0x0738 (0x000C)
	float                                                                                                RechargeDecay;                                     // 0x0744 (0x0004)
	FLinearColor                                                                                         TeleporterArrowColor;                              // 0x0748 (0x0010)
	class UMaterialInstanceDynamic*                                                                      Directional_Arrow_MID;                             // 0x0758 (0x0004)
	float                                                                                                Ring_Radius_Start;                                 // 0x075C (0x0004)
	float                                                                                                Ring_Radius_End;                                   // 0x0760 (0x0004)
	class UMaterialInstanceDynamic*                                                                      LoadingRingMID;                                    // 0x0764 (0x0004)
	float                                                                                                Steps;                                             // 0x0768 (0x0004)
public:
	void InternalSetActive(bool bActive); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:InternalSetActive
	void TriggerRechargeInternal(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:TriggerRechargeInternal
	void OnRep_TeleporterArrowColor(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRep_TeleporterArrowColor
	void OnRep_bRecharging(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRep_bRecharging
	void InitializeTeleporter(float NewMaxRange, float NewRechargeDecay, FLinearColor TeleporterArrowColor); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:InitializeTeleporter
	void SetShowGlow(bool Show); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:SetShowGlow
	void UpdateGlowVisuals(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:UpdateGlowVisuals
	void OnRep_bBeingCarried(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRep_bBeingCarried
	void UpdateTargetTeleporterLocation(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:UpdateTargetTeleporterLocation
	bool IsAcceptablePositionForPlacement(FVector InLocation, FRotator InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, FText OutFailureReason) const; // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:IsAcceptablePositionForPlacement
	void OnRep_TeleportCount(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRep_TeleportCount
	void TriggerRecharge(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:TriggerRecharge
	void RechargeComplete(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:RechargeComplete
	void OnRep_bTeleporterActive(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRep_bTeleporterActive
	void IsExclusivelyActive(bool IsActive); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:IsExclusivelyActive
	void UpdateTeleportersActive(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:UpdateTeleportersActive
	void IsValidActorToTeleport(class AActor* ActorToTeleport, bool ValidActor); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:IsValidActorToTeleport
	FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn) const; // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:BlueprintGetInteractionString
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn) const; // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:BlueprintCanInteract
	void TeleportToTarget(class AActor* ActorToTeleport); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:TeleportToTarget
	void SetTargetTeleporter(class AB_Teleporter_C* NewTarget); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:SetTargetTeleporter
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:UserConstructionScript
	void RingSpeedUp__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:RingSpeedUp__FinishedFunc
	void RingSpeedUp__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:RingSpeedUp__UpdateFunc
	void GlowMaterialTransitionIn__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:GlowMaterialTransitionIn__FinishedFunc
	void GlowMaterialTransitionIn__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:GlowMaterialTransitionIn__UpdateFunc
	void GlowMaterialTransitionOut__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:GlowMaterialTransitionOut__FinishedFunc
	void GlowMaterialTransitionOut__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:GlowMaterialTransitionOut__UpdateFunc
	void LightrayFade__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:LightrayFade__FinishedFunc
	void LightrayFade__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:LightrayFade__UpdateFunc
	void RotateArrowTimeline__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:RotateArrowTimeline__FinishedFunc
	void RotateArrowTimeline__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:RotateArrowTimeline__UpdateFunc
	void ScaleLoadingRings__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:ScaleLoadingRings__FinishedFunc
	void ScaleLoadingRings__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:ScaleLoadingRings__UpdateFunc
	void PostProcessTL__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:PostProcessTL__FinishedFunc
	void PostProcessTL__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:PostProcessTL__UpdateFunc
	void BlueprintOnInteract(class AFortPawn* InteractingPawn); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:BlueprintOnInteract
	void OnComponentBeginOverlap_Event_0(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnComponentBeginOverlap_Event_0
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnDeathServer
	void ReceiveDestroyed(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:ReceiveDestroyed
	void OnActiveChanged(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnActiveChanged
	void DirectionalRayActivate(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:DirectionalRayActivate
	void DirectionalRayDeactivate(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:DirectionalRayDeactivate
	void UpdateArrowDirection(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:UpdateArrowDirection
	void OnRechargingChanged(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnRechargingChanged
	void OnWorldReady(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnWorldReady
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:OnDeathPlayEffects
	void ClientActorsTeleported(class AActor* TeleportedActor); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:ClientActorsTeleported
	void ExecuteUbergraph_B_Teleporter(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Teleporter.B_Teleporter_C:ExecuteUbergraph_B_Teleporter
public:
	static class UClass* StaticClass();
};

