#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Ninja_SmokeBomb_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Ninja_SmokeBomb
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C
// 0x0030 (0x0448)
class AB_Prj_Ninja_SmokeBomb_C : public AFortProj_M80
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      CanPin;                                            // 0x041C (0x0004)
	class UStaticMeshComponent*                                                                          SprayCan;                                          // 0x0420 (0x0004)
	class UParticleSystemComponent*                                                                      ParticleSystem1;                                   // 0x0424 (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x0428 (0x000C)
	class UParticleSystem*                                                                               P_ImpactEffect;                                    // 0x0434 (0x0004)
	class USoundBase*                                                                                    Cue_ImpactSound;                                   // 0x0438 (0x0004)
	FVector                                                                                              Hit_Normal;                                        // 0x043C (0x000C)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C:UserConstructionScript
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C:ReceiveHit
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C:OnExploded
	void ExecuteUbergraph_B_Prj_Ninja_SmokeBomb(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Gadgets/SmokeBomb/B_Prj_Ninja_SmokeBomb.B_Prj_Ninja_SmokeBomb_C:ExecuteUbergraph_B_Prj_Ninja_SmokeBomb
public:
	static class UClass* StaticClass();
};

