#pragma once
#include "FN_Basic.h"

#include "FN_B_Base_Deco_Preview_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Base_Deco_Preview
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C
// 0x0014 (0x0370)
class AB_Base_Deco_Preview_C : public AFortDecoPreview
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x035C (0x0004)
	class UStaticMeshComponent*                                                                          SM_Base_Device;                                    // 0x0360 (0x0004)
	class UBoxComponent*                                                                                 Box;                                               // 0x0364 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x0368 (0x0004)
	class UMaterialInstanceDynamic*                                                                      NewMID;                                            // 0x036C (0x0004)
public:
	void SetupMIDforMeshOverride(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C:SetupMIDforMeshOverride
	void UserConstructionScript(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C:UserConstructionScript
	void OnUpdateVisuals(float DeltaSeconds, bool bSafeToPlace); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C:OnUpdateVisuals
	void OnInitializeDecoPreview(class ABuildingActor* NewBuildingActor, class UFortDecoItemDefinition* NewDecoItemDefinition); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C:OnInitializeDecoPreview
	void ExecuteUbergraph_B_Base_Deco_Preview(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Base_Deco_Preview.B_Base_Deco_Preview_C:ExecuteUbergraph_B_Base_Deco_Preview
public:
	static class UClass* StaticClass();
};

