#pragma once
#include "FN_Basic.h"

#include "FN_B_Placement_Preview_AirStrike_parameters.h"
#include "FN_AirStrikesPatterns_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_StrikePatternEnum_enums.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Placement_Preview_AirStrike
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C
// 0x0148 (0x04A4)
class AB_Placement_Preview_AirStrike_C : public AFortDecoPreview
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x035C (0x0004)
	class UStaticMeshComponent*                                                                          GridDecal_Mesh;                                    // 0x0360 (0x0004)
	class UAudioComponent*                                                                               airstrike_incoming_place_audiocomponent;           // 0x0364 (0x0004)
	class UStaticMeshComponent*                                                                          dashedLine;                                        // 0x0368 (0x0004)
	class UStaticMeshComponent*                                                                          Sm_SupplyDrop_TargetRay_01;                        // 0x036C (0x0004)
	class UDecalComponent*                                                                               GridDecal;                                         // 0x0370 (0x0004)
	class UBoxComponent*                                                                                 Box1;                                              // 0x0374 (0x0004)
	float                                                                                                Spawn_Arrow_NewTrack_0_D8CAB91943322A93E0FF2CA94190A798; // 0x0378 (0x0004)
	ETimelineDirection                                                                                   Spawn_Arrow__Direction_D8CAB91943322A93E0FF2CA94190A798; // 0x037C (0x0001)
	uint8_t                                                                                              UnknownData_37D[0x3];                              // 0x037D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Spawn_Arrow;                                       // 0x0380 (0x0004)
	float                                                                                                ReticuleRestartDelay;                              // 0x0384 (0x0004)
	float                                                                                                ReticuleIntermittentDelay;                         // 0x0388 (0x0004)
	float                                                                                                BombsDelay;                                        // 0x038C (0x0004)
	bool                                                                                                 Can_212_x1_Repeat_;                                // 0x0390 (0x0001)
	bool                                                                                                 Can_212_x2_Repeat_;                                // 0x0391 (0x0001)
	uint8_t                                                                                              UnknownData_392[0x2];                              // 0x0392 (0x0002) MISSED OFFSET
	float                                                                                                DecalRotation;                                     // 0x0394 (0x0004)
	int32_t                                                                                              Dotted_Lines_Amount;                               // 0x0398 (0x0004)
	float                                                                                                Dotted_Lines_Spacing_in_Z;                         // 0x039C (0x0004)
	TArray<class UStaticMeshComponent*>                                                                  Dotted_Lines_Spacing;                              // 0x03A0 (0x000C)
	class UMaterialInstanceDynamic*                                                                      _3dline_MID;                                       // 0x03AC (0x0004)
	FVector                                                                                              ArrowheadStartLocation;                            // 0x03B0 (0x000C)
	FVector                                                                                              ArrowheadEndLocation;                              // 0x03BC (0x000C)
	uint8_t                                                                                              UnknownData_3C8[0x8];                              // 0x03C8 (0x0008) MISSED OFFSET
	FTransform                                                                                           Bomb_Init_Transform;                               // 0x03D0 (0x0030)
	FVector                                                                                              Bomb_Start_Location;                               // 0x0400 (0x000C)
	int32_t                                                                                              ForLoopCounter;                                    // 0x040C (0x0004)
	FAirStrikesPatterns                                                                                  StrikePatternType;                                 // 0x0410 (0x000C)
	StrikePatternEnum                                                                                    Current_Air_Strike_Pattern;                        // 0x041C (0x0001)
	uint8_t                                                                                              UnknownData_41D[0x3];                              // 0x041D (0x0003) MISSED OFFSET
	float                                                                                                SpacingBetweenObjects;                             // 0x0420 (0x0004)
	TArray<class UParticleSystemComponent*>                                                              Current_Particle_Array;                            // 0x0424 (0x000C)
	TArray<FVector>                                                                                      Position_Array_Cleaned_of_duplicates;              // 0x0430 (0x000C)
	TArray<int32_t>                                                                                      Duplicate_Positions;                               // 0x043C (0x000C)
	TArray<int32_t>                                                                                      Double_Entries;                                    // 0x0448 (0x000C)
	class UParticleSystem*                                                                               One_Hit_Particle_Indicator;                        // 0x0454 (0x0004)
	class UParticleSystem*                                                                               Two_Hit_Particle_Indicator;                        // 0x0458 (0x0004)
	TArray<FVector>                                                                                      Position_Array_With_duplicates;                    // 0x045C (0x000C)
	int32_t                                                                                              MultiGateIndex;                                    // 0x0468 (0x0004)
	TArray<FVector>                                                                                      TargetEmitterLocations;                            // 0x046C (0x000C)
	TArray<float>                                                                                        TargetEmitterNewMovementStartTimes;                // 0x0478 (0x000C)
	TArray<class UParticleSystemComponent*>                                                              DefaultPositonParticles;                           // 0x0484 (0x000C)
	class UParticleSystem*                                                                               Default_Location_Template;                         // 0x0490 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Line_MID;                                          // 0x0494 (0x0004)
	bool                                                                                                 Placement_is_Valid;                                // 0x0498 (0x0001)
	bool                                                                                                 Placement_is_Valid_Previously;                     // 0x0499 (0x0001)
	bool                                                                                                 Valid_state_changed;                               // 0x049A (0x0001)
	bool                                                                                                 Valid_State_Changed_Override;                      // 0x049B (0x0001)
	bool                                                                                                 Reinit_Particles;                                  // 0x049C (0x0001)
	bool                                                                                                 NewVar_0;                                          // 0x049D (0x0001)
	bool                                                                                                 Recreate_particles_if_valid;                       // 0x049E (0x0001)
	uint8_t                                                                                              UnknownData_49F[0x1];                              // 0x049F (0x0001) MISSED OFFSET
	float                                                                                                Delay_Between_Particle_Spawns;                     // 0x04A0 (0x0004)
public:
	void Kill_Emitters_and_Start_Times(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:Kill Emitters and Start Times
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:UserConstructionScript
	void Spawn_Arrow__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:Spawn Arrow__FinishedFunc
	void Spawn_Arrow__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:Spawn Arrow__UpdateFunc
	void OnBounceMotionUpdate(float VectorScale); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:OnBounceMotionUpdate
	void OnInitializeDecoPreview(class ABuildingActor* NewBuildingActor, class UFortDecoItemDefinition* NewDecoItemDefinition); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:OnInitializeDecoPreview
	void OnUpdateScale(float Scale, FVector InWorldSpacePivot); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:OnUpdateScale
	void OnUpdateVisuals(float DeltaSeconds, bool bSafeToPlace); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:OnUpdateVisuals
	void SetScalarParameterValueOnAllPreviewMIDs(FName ParamName, float ParamValue); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:SetScalarParameterValueOnAllPreviewMIDs
	void SetVectorParameterValueOnAllPreviewMIDs(FName ParamName, FLinearColor ParamValue); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:SetVectorParameterValueOnAllPreviewMIDs
	void SwitchType(TArray<FVector> Positions_With_Duplicates, TArray<FVector> Cleaned_Positions, TArray<int32_t> Duplicated_Entries); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:SwitchType
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:ReceiveBeginPlay
	void RestartLineReticule(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:RestartLineReticule
	void ExecuteUbergraph_B_Placement_Preview_AirStrike(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/B_Placement_Preview_AirStrike.B_Placement_Preview_AirStrike_C:ExecuteUbergraph_B_Placement_Preview_AirStrike
public:
	static class UClass* StaticClass();
};

