#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Llama_Head_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Llama_Head
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C
// 0x0049 (0x0461)
class AB_Prj_Llama_Head_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UStaticMeshComponent*                                                                          HeadMesh;                                          // 0x041C (0x0004)
	EPhysicalSurface                                                                                     WaterPhysMat;                                      // 0x0420 (0x0001)
	uint8_t                                                                                              UnknownData_421[0x3];                              // 0x0421 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               Bounce_WaterSplash_PS;                             // 0x0424 (0x0004)
	class UParticleSystem*                                                                               Bounce_Generic_PS;                                 // 0x0428 (0x0004)
	class USoundBase*                                                                                    BounceGenericSound;                                // 0x042C (0x0004)
	class USoundBase*                                                                                    BounceWaterSound;                                  // 0x0430 (0x0004)
	class UParticleSystem*                                                                               SmokeTrailFX;                                      // 0x0434 (0x0004)
	FName                                                                                                AttachSocketName;                                  // 0x0438 (0x0008)
	float                                                                                                RotTickDelta;                                      // 0x0440 (0x0004)
	bool                                                                                                 ShouldRotate;                                      // 0x0444 (0x0001)
	uint8_t                                                                                              UnknownData_445[0x3];                              // 0x0445 (0x0003) MISSED OFFSET
	FRotator                                                                                             RelativeRotation;                                  // 0x0448 (0x000C)
	class UParticleSystem*                                                                               DeathExplodeFX;                                    // 0x0454 (0x0004)
	class USoundBase*                                                                                    BounceSound;                                       // 0x0458 (0x0004)
	class USoundBase*                                                                                    ExplodeHeadSound;                                  // 0x045C (0x0004)
	bool                                                                                                 ProjectileActivated;                               // 0x0460 (0x0001)
public:
	void SpawnBounceFX(FHitResult Hit, FHitResult HitResult, EPhysicalSurface SurfaceType, FRotator HitResultRotation); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:SpawnBounceFX
	void UserConstructionScript(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:UserConstructionScript
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:OnBounce
	void ReceiveTick(float DeltaSeconds); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:ReceiveTick
	void OnProjectileStop_Event_0(FHitResult ImpactResult); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:OnProjectileStop_Event_0
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:ReceiveBeginPlay
	void ExecuteUbergraph_B_Prj_Llama_Head(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_Prj_Llama_Head.B_Prj_Llama_Head_C:ExecuteUbergraph_B_Prj_Llama_Head
public:
	static class UClass* StaticClass();
};

