#pragma once
#include "FN_Basic.h"

#include "FN_ButtonIconText_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ButtonIconText
*/

// WidgetBlueprintGeneratedClass /Game/UI/Buttons/ButtonIconText.ButtonIconText_C
// 0x00AC (0x07E8)
class UButtonIconText_C : public UFortBaseButton
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x073C (0x0004)
	class UHorizontalBox*                                                                                ContentHBox;                                       // 0x0740 (0x0004)
	class UImage*                                                                                        Icon;                                              // 0x0744 (0x0004)
	class UOverlay*                                                                                      IconOverlay;                                       // 0x0748 (0x0004)
	class UImage*                                                                                        Shadow;                                            // 0x074C (0x0004)
	class USizeBox*                                                                                      SizeBox;                                           // 0x0750 (0x0004)
	class UTextBlock*                                                                                    TextBlock;                                         // 0x0754 (0x0004)
	FText                                                                                                DisplayText;                                       // 0x0758 (0x000C)
	FSlateBrush                                                                                          IconBrush;                                         // 0x0764 (0x0074)
	bool                                                                                                 HasIcon;                                           // 0x07D8 (0x0001)
	bool                                                                                                 HasText;                                           // 0x07D9 (0x0001)
	ETextJustify                                                                                         Content_Align;                                     // 0x07DA (0x0001)
	uint8_t                                                                                              UnknownData_7DB[0x1];                              // 0x07DB (0x0001) MISSED OFFSET
	struct FUButtonIconText_C_On_Mouse_Hovered_Changed__DelegateSignature                                On_Mouse_Hovered_Changed;                          // 0x07DC (0x000C)
public:
	void Set_Alignment(ETextJustify Align); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Set Alignment
	void Update_Size_Box(); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Update Size Box
	FSlateColor Get_Primary_Color(); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Get Primary Color
	FLinearColor Get_Secondary_Color(); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Get Secondary Color
	void Update_Padding(); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Update Padding
	void Set_Icon(FSlateBrush InBrush, bool RefreshPadding); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Set Icon
	void Set_Text(FText InText, bool RefreshPadding); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:Set Text
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:PreConstruct
	void OnMouseEnter(FGeometry MyGeometry, FPointerEvent MouseEvent); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:OnMouseEnter
	void OnMouseLeave(FPointerEvent MouseEvent); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:OnMouseLeave
	void ExecuteUbergraph_ButtonIconText(int32_t EntryPoint); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:ExecuteUbergraph_ButtonIconText
	void On_Mouse_Hovered_Changed__DelegateSignature(bool Is_Hovered); // Function /Game/UI/Buttons/ButtonIconText.ButtonIconText_C:On Mouse Hovered Changed__DelegateSignature
public:
	static class UClass* StaticClass();
};

