#pragma once
#include "FN_Basic.h"

#include "FN_BasicStrokeBox_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BasicStrokeBox
*/

// WidgetBlueprintGeneratedClass /Game/UI/Main/BasicStrokeBox.BasicStrokeBox_C
// 0x0030 (0x0274)
class UBasicStrokeBox_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UImage*                                                                                        BaseMaterial;                                      // 0x0248 (0x0004)
	class UNamedSlot*                                                                                    Content;                                           // 0x024C (0x0004)
	FLinearColor                                                                                         fill;                                              // 0x0250 (0x0010)
	FLinearColor                                                                                         Stroke;                                            // 0x0260 (0x0010)
	int32_t                                                                                              Style;                                             // 0x0270 (0x0004)
public:
	void Customize(int32_t Shape_Style, FLinearColor Fill_Color, FLinearColor Stroke_Color); // Function /Game/UI/Main/BasicStrokeBox.BasicStrokeBox_C:Customize
	void Redraw(); // Function /Game/UI/Main/BasicStrokeBox.BasicStrokeBox_C:Redraw
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/Main/BasicStrokeBox.BasicStrokeBox_C:PreConstruct
	void ExecuteUbergraph_BasicStrokeBox(int32_t EntryPoint); // Function /Game/UI/Main/BasicStrokeBox.BasicStrokeBox_C:ExecuteUbergraph_BasicStrokeBox
public:
	static class UClass* StaticClass();
};

