#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Outlander_GravitySphere_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Outlander_GravitySphere
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C
// 0x00F4 (0x050C)
class AB_Prj_Outlander_GravitySphere_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      P_Outlander_GravitySphere_Running_01;              // 0x041C (0x0004)
	class UPostProcessComponent*                                                                         PostProcess;                                       // 0x0420 (0x0004)
	class USphereComponent*                                                                              ActualCollide;                                     // 0x0424 (0x0004)
	class UParticleSystemComponent*                                                                      P_Outlander_GravityWell_01;                        // 0x0428 (0x0004)
	class UStaticMeshComponent*                                                                          GravitySphere;                                     // 0x042C (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Distance_Guide;                             // 0x0430 (0x0004)
	class UStaticMeshComponent*                                                                          Mesh;                                              // 0x0434 (0x0004)
	class UParticleSystemComponent*                                                                      Effect_land;                                       // 0x0438 (0x0004)
	float                                                                                                SphereEnemyReact_LERP_3B5F4B8A40E5A9B40A8066878C7931B6; // 0x043C (0x0004)
	ETimelineDirection                                                                                   SphereEnemyReact__Direction_3B5F4B8A40E5A9B40A8066878C7931B6; // 0x0440 (0x0001)
	uint8_t                                                                                              UnknownData_441[0x3];                              // 0x0441 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            SphereEnemyReact;                                  // 0x0444 (0x0004)
	float                                                                                                EnterTheSphere_PPBlendWeight_EFA485B548B488E7BF5B40B928962649; // 0x0448 (0x0004)
	ETimelineDirection                                                                                   EnterTheSphere__Direction_EFA485B548B488E7BF5B40B928962649; // 0x044C (0x0001)
	uint8_t                                                                                              UnknownData_44D[0x3];                              // 0x044D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            EnterTheSphere;                                    // 0x0450 (0x0004)
	float                                                                                                ScaleSphere_FresnelExponent_0D305844404C6ED95C6E6DA4497EDD45; // 0x0454 (0x0004)
	float                                                                                                ScaleSphere_Scale_0D305844404C6ED95C6E6DA4497EDD45; // 0x0458 (0x0004)
	ETimelineDirection                                                                                   ScaleSphere__Direction_0D305844404C6ED95C6E6DA4497EDD45; // 0x045C (0x0001)
	uint8_t                                                                                              UnknownData_45D[0x3];                              // 0x045D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            ScaleSphere;                                       // 0x0460 (0x0004)
	class UAudioComponent*                                                                               Alarm_Sound;                                       // 0x0464 (0x0004)
	FVector                                                                                              EffectSizeScale;                                   // 0x0468 (0x000C)
	float                                                                                                SphereSize;                                        // 0x0474 (0x0004)
	float                                                                                                LifeTime;                                          // 0x0478 (0x0004)
	class USoundBase*                                                                                    ExplosionSound;                                    // 0x047C (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x0480 (0x000C)
	class UMaterialInstanceDynamic*                                                                      SphereMID;                                         // 0x048C (0x0004)
	bool                                                                                                 IsFriendly;                                        // 0x0490 (0x0001)
	uint8_t                                                                                              UnknownData_491[0x3];                              // 0x0491 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               RippleFX;                                          // 0x0494 (0x0004)
	float                                                                                                Scale_Sphere_Reverse_Play_Rate;                    // 0x0498 (0x0004)
	float                                                                                                RefractionAmountExterior;                          // 0x049C (0x0004)
	float                                                                                                Fresnel_Brightness_A;                              // 0x04A0 (0x0004)
	float                                                                                                Jiggle_Intensity_A;                                // 0x04A4 (0x0004)
	float                                                                                                Fresnel_Exponent_A;                                // 0x04A8 (0x0004)
	float                                                                                                Distorion_Tile;                                    // 0x04AC (0x0004)
	bool                                                                                                 isActive_;                                         // 0x04B0 (0x0001)
	uint8_t                                                                                              UnknownData_4B1[0x3];                              // 0x04B1 (0x0003) MISSED OFFSET
	FVector                                                                                              Ripple_Location_Offset;                            // 0x04B4 (0x000C)
	float                                                                                                Jiggle_Speed;                                      // 0x04C0 (0x0004)
	bool                                                                                                 CanLoop_;                                          // 0x04C4 (0x0001)
	bool                                                                                                 bHasEnemyExtraGravity;                             // 0x04C5 (0x0001)
	bool                                                                                                 bHasHeavyStuff;                                    // 0x04C6 (0x0001)
	uint8_t                                                                                              UnknownData_4C7[0x1];                              // 0x04C7 (0x0001) MISSED OFFSET
	float                                                                                                LinesTile;                                         // 0x04C8 (0x0004)
	float                                                                                                SphereEnemyReactLERP;                              // 0x04CC (0x0004)
	int32_t                                                                                              EnemyCounter;                                      // 0x04D0 (0x0004)
	FGameplayTag                                                                                         GravityTag;                                        // 0x04D4 (0x0008)
	class UClass*                                                                                        InsideGravitySphereGE;                             // 0x04DC (0x0004)
	class UClass*                                                                                        FriendlyGravityGE;                                 // 0x04E0 (0x0004)
	class UClass*                                                                                        EnemyGravityGE;                                    // 0x04E4 (0x0004)
	class UClass*                                                                                        HeavyStuffGE;                                      // 0x04E8 (0x0004)
	float                                                                                                EnemyExitGravityDuration;                          // 0x04EC (0x0004)
	float                                                                                                FriendlyExitGravityDuration;                       // 0x04F0 (0x0004)
	class UFortGameplayAbility*                                                                          InstigatingAbility;                                // 0x04F4 (0x0004)
	class USoundBase*                                                                                    Sound_Sphere_Start;                                // 0x04F8 (0x0004)
	class USoundBase*                                                                                    Sound_Sphere_Enter;                                // 0x04FC (0x0004)
	class USoundBase*                                                                                    Sound_Sphere_Exit;                                 // 0x0500 (0x0004)
	class USoundBase*                                                                                    Sound_Sphere_End;                                  // 0x0504 (0x0004)
	class USoundBase*                                                                                    Sound_Sphere_Loop;                                 // 0x0508 (0x0004)
public:
	void OnRep_bHasHeavyStuff(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:OnRep_bHasHeavyStuff
	void SpawnRippleFX(class AActor* As_Fort_Pawn); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:SpawnRippleFX
	void UserConstructionScript(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:UserConstructionScript
	void ScaleSphere__FinishedFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:ScaleSphere__FinishedFunc
	void ScaleSphere__UpdateFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:ScaleSphere__UpdateFunc
	void EnterTheSphere__FinishedFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:EnterTheSphere__FinishedFunc
	void EnterTheSphere__UpdateFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:EnterTheSphere__UpdateFunc
	void SphereEnemyReact__FinishedFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:SphereEnemyReact__FinishedFunc
	void SphereEnemyReact__UpdateFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:SphereEnemyReact__UpdateFunc
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:OnBounce
	void Planted(FVector ImpactPoint, FVector ImpactNormal); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:Planted
	void BndEvt__ActualCollide_K2Node_ComponentBoundEvent_493_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:BndEvt__ActualCollide_K2Node_ComponentBoundEvent_493_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__ActualCollide_K2Node_ComponentBoundEvent_496_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:BndEvt__ActualCollide_K2Node_ComponentBoundEvent_496_ComponentEndOverlapSignature__DelegateSignature
	void RewindSphere(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:RewindSphere
	void RewindPP(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:RewindPP
	void Loop(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:Loop
	void SetHasHeavyStuff(bool bInHasHeavyStuff); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:SetHasHeavyStuff
	void OnEnterGravitySphere(class AActor* EnteringActor); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:OnEnterGravitySphere
	void OnExitGravitySphere(class AActor* ExitingActor); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:OnExitGravitySphere
	void SetHasEnemyExtraGravity(bool bHasEnemyExtraGravity); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:SetHasEnemyExtraGravity
	void ExecuteUbergraph_B_Prj_Outlander_GravitySphere(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/B_Prj_Outlander_GravitySphere.B_Prj_Outlander_GravitySphere_C:ExecuteUbergraph_B_Prj_Outlander_GravitySphere
public:
	static class UClass* StaticClass();
};

