#pragma once
#include "FN_Basic.h"

#include "FN_BP_Soldier_Minigun_parameters.h"
#include "FN_AnimGraphRuntime_enums.h"
#include "FN_AnimGraphRuntime_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BP_Soldier_Minigun
*/

// AnimBlueprintGeneratedClass /Game/Animation/Game/MainPlayer/Combat/Gadgets/Medium/BP_Soldier_Minigun.BP_Soldier_Minigun_C
// 0x0178 (0x0488)
class UBP_Soldier_Minigun_C : public UAnimInstance
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0310 (0x0004)
	FAnimNode_Root                                                                                       AnimGraphNode_Root_5BEDD1AF46E640F37CCC9FAA8DF7F6DC; // 0x0314 (0x002C)
	FAnimNode_Slot                                                                                       AnimGraphNode_Slot_15839C374918416DF8289BAE7466DE11; // 0x0340 (0x0044)
	FAnimNode_RefPose                                                                                    AnimGraphNode_LocalRefPose_2EBCC5E14721752B867C05844909B58B; // 0x0384 (0x0024)
	FAnimNode_ModifyBone                                                                                 AnimGraphNode_ModifyBone_CDE861E049ED25F9468E1596307CE0F7; // 0x03A8 (0x0080)
	FAnimNode_ConvertLocalToComponentSpace                                                               AnimGraphNode_LocalToComponentSpace_2E6915294401BD03648F4689C8817592; // 0x0428 (0x002C)
	FAnimNode_ConvertComponentToLocalSpace                                                               AnimGraphNode_ComponentToLocalSpace_580B6AC241C93B1B43A2A4ACEF5528AD; // 0x0454 (0x002C)
	float                                                                                                MinigunRotation;                                   // 0x0480 (0x0004)
	float                                                                                                MaxMinigunRotSpeed;                                // 0x0484 (0x0004)
public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_Minigun_AnimGraphNode_ModifyBone_CDE861E049ED25F9468E1596307CE0F7(); // Function /Game/Animation/Game/MainPlayer/Combat/Gadgets/Medium/BP_Soldier_Minigun.BP_Soldier_Minigun_C:EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Soldier_Minigun_AnimGraphNode_ModifyBone_CDE861E049ED25F9468E1596307CE0F7
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function /Game/Animation/Game/MainPlayer/Combat/Gadgets/Medium/BP_Soldier_Minigun.BP_Soldier_Minigun_C:BlueprintUpdateAnimation
	void ExecuteUbergraph_BP_Soldier_Minigun(int32_t EntryPoint); // Function /Game/Animation/Game/MainPlayer/Combat/Gadgets/Medium/BP_Soldier_Minigun.BP_Soldier_Minigun_C:ExecuteUbergraph_BP_Soldier_Minigun
public:
	static class UClass* StaticClass();
};

