#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Post_Explosion_Generic
*/

// BlueprintGeneratedClass /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_Generic.B_Post_Explosion_Generic_C
// 0x03AC (0x05EC)
class AB_Post_Explosion_Generic_C : public AActor
{
public:
	class UPostProcessComponent*                                                                         PostFX;                                            // 0x0240 (0x0004)
	class USphereComponent*                                                                              PostFX_SphereComponent;                            // 0x0244 (0x0004)
	FVector                                                                                              PostFX_PreviewScale;                               // 0x0248 (0x000C)
	float                                                                                                PostFX_BlendRadius;                                // 0x0254 (0x0004)
	FVector                                                                                              PostFX_ShakeEpicenter;                             // 0x0258 (0x000C)
	float                                                                                                PostFX_ShakeOuterradius;                           // 0x0264 (0x0004)
	float                                                                                                PostFX_ShakeInnerRadius;                           // 0x0268 (0x0004)
	bool                                                                                                 UseCameraShake;                                    // 0x026C (0x0001)
	uint8_t                                                                                              UnknownData_26D[0x3];                              // 0x026D (0x0003) MISSED OFFSET
	class UClass*                                                                                        CameraShakeClass;                                  // 0x0270 (0x0004)
	float                                                                                                DeactivateDelay;                                   // 0x0274 (0x0004)
	FPostProcessSettings                                                                                 PostFX_Settings;                                   // 0x0278 (0x0374)
public:
	void UserConstructionScript(); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_Generic.B_Post_Explosion_Generic_C:UserConstructionScript
public:
	static class UClass* StaticClass();
};

