#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Ninja_ThrowingStars_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Ninja_ThrowingStars
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C
// 0x002C (0x0444)
class AB_Prj_Ninja_ThrowingStars_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UBoxComponent*                                                                                 CollisionBox;                                      // 0x041C (0x0004)
	class UStaticMeshComponent*                                                                          Mesh;                                              // 0x0420 (0x0004)
	class UParticleSystemComponent*                                                                      ProjectilePS;                                      // 0x0424 (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x0428 (0x000C)
	class UParticleSystem*                                                                               P_ImpactEffects;                                   // 0x0434 (0x0004)
	class USoundBase*                                                                                    Cue_ImpactSound;                                   // 0x0438 (0x0004)
	bool                                                                                                 Piercing;                                          // 0x043C (0x0001)
	uint8_t                                                                                              UnknownData_43D[0x3];                              // 0x043D (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               ProjectilePiercingPS;                              // 0x0440 (0x0004)
public:
	void OnRep_Piercing(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:OnRep_Piercing
	void OnRep_HitLocation(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:OnRep_HitLocation
	void UserConstructionScript(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:UserConstructionScript
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:ReceiveHit
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:OnExploded
	void SetHoming(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:SetHoming
	void HomeTargetDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:HomeTargetDied
	void ShouldPierce(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:ShouldPierce
	void BndEvt__CollisionBox_K2Node_ComponentBoundEvent_30_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:BndEvt__CollisionBox_K2Node_ComponentBoundEvent_30_ComponentBeginOverlapSignature__DelegateSignature
	void ExecuteUbergraph_B_Prj_Ninja_ThrowingStars(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/B_Prj_Ninja_ThrowingStars.B_Prj_Ninja_ThrowingStars_C:ExecuteUbergraph_B_Prj_Ninja_ThrowingStars
public:
	static class UClass* StaticClass();
};

