#pragma once
#include "FN_Basic.h"

#include "FN_BuildingLevelWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BuildingLevelWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C
// 0x0019 (0x025D)
class UBuildingLevelWidget_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UImage*                                                                                        Icon;                                              // 0x0248 (0x0004)
	TArray<FFortMultiSizeBrush>                                                                          StarIcon;                                          // 0x024C (0x000C)
	int32_t                                                                                              Level;                                             // 0x0258 (0x0004)
	EFortBrushSize                                                                                       Brush_Size;                                        // 0x025C (0x0001)
public:
	void Update(); // Function /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C:Update
	void Set_Brush_Size(EFortBrushSize New_Size); // Function /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C:Set Brush Size
	void Set_Level(int32_t New_Level); // Function /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C:Set Level
	void Construct(); // Function /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C:Construct
	void ExecuteUbergraph_BuildingLevelWidget(int32_t EntryPoint); // Function /Game/UI/HomeBase/Level/BuildingLevelWidget.BuildingLevelWidget_C:ExecuteUbergraph_BuildingLevelWidget
public:
	static class UClass* StaticClass();
};

