#pragma once
#include "FN_Basic.h"

#include "FN_B_SlowField_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_SlowField
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C
// 0x018D (0x0615)
class AB_SlowField_C : public ABuildingGameplayActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0488 (0x0004)
	class UParticleSystemComponent*                                                                      P_Slowfield_Beacon_01;                             // 0x048C (0x0004)
	class UAudioComponent*                                                                               WarmUp_Warrning_AudioComponent;                    // 0x0490 (0x0004)
	class UParticleSystemComponent*                                                                      P_Slowfield_ActivateRays_01;                       // 0x0494 (0x0004)
	class UPostProcessComponent*                                                                         SlowPostProcess;                                   // 0x0498 (0x0004)
	class UAudioComponent*                                                                               SlowFieldAudioComponent;                           // 0x049C (0x0004)
	class UStaticMeshComponent*                                                                          SlowFieldOverlapCylinder;                          // 0x04A0 (0x0004)
	class USkeletalMeshComponent*                                                                        SlowFieldGeneratorMesh;                            // 0x04A4 (0x0004)
	class UBoxComponent*                                                                                 ProjCollision;                                     // 0x04A8 (0x0004)
	class UProjectileMovementComponent*                                                                  ProjMovementComp;                                  // 0x04AC (0x0004)
	float                                                                                                Audio_Powerdown_PitchCurve_C8D7334746A8A7EB557C1CBA73016E49; // 0x04B0 (0x0004)
	ETimelineDirection                                                                                   Audio_Powerdown__Direction_C8D7334746A8A7EB557C1CBA73016E49; // 0x04B4 (0x0001)
	uint8_t                                                                                              UnknownData_4B5[0x3];                              // 0x04B5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Audio_Powerdown;                                   // 0x04B8 (0x0004)
	float                                                                                                MaterializeCylinder_OffsetOnZ_A2EB343B46944EB7215B3BB14FDAA3D5; // 0x04BC (0x0004)
	float                                                                                                MaterializeCylinder_Fresnel_A2EB343B46944EB7215B3BB14FDAA3D5; // 0x04C0 (0x0004)
	float                                                                                                MaterializeCylinder_ActivateLERP_A2EB343B46944EB7215B3BB14FDAA3D5; // 0x04C4 (0x0004)
	float                                                                                                MaterializeCylinder_Materialize_A2EB343B46944EB7215B3BB14FDAA3D5; // 0x04C8 (0x0004)
	ETimelineDirection                                                                                   MaterializeCylinder__Direction_A2EB343B46944EB7215B3BB14FDAA3D5; // 0x04CC (0x0001)
	uint8_t                                                                                              UnknownData_4CD[0x3];                              // 0x04CD (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            MaterializeCylinder;                               // 0x04D0 (0x0004)
	float                                                                                                SlowPP_PP_Weight_5E23169C446B32FE34B254B7E75DB7B4; // 0x04D4 (0x0004)
	ETimelineDirection                                                                                   SlowPP__Direction_5E23169C446B32FE34B254B7E75DB7B4; // 0x04D8 (0x0001)
	uint8_t                                                                                              UnknownData_4D9[0x3];                              // 0x04D9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            SlowPP;                                            // 0x04DC (0x0004)
	class UParticleSystem*                                                                               DeathEffects;                                      // 0x04E0 (0x0004)
	bool                                                                                                 IsDeployed;                                        // 0x04E4 (0x0001)
	uint8_t                                                                                              UnknownData_4E5[0x3];                              // 0x04E5 (0x0003) MISSED OFFSET
	class USoundBase*                                                                                    DeploymentSound;                                   // 0x04E8 (0x0004)
	class USoundBase*                                                                                    DeactivateSound;                                   // 0x04EC (0x0004)
	class UClass*                                                                                        InsideSlowFieldGE;                                 // 0x04F0 (0x0004)
	class UClass*                                                                                        SlowGE;                                            // 0x04F4 (0x0004)
	float                                                                                                ProjectileSpeedMultiplier;                         // 0x04F8 (0x0004)
	FGameplayTag                                                                                         SlowTag;                                           // 0x04FC (0x0008)
	float                                                                                                Radius;                                            // 0x0504 (0x0004)
	float                                                                                                Height;                                            // 0x0508 (0x0004)
	bool                                                                                                 AffectsTeammates;                                  // 0x050C (0x0001)
	uint8_t                                                                                              UnknownData_50D[0x3];                              // 0x050D (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      SlowFieldOverlapMID;                               // 0x0510 (0x0004)
	float                                                                                                HeightOffsetZ;                                     // 0x0514 (0x0004)
	float                                                                                                Activation_Delay;                                  // 0x0518 (0x0004)
	float                                                                                                Refraction_Strength_Active;                        // 0x051C (0x0004)
	float                                                                                                Emissive_Boost_Active;                             // 0x0520 (0x0004)
	float                                                                                                Fresnel_Opacity_Active;                            // 0x0524 (0x0004)
	float                                                                                                Fresnel_Opacity_Inactive;                          // 0x0528 (0x0004)
	float                                                                                                Fresnel_Exponent_Active;                           // 0x052C (0x0004)
	float                                                                                                Rays_Activate_Size_Y;                              // 0x0530 (0x0004)
	float                                                                                                Rays_Activate_Size_Z;                              // 0x0534 (0x0004)
	float                                                                                                Transition_In__seconds_;                           // 0x0538 (0x0004)
	bool                                                                                                 InWarmup;                                          // 0x053C (0x0001)
	uint8_t                                                                                              UnknownData_53D[0x3];                              // 0x053D (0x0003) MISSED OFFSET
	float                                                                                                Beacon_Final_Speed;                                // 0x0540 (0x0004)
	float                                                                                                Beacon_Start_Speed;                                // 0x0544 (0x0004)
	float                                                                                                Beacon_Speedup_Play_Speed;                         // 0x0548 (0x0004)
	float                                                                                                Beacon_Speedup_Play_Speed_Chip_OffTime;            // 0x054C (0x0004)
	bool                                                                                                 Beacon_Can_Play_;                                  // 0x0550 (0x0001)
	uint8_t                                                                                              UnknownData_551[0x3];                              // 0x0551 (0x0003) MISSED OFFSET
	FLinearColor                                                                                         Activate_Rays_Color__Friendly_;                    // 0x0554 (0x0010)
	FLinearColor                                                                                         Activate_Rays_Color__Enemy_;                       // 0x0564 (0x0010)
	FLinearColor                                                                                         Activate_Rays_Core_Color__Friendly_;               // 0x0574 (0x0010)
	FLinearColor                                                                                         Activate_Rays_Core_Color__Enemy_;                  // 0x0584 (0x0010)
	FLinearColor                                                                                         Beacon_Core_Color__Friendly_;                      // 0x0594 (0x0010)
	FLinearColor                                                                                         Beacon_Core_Color__Enemy_;                         // 0x05A4 (0x0010)
	FLinearColor                                                                                         Beacon_Streak_Color__Friendly_;                    // 0x05B4 (0x0010)
	FLinearColor                                                                                         Beacon_Streak_Color__Enemy_;                       // 0x05C4 (0x0010)
	FLinearColor                                                                                         Slowfield_Inner_Color__Friendly_;                  // 0x05D4 (0x0010)
	FLinearColor                                                                                         Slowfield_Inner_Color__Enemy_;                     // 0x05E4 (0x0010)
	FLinearColor                                                                                         Slowfield_PP_Color__Friendly_;                     // 0x05F4 (0x0010)
	FLinearColor                                                                                         Slowfield_PP_Color__Enemy_;                        // 0x0604 (0x0010)
	bool                                                                                                 LocalPostProcessOn;                                // 0x0614 (0x0001)
public:
	void SetTeamColorsVFX(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:SetTeamColorsVFX
	void OnRep_IsDeployed(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:OnRep_IsDeployed
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:UserConstructionScript
	void SlowPP__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:SlowPP__FinishedFunc
	void SlowPP__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:SlowPP__UpdateFunc
	void Audio_Powerdown__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:Audio Powerdown__FinishedFunc
	void Audio_Powerdown__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:Audio Powerdown__UpdateFunc
	void MaterializeCylinder__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:MaterializeCylinder__FinishedFunc
	void MaterializeCylinder__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:MaterializeCylinder__UpdateFunc
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:OnDeathPlayEffects
	void BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_233_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:BndEvt__SlowFieldOverlapCylinder_K2Node_ComponentBoundEvent_242_ComponentEndOverlapSignature__DelegateSignature
	void PP_Activate(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:PP_Activate
	void PP_Deactivate(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:PP_Deactivate
	void PassInfo(float Height, float Radius, float Activation_Delay); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:PassInfo
	void Beacon_Loop(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:Beacon Loop
	void BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature(FHitResult ImpactResult, FVector ImpactVelocity); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:BndEvt__ProjMovementComp_K2Node_ComponentBoundEvent_228_OnProjectileBounceDelegate__DelegateSignature
	void OnLocalPlayerDeath(class AActor* DeadActor, float Damage, class AFortPawn* InstigatedBy, FVector HitLocation, class AActor* DamageCauser); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:OnLocalPlayerDeath
	void ExecuteUbergraph_B_SlowField(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/B_SlowField.B_SlowField_C:ExecuteUbergraph_B_SlowField
public:
	static class UClass* StaticClass();
};

