#pragma once
#include "FN_Basic.h"

#include "FN_B_BGA_Explorer_OutlanderFragmentBear_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_BGA_Explorer_OutlanderFragmentBear
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C
// 0x0120 (0x05A8)
class AB_BGA_Explorer_OutlanderFragmentBear_C : public ABuildingGameplayActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0488 (0x0004)
	class UAudioComponent*                                                                               FiringAudioComponent;                              // 0x048C (0x0004)
	class UParticleSystemComponent*                                                                      MuzzleFlashParticleComponent_L;                    // 0x0490 (0x0004)
	class USkeletalMeshComponent*                                                                        BearMesh;                                          // 0x0494 (0x0004)
	class USphereComponent*                                                                              SightRadiusSphereComponent;                        // 0x0498 (0x0004)
	class UParticleSystemComponent*                                                                      MuzzleFlashParticleComponent_R;                    // 0x049C (0x0004)
	class UCapsuleComponent*                                                                             CollisionComponent;                                // 0x04A0 (0x0004)
	FGameplayTagContainer                                                                                TC_TargetAcquisitionAbility;                       // 0x04A4 (0x0018)
	FName                                                                                                EyeSocketName;                                     // 0x04BC (0x0008)
	class AFortPawn*                                                                                     TargetPawnToTrack;                                 // 0x04C4 (0x0004)
	float                                                                                                TargetAcquisitionCheckTimer;                       // 0x04C8 (0x0004)
	FString                                                                                              TargetAcquisitionFunctionName;                     // 0x04CC (0x000C)
	FString                                                                                              FiringFunctionName;                                // 0x04D8 (0x000C)
	float                                                                                                FireTimer;                                         // 0x04E4 (0x0004)
	FRotator                                                                                             InitialRelativeGunRotation;                        // 0x04E8 (0x000C)
	float                                                                                                GunInterpSpeed;                                    // 0x04F4 (0x0004)
	FGameplayTagContainer                                                                                TC_SentryFireAbility;                              // 0x04F8 (0x0018)
	class UClass*                                                                                        TracerClass;                                       // 0x0510 (0x0004)
	class UParticleSystem*                                                                               ImpactEffect;                                      // 0x0514 (0x0004)
	float                                                                                                RangeSquared;                                      // 0x0518 (0x0004)
	float                                                                                                FiringDotProductThreshold;                         // 0x051C (0x0004)
	class UParticleSystem*                                                                               DeathEffects;                                      // 0x0520 (0x0004)
	bool                                                                                                 IsDeployed;                                        // 0x0524 (0x0001)
	uint8_t                                                                                              UnknownData_525[0x3];                              // 0x0525 (0x0003) MISSED OFFSET
	float                                                                                                YawRotationLimit;                                  // 0x0528 (0x0004)
	float                                                                                                PitchRotationLimit;                                // 0x052C (0x0004)
	float                                                                                                SightRadius;                                       // 0x0530 (0x0004)
	TArray<class AFortPawn*>                                                                             PotentialTargets;                                  // 0x0534 (0x000C)
	float                                                                                                RotationClampMax;                                  // 0x0540 (0x0004)
	class USoundBase*                                                                                    DeploymentSound;                                   // 0x0544 (0x0004)
	FVector                                                                                              Tracer_Scale;                                      // 0x0548 (0x000C)
	class USoundBase*                                                                                    Cue_SpawnBear;                                     // 0x0554 (0x0004)
	class USoundBase*                                                                                    CueBearDies;                                       // 0x0558 (0x0004)
	class USoundBase*                                                                                    CueBearBark;                                       // 0x055C (0x0004)
	FTimerHandle                                                                                         BearBarkTimer;                                     // 0x0560 (0x0004)
	FGameplayTag                                                                                         FireCueTag;                                        // 0x0564 (0x0008)
	FRotator                                                                                             TargetRelativeRotation;                            // 0x056C (0x000C)
	FName                                                                                                MuzzleLeftSocketName;                              // 0x0578 (0x0008)
	FName                                                                                                MuzzleRightSocketName;                             // 0x0580 (0x0008)
	FRotator                                                                                             CurrentRelativeRotation;                           // 0x0588 (0x000C)
	float                                                                                                RotateToTargetInterpSpeed;                         // 0x0594 (0x0004)
	float                                                                                                RotationResetInterpSpeed;                          // 0x0598 (0x0004)
	bool                                                                                                 bLeftTracer;                                       // 0x059C (0x0001)
	uint8_t                                                                                              UnknownData_59D[0x3];                              // 0x059D (0x0003) MISSED OFFSET
	float                                                                                                LastKillSoundTime;                                 // 0x05A0 (0x0004)
	float                                                                                                MinKillSoundInterval;                              // 0x05A4 (0x0004)
public:
	void OnRep_TargetPawnToTrack(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnRep_TargetPawnToTrack
	void ToggleFireCue(bool bEnable); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ToggleFireCue
	void Is_Pawn_Inside_Pitch_Limits(class AFortPawn* Pawn, bool bInsidePitchLimits); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:Is Pawn Inside Pitch Limits
	void IsValidTarget(class AFortPawn* PotentialTarget, bool bIncludeSimpleRangeCheck, bool bIncludeFiringLimitCheck, bool bIncludeObstructionCheck, bool bValidTarget); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:IsValidTarget
	void OnPotentialTargetUntouched(class AFortPawn* UntouchedPotentialTarget); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnPotentialTargetUntouched
	void OnNewPotentialTargetTouched(class AFortPawn* PotentialTargetPawn); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnNewPotentialTargetTouched
	void ShouldFire(bool ShouldFire); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ShouldFire
	void ClearTargetAcquisitionTimer(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ClearTargetAcquisitionTimer
	void ClearFiringTimer(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ClearFiringTimer
	void SpawnImpactEffects(FVector HitLocation); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:SpawnImpactEffects
	void SpawnTracer(FVector HitLocation, bool bLeftTracer); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:SpawnTracer
	void UpdateRotation(class AActor* LookAtActor, float DeltaSeconds); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:UpdateRotation
	void SetTargetAcquisitionTimer(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:SetTargetAcquisitionTimer
	void SetFiringTimer(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:SetFiringTimer
	void AttemptFire(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:AttemptFire
	void AttemptAcquireTarget(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:AttemptAcquireTarget
	FTransform GetTargetingSourceTransform(EFortAbilityTargetingSource Source) const; // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:GetTargetingSourceTransform
	void UserConstructionScript(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ReceiveBeginPlay
	void GameplayCue_Impact_Physical(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:GameplayCue.Impact.Physical
	void ReceiveTick(float DeltaSeconds); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ReceiveTick
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnDeathPlayEffects
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnDeathServer
	void BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_271_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:BndEvt__SightRadiusSphereComponent_K2Node_ComponentBoundEvent_275_ComponentEndOverlapSignature__DelegateSignature
	void KilledTargetPawn(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:KilledTargetPawn
	void GameplayCue_Weapons_Activation(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:GameplayCue.Weapons.Activation
	void SetTargetPawn(class AFortPawn* NewTargetPawn); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:SetTargetPawn
	void OnTargetPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:OnTargetPawnDied
	void Bearricade(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:Bearricade
	void ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/B_BGA_Explorer_OutlanderFragmentBear.B_BGA_Explorer_OutlanderFragmentBear_C:ExecuteUbergraph_B_BGA_Explorer_OutlanderFragmentBear
public:
	static class UClass* StaticClass();
};

