#pragma once
#include "FN_Basic.h"

#include "FN_BP_Hex_Outpost_parameters.h"
#include "FN_BP_Hex_PARENT_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BP_Hex_Outpost
*/

// BlueprintGeneratedClass /Game/World/ZoneThemes/Outposts/BP_Hex_Outpost.BP_Hex_Outpost_C
// 0x003C (0x0728)
class ABP_Hex_Outpost_C : public ABP_Hex_PARENT_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06EC (0x0004)
	class UStaticMeshComponent*                                                                          MeshFlagpole;                                      // 0x06F0 (0x0004)
	class UStaticMeshComponent*                                                                          MeshCommandCenterFlag;                             // 0x06F4 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh3;                                       // 0x06F8 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh2;                                       // 0x06FC (0x0004)
	class UStaticMeshComponent*                                                                          MeshTowerBall;                                     // 0x0700 (0x0004)
	class UStaticMeshComponent*                                                                          TestProp_RadarTower;                               // 0x0704 (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_StorageVault_None;                      // 0x0708 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh1_0;                                     // 0x070C (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_HarvestingOptimizer_None;               // 0x0710 (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_Fabricator_None;                        // 0x0714 (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_CraftingTable_None;                     // 0x0718 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh_0;                                      // 0x071C (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_ShieldExtender;                         // 0x0720 (0x0004)
	class UStaticMeshComponent*                                                                          SM_Outpost_Core;                                   // 0x0724 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/World/ZoneThemes/Outposts/BP_Hex_Outpost.BP_Hex_Outpost_C:UserConstructionScript
	void ActivateOutpost(); // Function /Game/World/ZoneThemes/Outposts/BP_Hex_Outpost.BP_Hex_Outpost_C:ActivateOutpost
	void ExecuteUbergraph_BP_Hex_Outpost(int32_t EntryPoint); // Function /Game/World/ZoneThemes/Outposts/BP_Hex_Outpost.BP_Hex_Outpost_C:ExecuteUbergraph_BP_Hex_Outpost
public:
	static class UClass* StaticClass();
};

