#pragma once
#include "FN_Basic.h"

#include "FN_BP_Hex_PARENT_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BP_Hex_PARENT
*/

// BlueprintGeneratedClass /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C
// 0x036C (0x06EC)
class ABP_Hex_PARENT_C : public AFortTheaterMapTile
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0380 (0x0004)
	class UStaticMeshComponent*                                                                          Mission;                                           // 0x0384 (0x0004)
	class UStaticMeshComponent*                                                                          S_HexMouseover01;                                  // 0x0388 (0x0004)
	class UParticleSystemComponent*                                                                      P_Cine_Weapon_Beam_01;                             // 0x038C (0x0004)
	class UTextRenderComponent*                                                                          NW;                                                // 0x0390 (0x0004)
	class UTextRenderComponent*                                                                          SW;                                                // 0x0394 (0x0004)
	class UTextRenderComponent*                                                                          S;                                                 // 0x0398 (0x0004)
	class UTextRenderComponent*                                                                          SE;                                                // 0x039C (0x0004)
	class UTextRenderComponent*                                                                          NE;                                                // 0x03A0 (0x0004)
	class UTextRenderComponent*                                                                          N;                                                 // 0x03A4 (0x0004)
	class UTextRenderComponent*                                                                          DebugTextRenderType;                               // 0x03A8 (0x0004)
	class UStaticMeshComponent*                                                                          S_Hex_ZoneMarker01;                                // 0x03AC (0x0004)
	class UMaterialBillboardComponent*                                                                   MissionIconMesh;                                   // 0x03B0 (0x0004)
	class UTextRenderComponent*                                                                          DebugTextRenderZone;                               // 0x03B4 (0x0004)
	class UTextRenderComponent*                                                                          DebugTextRenderState;                              // 0x03B8 (0x0004)
	class UStaticMeshComponent*                                                                          S_HexBase_CloudLarge;                              // 0x03BC (0x0004)
	class UStaticMeshComponent*                                                                          S_HexBase_CloudSmall;                              // 0x03C0 (0x0004)
	class UPointLightComponent*                                                                          PointLight3;                                       // 0x03C4 (0x0004)
	class UPointLightComponent*                                                                          PointLight2;                                       // 0x03C8 (0x0004)
	class UPointLightComponent*                                                                          PointLight1;                                       // 0x03CC (0x0004)
	class UAudioComponent*                                                                               LightningAudio;                                    // 0x03D0 (0x0004)
	class UParticleSystemComponent*                                                                      lightning2;                                        // 0x03D4 (0x0004)
	class UParticleSystemComponent*                                                                      Lightning;                                         // 0x03D8 (0x0004)
	class UStaticMeshComponent*                                                                          LightningMesh;                                     // 0x03DC (0x0004)
	class USceneComponent*                                                                               LightningRoot;                                     // 0x03E0 (0x0004)
	class UWidgetComponent*                                                                              Widget;                                            // 0x03E4 (0x0004)
	class USpotLightComponent*                                                                           MouseoverLight;                                    // 0x03E8 (0x0004)
	class UStaticMeshComponent*                                                                          MissionPingMesh;                                   // 0x03EC (0x0004)
	class UAudioComponent*                                                                               HexTileSound;                                      // 0x03F0 (0x0004)
	float                                                                                                Timeline_12_NewTrack_3_9A9B376A4CE242AE90C66285F93293B7; // 0x03F4 (0x0004)
	float                                                                                                Timeline_12_NewTrack_2_9A9B376A4CE242AE90C66285F93293B7; // 0x03F8 (0x0004)
	ETimelineDirection                                                                                   Timeline_12__Direction_9A9B376A4CE242AE90C66285F93293B7; // 0x03FC (0x0001)
	uint8_t                                                                                              UnknownData_3FD[0x3];                              // 0x03FD (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_12;                                       // 0x0400 (0x0004)
	float                                                                                                Timeline_11_NewTrack_1_ABB0E704455E70C66E9A21979F9D10BE; // 0x0404 (0x0004)
	float                                                                                                Timeline_11_NewTrack_0_ABB0E704455E70C66E9A21979F9D10BE; // 0x0408 (0x0004)
	ETimelineDirection                                                                                   Timeline_11__Direction_ABB0E704455E70C66E9A21979F9D10BE; // 0x040C (0x0001)
	uint8_t                                                                                              UnknownData_40D[0x3];                              // 0x040D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_11;                                       // 0x0410 (0x0004)
	float                                                                                                Timeline_10_sizer_B74717A84E5DD929C04CAEAB4FDCCCCE; // 0x0414 (0x0004)
	ETimelineDirection                                                                                   Timeline_10__Direction_B74717A84E5DD929C04CAEAB4FDCCCCE; // 0x0418 (0x0001)
	uint8_t                                                                                              UnknownData_419[0x3];                              // 0x0419 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_10;                                       // 0x041C (0x0004)
	float                                                                                                Timeline_9_NewTrack_5_EB671039412778D781423EA0609CA999; // 0x0420 (0x0004)
	ETimelineDirection                                                                                   Timeline_9__Direction_EB671039412778D781423EA0609CA999; // 0x0424 (0x0001)
	uint8_t                                                                                              UnknownData_425[0x3];                              // 0x0425 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_9;                                        // 0x0428 (0x0004)
	float                                                                                                Timeline_8_TMAop_88BBDA7046174AC5CBC29994DBD8817F; // 0x042C (0x0004)
	float                                                                                                Timeline_8_TMAsize_88BBDA7046174AC5CBC29994DBD8817F; // 0x0430 (0x0004)
	ETimelineDirection                                                                                   Timeline_8__Direction_88BBDA7046174AC5CBC29994DBD8817F; // 0x0434 (0x0001)
	uint8_t                                                                                              UnknownData_435[0x3];                              // 0x0435 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_8;                                        // 0x0438 (0x0004)
	float                                                                                                Timeline_7_TMAop_284B2D2D482F9795EC3A85A15CD36FBC; // 0x043C (0x0004)
	float                                                                                                Timeline_7_TMAsize_284B2D2D482F9795EC3A85A15CD36FBC; // 0x0440 (0x0004)
	ETimelineDirection                                                                                   Timeline_7__Direction_284B2D2D482F9795EC3A85A15CD36FBC; // 0x0444 (0x0001)
	uint8_t                                                                                              UnknownData_445[0x3];                              // 0x0445 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_7;                                        // 0x0448 (0x0004)
	float                                                                                                Timeline_6_Selection_14F1BA454836EBA6C4AA60B6C3CFAB08; // 0x044C (0x0004)
	float                                                                                                Timeline_6_revealmove_14F1BA454836EBA6C4AA60B6C3CFAB08; // 0x0450 (0x0004)
	float                                                                                                Timeline_6_reveal_14F1BA454836EBA6C4AA60B6C3CFAB08; // 0x0454 (0x0004)
	ETimelineDirection                                                                                   Timeline_6__Direction_14F1BA454836EBA6C4AA60B6C3CFAB08; // 0x0458 (0x0001)
	uint8_t                                                                                              UnknownData_459[0x3];                              // 0x0459 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_6;                                        // 0x045C (0x0004)
	float                                                                                                Timeline_5_NewTrack_1_114F0FED4F202641E052DC910D8B5510; // 0x0460 (0x0004)
	float                                                                                                Timeline_5_MoveDown_114F0FED4F202641E052DC910D8B5510; // 0x0464 (0x0004)
	ETimelineDirection                                                                                   Timeline_5__Direction_114F0FED4F202641E052DC910D8B5510; // 0x0468 (0x0001)
	uint8_t                                                                                              UnknownData_469[0x3];                              // 0x0469 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_5;                                        // 0x046C (0x0004)
	float                                                                                                Timeline_4_NewTrack_0_84B454B948490561BC36DF883C082A78; // 0x0470 (0x0004)
	float                                                                                                Timeline_4_MoveUp_84B454B948490561BC36DF883C082A78; // 0x0474 (0x0004)
	ETimelineDirection                                                                                   Timeline_4__Direction_84B454B948490561BC36DF883C082A78; // 0x0478 (0x0001)
	uint8_t                                                                                              UnknownData_479[0x3];                              // 0x0479 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_4;                                        // 0x047C (0x0004)
	float                                                                                                Timeline_3_LowerOp_2907ADC34E2DB4308AC8BBAD3416C4E2; // 0x0480 (0x0004)
	float                                                                                                Timeline_3_SelectScale_2907ADC34E2DB4308AC8BBAD3416C4E2; // 0x0484 (0x0004)
	float                                                                                                Timeline_3_SelectFadeTrack_2907ADC34E2DB4308AC8BBAD3416C4E2; // 0x0488 (0x0004)
	ETimelineDirection                                                                                   Timeline_3__Direction_2907ADC34E2DB4308AC8BBAD3416C4E2; // 0x048C (0x0001)
	uint8_t                                                                                              UnknownData_48D[0x3];                              // 0x048D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_3;                                        // 0x0490 (0x0004)
	float                                                                                                Timeline_2_Flash1_B9D819284D23B645F0DD4AB375C523CA; // 0x0494 (0x0004)
	ETimelineDirection                                                                                   Timeline_2__Direction_B9D819284D23B645F0DD4AB375C523CA; // 0x0498 (0x0001)
	uint8_t                                                                                              UnknownData_499[0x3];                              // 0x0499 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_2;                                        // 0x049C (0x0004)
	float                                                                                                Timeline_1_Flash1_26547AAF4320D341B2E725B9A8F73E20; // 0x04A0 (0x0004)
	ETimelineDirection                                                                                   Timeline_1__Direction_26547AAF4320D341B2E725B9A8F73E20; // 0x04A4 (0x0001)
	uint8_t                                                                                              UnknownData_4A5[0x3];                              // 0x04A5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_1;                                        // 0x04A8 (0x0004)
	float                                                                                                Timeline_0_TimeOffset_6E6B0ED44383B4DC665F61BC2F514E17; // 0x04AC (0x0004)
	float                                                                                                Timeline_0_Flash1_6E6B0ED44383B4DC665F61BC2F514E17; // 0x04B0 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_6E6B0ED44383B4DC665F61BC2F514E17; // 0x04B4 (0x0001)
	uint8_t                                                                                              UnknownData_4B5[0x3];                              // 0x04B5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x04B8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      FogMID;                                            // 0x04BC (0x0004)
	class UStaticMeshComponent*                                                                          FogMesh;                                           // 0x04C0 (0x0004)
	class UStaticMeshComponent*                                                                          CloudLvl1;                                         // 0x04C4 (0x0004)
	class UStaticMeshComponent*                                                                          CloudLvl2;                                         // 0x04C8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudLvl1MID;                                      // 0x04CC (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudLvl2MID;                                      // 0x04D0 (0x0004)
	class UStaticMeshComponent*                                                                          CloudLvl1b;                                        // 0x04D4 (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudLvl1bMID;                                     // 0x04D8 (0x0004)
	bool                                                                                                 IsFading;                                          // 0x04DC (0x0001)
	uint8_t                                                                                              UnknownData_4DD[0x3];                              // 0x04DD (0x0003) MISSED OFFSET
	class UAudioComponent*                                                                               HexAudioComponent;                                 // 0x04E0 (0x0004)
	class USoundBase*                                                                                    HexMapSound;                                       // 0x04E4 (0x0004)
	float                                                                                                Delay;                                             // 0x04E8 (0x0004)
	bool                                                                                                 LightningActive;                                   // 0x04EC (0x0001)
	bool                                                                                                 Flash1done;                                        // 0x04ED (0x0001)
	bool                                                                                                 Flash2done;                                        // 0x04EE (0x0001)
	bool                                                                                                 Flash3done;                                        // 0x04EF (0x0001)
	bool                                                                                                 IsUnhidden;                                        // 0x04F0 (0x0001)
	uint8_t                                                                                              UnknownData_4F1[0x3];                              // 0x04F1 (0x0003) MISSED OFFSET
	float                                                                                                StormChance;                                       // 0x04F4 (0x0004)
	class UMaterialInstanceDynamic*                                                                      LightningMID;                                      // 0x04F8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MissionSelectedMID;                                // 0x04FC (0x0004)
	TArray<class UStaticMesh*>                                                                           Hex_Deco_Meshes;                                   // 0x0500 (0x000C)
	class UStaticMeshComponent*                                                                          HexCliffMesh;                                      // 0x050C (0x0004)
	TArray<class UStaticMesh*>                                                                           Hex_Base_Meshes;                                   // 0x0510 (0x000C)
	class UStaticMesh*                                                                                   TargetBaseMesh;                                    // 0x051C (0x0004)
	int32_t                                                                                              RandomIndex;                                       // 0x0520 (0x0004)
	FName                                                                                                SpawnLight;                                        // 0x0524 (0x0008)
	FName                                                                                                DieBolt;                                           // 0x052C (0x0008)
	FName                                                                                                DieBolt2;                                          // 0x0534 (0x0008)
	FName                                                                                                DieBolt_01;                                        // 0x053C (0x0008)
	FName                                                                                                SpawnLight_01;                                     // 0x0544 (0x0008)
	class USoundBase*                                                                                    LightningSound;                                    // 0x054C (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexDecoMID;                                        // 0x0550 (0x0004)
	class UStaticMeshComponent*                                                                          HexDecoMesh;                                       // 0x0554 (0x0004)
	bool                                                                                                 MouseOver;                                         // 0x0558 (0x0001)
	uint8_t                                                                                              UnknownData_559[0x3];                              // 0x0559 (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      MissionPingMID;                                    // 0x055C (0x0004)
	bool                                                                                                 MissionSelected;                                   // 0x0560 (0x0001)
	bool                                                                                                 TileIsPlayable;                                    // 0x0561 (0x0001)
	uint8_t                                                                                              UnknownData_562[0x2];                              // 0x0562 (0x0002) MISSED OFFSET
	TArray<class UStaticMesh*>                                                                           GreyHexDecoMeshes;                                 // 0x0564 (0x000C)
	class UStaticMeshComponent*                                                                          GreyHexDecoMesh;                                   // 0x0570 (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID;                                        // 0x0574 (0x0004)
	FLinearColor                                                                                         ThreatLevelLightColor;                             // 0x0578 (0x0010)
	bool                                                                                                 IsQuickplayMission;                                // 0x0588 (0x0001)
	bool                                                                                                 InitialRevealDelay;                                // 0x0589 (0x0001)
	bool                                                                                                 dummy;                                             // 0x058A (0x0001)
	uint8_t                                                                                              UnknownData_58B[0x1];                              // 0x058B (0x0001) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      MissionMarkerMID;                                  // 0x058C (0x0004)
	bool                                                                                                 Focused;                                           // 0x0590 (0x0001)
	uint8_t                                                                                              UnknownData_591[0x3];                              // 0x0591 (0x0003) MISSED OFFSET
	FLinearColor                                                                                         ThreatLevelColor;                                  // 0x0594 (0x0010)
	FLinearColor                                                                                         ThreatLevelColor2;                                 // 0x05A4 (0x0010)
	FLinearColor                                                                                         SelectedLocationHolderOld;                         // 0x05B4 (0x0010)
	FLinearColor                                                                                         SelectedLocationHolderNew;                         // 0x05C4 (0x0010)
	class UMaterialInstanceDynamic*                                                                      HexBaseFalloffMID;                                 // 0x05D4 (0x0004)
	bool                                                                                                 TileIsLocked;                                      // 0x05D8 (0x0001)
	bool                                                                                                 TileIsHidden;                                      // 0x05D9 (0x0001)
	bool                                                                                                 IsOutpost;                                         // 0x05DA (0x0001)
	uint8_t                                                                                              UnknownData_5DB[0x1];                              // 0x05DB (0x0001) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      CloudSmallMID;                                     // 0x05DC (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudLargeMID;                                     // 0x05E0 (0x0004)
	bool                                                                                                 TileIsVaildMission;                                // 0x05E4 (0x0001)
	uint8_t                                                                                              UnknownData_5E5[0x3];                              // 0x05E5 (0x0003) MISSED OFFSET
	int32_t                                                                                              DEBUGRandomNumber;                                 // 0x05E8 (0x0004)
	bool                                                                                                 DEBUG_RandomMissionGenerator;                      // 0x05EC (0x0001)
	uint8_t                                                                                              UnknownData_5ED[0x3];                              // 0x05ED (0x0003) MISSED OFFSET
	TArray<class UMaterialInstanceDynamic*>                                                              HexDecoMaterials;                                  // 0x05F0 (0x000C)
	FLinearColor                                                                                         WorldLocAsColor;                                   // 0x05FC (0x0010)
	bool                                                                                                 IsThreat1;                                         // 0x060C (0x0001)
	bool                                                                                                 IsThreat2;                                         // 0x060D (0x0001)
	bool                                                                                                 IsThreat3;                                         // 0x060E (0x0001)
	bool                                                                                                 IsThreat4;                                         // 0x060F (0x0001)
	bool                                                                                                 IsThreat5;                                         // 0x0610 (0x0001)
	uint8_t                                                                                              UnknownData_611[0x3];                              // 0x0611 (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      MIDMissionIcon;                                    // 0x0614 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MIDZoneMarker;                                     // 0x0618 (0x0004)
	bool                                                                                                 DEBUGTileStates_;                                  // 0x061C (0x0001)
	uint8_t                                                                                              UnknownData_61D[0x3];                              // 0x061D (0x0003) MISSED OFFSET
	TArray<class UMaterialInstanceDynamic*>                                                              MIDForAdjacency;                                   // 0x0620 (0x000C)
	bool                                                                                                 DEBUGBlending;                                     // 0x062C (0x0001)
	uint8_t                                                                                              UnknownData_62D[0x3];                              // 0x062D (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_0;                                      // 0x0630 (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_01;                                     // 0x0634 (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_02;                                     // 0x0638 (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_03;                                     // 0x063C (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_04;                                     // 0x0640 (0x0004)
	class UMaterialInstanceDynamic*                                                                      HexBaseMID_05;                                     // 0x0644 (0x0004)
	class UTexture2D*                                                                                    Type1Texture;                                      // 0x0648 (0x0004)
	class UTexture2D*                                                                                    Type2Texture;                                      // 0x064C (0x0004)
	class UTexture2D*                                                                                    Type3Texture;                                      // 0x0650 (0x0004)
	class UTexture2D*                                                                                    Type4Texture;                                      // 0x0654 (0x0004)
	class UTexture2D*                                                                                    Type5Texture;                                      // 0x0658 (0x0004)
	class UTexture2D*                                                                                    Type6Texture;                                      // 0x065C (0x0004)
	class UTexture2D*                                                                                    TextureN;                                          // 0x0660 (0x0004)
	class UTexture2D*                                                                                    TextureNE;                                         // 0x0664 (0x0004)
	class UTexture2D*                                                                                    TextureSE;                                         // 0x0668 (0x0004)
	class UTexture2D*                                                                                    Textures;                                          // 0x066C (0x0004)
	class UTexture2D*                                                                                    TextureSW;                                         // 0x0670 (0x0004)
	class UTexture2D*                                                                                    TextureNW;                                         // 0x0674 (0x0004)
	class UTexture2D*                                                                                    TileTypeBaseTexture;                               // 0x0678 (0x0004)
	bool                                                                                                 DEBUGTurnOffLightning;                             // 0x067C (0x0001)
	uint8_t                                                                                              UnknownData_67D[0x3];                              // 0x067D (0x0003) MISSED OFFSET
	class UTexture2D*                                                                                    TypeDEBUGTexture;                                  // 0x0680 (0x0004)
	float                                                                                                SameRegionNorth;                                   // 0x0684 (0x0004)
	float                                                                                                SameRegionNorthEast;                               // 0x0688 (0x0004)
	float                                                                                                SameRegionSouthEast;                               // 0x068C (0x0004)
	float                                                                                                SameRegionSouth;                                   // 0x0690 (0x0004)
	float                                                                                                SameRegionSouthWest;                               // 0x0694 (0x0004)
	float                                                                                                SameRegionNorthWest;                               // 0x0698 (0x0004)
	float                                                                                                TileIsHidden_North;                                // 0x069C (0x0004)
	float                                                                                                TileIsHidden_NorthEast;                            // 0x06A0 (0x0004)
	float                                                                                                TileIsHidden_SouthEast;                            // 0x06A4 (0x0004)
	float                                                                                                TileIsHidden_South;                                // 0x06A8 (0x0004)
	float                                                                                                TileIsHidden_SouthWest;                            // 0x06AC (0x0004)
	float                                                                                                TileIsHidden_NorthWest;                            // 0x06B0 (0x0004)
	bool                                                                                                 TileIsOnOuterEdge;                                 // 0x06B4 (0x0001)
	uint8_t                                                                                              UnknownData_6B5[0x3];                              // 0x06B5 (0x0003) MISSED OFFSET
	float                                                                                                TileExistsNorth;                                   // 0x06B8 (0x0004)
	float                                                                                                TileExistsNorthEast;                               // 0x06BC (0x0004)
	float                                                                                                TileExistsSouthEast;                               // 0x06C0 (0x0004)
	float                                                                                                TileExistsSouth;                                   // 0x06C4 (0x0004)
	float                                                                                                TileExistsSouthWest;                               // 0x06C8 (0x0004)
	float                                                                                                TileExistsNorthWest;                               // 0x06CC (0x0004)
	FVector                                                                                              TooltipWidgetLoc;                                  // 0x06D0 (0x000C)
	FVector                                                                                              MissionIconDefaultLoc;                             // 0x06DC (0x000C)
	class UMaterialInstanceDynamic*                                                                      MID_Mouseover;                                     // 0x06E8 (0x0004)
public:
	void GetBaseTextureForType(float TypeId, class UTexture2D* BaseTexture); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:GetBaseTextureForType
	void GroundSliceSettings(class UMaterialInstanceDynamic* SourceMaterial, class UTexture2D* TileTypeA, class UTexture2D* TileTypeB, float TileIsSameRegionA, float TileIsSameRegionB, float TileIsHiddenA, float TileIsHiddenB, float TileExistsA, float TileExistsB); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:GroundSliceSettings
	void SetDirectionalTextures(class UMaterialInstanceDynamic* SourceMaterial, class UTextRenderComponent* DebugTextDirection, FName TileExistsParamName, class UTexture2D* TileExistsTexture); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:SetDirectionalTextures
	void UserConstructionScript(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_0__UpdateFunc
	void Timeline_1__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_1__FinishedFunc
	void Timeline_1__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_1__UpdateFunc
	void Timeline_2__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_2__FinishedFunc
	void Timeline_2__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_2__UpdateFunc
	void Timeline_3__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_3__FinishedFunc
	void Timeline_3__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_3__UpdateFunc
	void Timeline_4__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_4__FinishedFunc
	void Timeline_4__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_4__UpdateFunc
	void Timeline_5__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_5__FinishedFunc
	void Timeline_5__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_5__UpdateFunc
	void Timeline_6__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_6__FinishedFunc
	void Timeline_6__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_6__UpdateFunc
	void Timeline_7__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_7__FinishedFunc
	void Timeline_7__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_7__UpdateFunc
	void Timeline_8__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_8__FinishedFunc
	void Timeline_8__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_8__UpdateFunc
	void Timeline_9__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_9__FinishedFunc
	void Timeline_9__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_9__UpdateFunc
	void Timeline_10__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_10__FinishedFunc
	void Timeline_10__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_10__UpdateFunc
	void Timeline_11__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_11__FinishedFunc
	void Timeline_11__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_11__UpdateFunc
	void Timeline_12__FinishedFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_12__FinishedFunc
	void Timeline_12__UpdateFunc(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:Timeline_12__UpdateFunc
	void OnClientSelect(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnClientSelect
	void OnClientDeselect(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnClientDeselect
	void OnHostSelect(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnHostSelect
	void OnHostDeselect(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnHostDeselect
	void OnFocus(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnFocus
	void OnDefocus(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnDefocus
	void OnParticleSpawnLight(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnParticleSpawnLight
	void OnParticleDieBolt(FName EventName, float EmitterTime, int32_t ParticleTime, FVector Location, FVector Velocity, FVector Direction); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnParticleDieBolt
	void OnParticleDieBolt2(FName EventName, float EmitterTime, int32_t ParticleTime, FVector Location, FVector Velocity, FVector Direction); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnParticleDieBolt2
	void OnParticleSpawnLight_01(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnParticleSpawnLight_01
	void OnParticleDieBolt_01(FName EventName, float EmitterTime, int32_t ParticleTime, FVector Location, FVector Velocity, FVector Direction); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnParticleDieBolt_01
	void OnMissionDataUpdated(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnMissionDataUpdated
	void PlayPing(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:PlayPing
	void ForceDefocus(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:ForceDefocus
	void CheckFocus(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:CheckFocus
	void InitializeTheater(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:InitializeTheater
	void FireLightningA(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:FireLightningA
	void DeactivateTheater(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:DeactivateTheater
	void HandleTeamPowerChanged(int32_t TeamPower, int32_t PersonalPower); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:HandleTeamPowerChanged
	void OnInitializeTile(); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:OnInitializeTile
	void ExecuteUbergraph_BP_Hex_PARENT(int32_t EntryPoint); // Function /Game/World/BP_Hex_PARENT.BP_Hex_PARENT_C:ExecuteUbergraph_BP_Hex_PARENT
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/World/BP_Hex_PARENT.PLACEHOLDER-CLASS__MissionTooltip_C_134
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__MissionTooltip_C_134
{
public:
	static class UClass* StaticClass();
};

