#pragma once
#include "FN_Basic.h"

#include "FN_B_SupplyDropPlacement_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_SupplyDropPlacement
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C
// 0x017C (0x0604)
class AB_SupplyDropPlacement_C : public ABuildingGameplayActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0488 (0x0004)
	class UParticleSystemComponent*                                                                      P_Reticle;                                         // 0x048C (0x0004)
	class UParticleSystemComponent*                                                                      P_SupplydropCrate_Explosion;                       // 0x0490 (0x0004)
	class UAudioComponent*                                                                               SupplyDropBeep;                                    // 0x0494 (0x0004)
	class UBoxComponent*                                                                                 Collision;                                         // 0x0498 (0x0004)
	class UAudioComponent*                                                                               NewIncoming;                                       // 0x049C (0x0004)
	class UStaticMeshComponent*                                                                          SupplyDrop_Mesh_Open;                              // 0x04A0 (0x0004)
	class UParticleSystemComponent*                                                                      Trail;                                             // 0x04A4 (0x0004)
	class UStaticMeshComponent*                                                                          SupplyDrop_Mesh;                                   // 0x04A8 (0x0004)
	class USceneComponent*                                                                               Scene;                                             // 0x04AC (0x0004)
	class UFortMiniMapComponent*                                                                         FortMiniMap1;                                      // 0x04B0 (0x0004)
	float                                                                                                Timeline_0_NewTrack_1_13B1F8394A7D09AEA84108B19C118F02; // 0x04B4 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_13B1F8394A7D09AEA84108B19C118F02; // 0x04B8 (0x0001)
	uint8_t                                                                                              UnknownData_4B9[0x3];                              // 0x04B9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x04BC (0x0004)
	int32_t                                                                                              UpgradeLevel;                                      // 0x04C0 (0x0004)
	bool                                                                                                 Allow_SupplyDrop_Interact;                         // 0x04C4 (0x0001)
	uint8_t                                                                                              UnknownData_4C5[0x3];                              // 0x04C5 (0x0003) MISSED OFFSET
	FVector                                                                                              ImpactLocation;                                    // 0x04C8 (0x000C)
	TArray<EObjectTypeQuery>                                                                             TraceObjects;                                      // 0x04D4 (0x000C)
	int32_t                                                                                              Active_RandomResourcePulls;                        // 0x04E0 (0x0004)
	int32_t                                                                                              Active_ResourceAmount;                             // 0x04E4 (0x0004)
	class UFortWorldItemDefinition*                                                                      Lv1_LootItem1;                                     // 0x04E8 (0x0004)
	int32_t                                                                                              Lvl0_ResourceAmount;                               // 0x04EC (0x0004)
	int32_t                                                                                              Lvl1_ResourceAmount;                               // 0x04F0 (0x0004)
	int32_t                                                                                              Lvl2_ResourceAmount;                               // 0x04F4 (0x0004)
	int32_t                                                                                              Lvl3_ResourceAmount;                               // 0x04F8 (0x0004)
	int32_t                                                                                              Lvl4_ResourceAmount;                               // 0x04FC (0x0004)
	int32_t                                                                                              Lvl5_ResourceAmount;                               // 0x0500 (0x0004)
	float                                                                                                Lv1_LootItem1_Amount;                              // 0x0504 (0x0004)
	class UFortWorldItemDefinition*                                                                      Lv1_LootItem2;                                     // 0x0508 (0x0004)
	float                                                                                                Lv1_LootItem2_Amount;                              // 0x050C (0x0004)
	class UFortWorldItemDefinition*                                                                      Lv1_LootItem3;                                     // 0x0510 (0x0004)
	float                                                                                                Lv1_LootItem3_Amount;                              // 0x0514 (0x0004)
	float                                                                                                Lv2_LootItem1_Amount;                              // 0x0518 (0x0004)
	float                                                                                                Lv2_LootItem2_Amount;                              // 0x051C (0x0004)
	float                                                                                                Lv2_LootItem3_Amount;                              // 0x0520 (0x0004)
	float                                                                                                Lv3_LootItem1_amount;                              // 0x0524 (0x0004)
	float                                                                                                Lv3_LootItem2_Amount;                              // 0x0528 (0x0004)
	float                                                                                                Lv3_LootItem3_Amount;                              // 0x052C (0x0004)
	float                                                                                                Lv4_LootItem1_Amount;                              // 0x0530 (0x0004)
	float                                                                                                Lv4_LootItem2_Amount;                              // 0x0534 (0x0004)
	float                                                                                                Lv4_LootItem3_Amount;                              // 0x0538 (0x0004)
	float                                                                                                Lv5_LootItem1_Amount;                              // 0x053C (0x0004)
	float                                                                                                Lv5_LootItem2_Amount;                              // 0x0540 (0x0004)
	float                                                                                                Lv5_LootItem3_Amount;                              // 0x0544 (0x0004)
	float                                                                                                SupplyDropDelay;                                   // 0x0548 (0x0004)
	class USoundBase*                                                                                    Activate_Sound;                                    // 0x054C (0x0004)
	class USoundBase*                                                                                    Impact_Sound;                                      // 0x0550 (0x0004)
	class USoundBase*                                                                                    Loot_Sound;                                        // 0x0554 (0x0004)
	FFortFeedbackHandle                                                                                  SupplyDrop_Feedback_Start;                         // 0x0558 (0x0010)
	float                                                                                                LootAbilityMultiplier;                             // 0x0568 (0x0004)
	bool                                                                                                 bIsLooted;                                         // 0x056C (0x0001)
	uint8_t                                                                                              UnknownData_56D[0x3];                              // 0x056D (0x0003) MISSED OFFSET
	FGameplayTag                                                                                         EventHit;                                          // 0x0570 (0x0008)
	FGameplayEventData                                                                                   EventData;                                         // 0x0578 (0x0058)
	bool                                                                                                 CollisionOn;                                       // 0x05D0 (0x0001)
	uint8_t                                                                                              UnknownData_5D1[0x3];                              // 0x05D1 (0x0003) MISSED OFFSET
	float                                                                                                DelayForSelfDestruct;                              // 0x05D4 (0x0004)
	FVector                                                                                              LootSpawnOffset;                                   // 0x05D8 (0x000C)
	int32_t                                                                                              Lvl0_RandomResourcePulls;                          // 0x05E4 (0x0004)
	int32_t                                                                                              Lvl1_RandomResourcePulls;                          // 0x05E8 (0x0004)
	int32_t                                                                                              Lvl2_RandomResourcePulls;                          // 0x05EC (0x0004)
	int32_t                                                                                              Lvl3_RandomResourcePulls;                          // 0x05F0 (0x0004)
	int32_t                                                                                              Lvl4_RandomResourcePulls;                          // 0x05F4 (0x0004)
	int32_t                                                                                              Lvl5_RandomResourcePulls;                          // 0x05F8 (0x0004)
	float                                                                                                Chance1_RandomIngredient;                          // 0x05FC (0x0004)
	float                                                                                                Chance2_RandomTrap;                                // 0x0600 (0x0004)
public:
	void Landed(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:Landed
	void OnRep_bIsLooted(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:OnRep_bIsLooted
	bool IsAcceptablePositionForPlacement(FVector InLocation, FRotator InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, FText OutFailureReason) const; // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:IsAcceptablePositionForPlacement
	void SetMatOnLevel(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:SetMatOnLevel
	void UpdateLocation(float Time); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:UpdateLocation
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn) const; // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:BlueprintCanInteract
	void TurnOnInteract(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:TurnOnInteract
	void SpawnLoot(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:SpawnLoot
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:Timeline_0__UpdateFunc
	void Timeline_0__StartTrail__EventFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:Timeline_0__StartTrail__EventFunc
	void Timeline_0__Impact__EventFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:Timeline_0__Impact__EventFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:ReceiveBeginPlay
	void BlueprintOnInteract(class AFortPawn* InteractingPawn); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:BlueprintOnInteract
	void SelfDestruct(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:SelfDestruct
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:OnDeathServer
	void ExecuteUbergraph_B_SupplyDropPlacement(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/B_SupplyDropPlacement.B_SupplyDropPlacement_C:ExecuteUbergraph_B_SupplyDropPlacement
public:
	static class UClass* StaticClass();
};

