#pragma once
#include "FN_Basic.h"

#include "FN_B_Post_Explosion_PlasmaBomb_parameters.h"
#include "FN_B_Post_Explosion_Generic_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Post_Explosion_PlasmaBomb
*/

// BlueprintGeneratedClass /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C
// 0x0010 (0x05FC)
class AB_Post_Explosion_PlasmaBomb_C : public AB_Post_Explosion_Generic_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x05EC (0x0004)
	float                                                                                                Timeline_0_BlendWeight_64EA2F03409D67812CF4F287A76739D4; // 0x05F0 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_64EA2F03409D67812CF4F287A76739D4; // 0x05F4 (0x0001)
	uint8_t                                                                                              UnknownData_5F5[0x3];                              // 0x05F5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x05F8 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C:Timeline_0__UpdateFunc
	void SpawnPostFX(float PostFX_BoxScaleDyn, FVector PostFX_CamShakeLoc, bool PostFX_UseCamShake, float PostFX_DeactivateDelay); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C:SpawnPostFX
	void ExecuteUbergraph_B_Post_Explosion_PlasmaBomb(int32_t EntryPoint); // Function /Game/Effects/Fort_Effects/BluePrints/PostProcessFX/B_Post_Explosion_PlasmaBomb.B_Post_Explosion_PlasmaBomb_C:ExecuteUbergraph_B_Post_Explosion_PlasmaBomb
public:
	static class UClass* StaticClass();
};

