#pragma once
#include "FN_Basic.h"

#include "FN_B_Ranged_Generic_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_En_ShellTypes_01_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Ranged_Generic
*/

// BlueprintGeneratedClass /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C
// 0x010C (0x0774)
class AB_Ranged_Generic_C : public AFortWeaponRanged
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0668 (0x0004)
	class UPostProcessComponent*                                                                         SecondDownScopePostProcess;                        // 0x066C (0x0004)
	class UParticleSystemComponent*                                                                      ShellsOnReload_empty_;                             // 0x0670 (0x0004)
	class UParticleSystemComponent*                                                                      Shells_empty_;                                     // 0x0674 (0x0004)
	class UPostProcessComponent*                                                                         DownScopePostProcess;                              // 0x0678 (0x0004)
	class UStaticMeshComponent*                                                                          ScopeMesh1P;                                       // 0x067C (0x0004)
	class UParticleSystemComponent*                                                                      MuzzlePSC;                                         // 0x0680 (0x0004)
	float                                                                                                AnimateScopePostProcess_DownSightPostProcessAmount_393D8BA5486879173797EF8C9B8D4642; // 0x0684 (0x0004)
	ETimelineDirection                                                                                   AnimateScopePostProcess__Direction_393D8BA5486879173797EF8C9B8D4642; // 0x0688 (0x0001)
	uint8_t                                                                                              UnknownData_689[0x3];                              // 0x0689 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            AnimateScopePostProcess;                           // 0x068C (0x0004)
	class UParticleSystem*                                                                               MuzzleParticleSystem;                              // 0x0690 (0x0004)
	class UParticleSystem*                                                                               Beam_ParticleSystem;                               // 0x0694 (0x0004)
	class UParticleSystemComponent*                                                                      Beam_PSC;                                          // 0x0698 (0x0004)
	bool                                                                                                 Use_Beam_Particles;                                // 0x069C (0x0001)
	uint8_t                                                                                              UnknownData_69D[0x3];                              // 0x069D (0x0003) MISSED OFFSET
	FName                                                                                                BeamSource_SocketName;                             // 0x06A0 (0x0008)
	bool                                                                                                 Use_Reload_Particles;                              // 0x06A8 (0x0001)
	uint8_t                                                                                              UnknownData_6A9[0x3];                              // 0x06A9 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               Reload_ParticleSystem;                             // 0x06AC (0x0004)
	class UParticleSystemComponent*                                                                      Reload_PSC;                                        // 0x06B0 (0x0004)
	float                                                                                                ReloadSmokeTileMin;                                // 0x06B4 (0x0004)
	float                                                                                                ReloadSmokeTileMax;                                // 0x06B8 (0x0004)
	class UParticleSystemComponent*                                                                      Ambient_Particle_System;                           // 0x06BC (0x0004)
	class UParticleSystem*                                                                               Ambient_Particle_Template;                         // 0x06C0 (0x0004)
	float                                                                                                LastPlayFXTime;                                    // 0x06C4 (0x0004)
	float                                                                                                MinPlayFXTime;                                     // 0x06C8 (0x0004)
	bool                                                                                                 UsePersistentBeam;                                 // 0x06CC (0x0001)
	uint8_t                                                                                              UnknownData_6CD[0x3];                              // 0x06CD (0x0003) MISSED OFFSET
	class UParticleSystemComponent*                                                                      Reload_Smoke;                                      // 0x06D0 (0x0004)
	bool                                                                                                 UseShellsOnFire_;                                  // 0x06D4 (0x0001)
	uint8_t                                                                                              UnknownData_6D5[0x3];                              // 0x06D5 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               ShellsOnFire_ParticleSystem;                       // 0x06D8 (0x0004)
	FName                                                                                                ReloadSocketName;                                  // 0x06DC (0x0008)
	bool                                                                                                 UseScopeTargeting;                                 // 0x06E4 (0x0001)
	uint8_t                                                                                              UnknownData_6E5[0x3];                              // 0x06E5 (0x0003) MISSED OFFSET
	FVector                                                                                              ScopeTargetingMuzzleOffset;                        // 0x06E8 (0x000C)
	TArray<class AFortAIPawn*>                                                                           Array_Of_Active_Enemy_AI;                          // 0x06F4 (0x000C)
	bool                                                                                                 Scope___Render_Enemies_To_Custom_Depth_Buffer;     // 0x0700 (0x0001)
	uint8_t                                                                                              UnknownData_701[0x3];                              // 0x0701 (0x0003) MISSED OFFSET
	FName                                                                                                Shells_Socket_Name;                                // 0x0704 (0x0008)
	bool                                                                                                 UseShellsOnReload_;                                // 0x070C (0x0001)
	En_ShellTypes_01                                                                                     ShellTypeSelect;                                   // 0x070D (0x0001)
	uint8_t                                                                                              UnknownData_70E[0x2];                              // 0x070E (0x0002) MISSED OFFSET
	float                                                                                                Shells_Spawn_Rate_Scale;                           // 0x0710 (0x0004)
	FVector                                                                                              ShellsRotationRate;                                // 0x0714 (0x000C)
	FVector                                                                                              Shells_Velocity;                                   // 0x0720 (0x000C)
	FVector                                                                                              Shells_Gravity;                                    // 0x072C (0x000C)
	float                                                                                                Shells_Lifetime;                                   // 0x0738 (0x0004)
	FVector                                                                                              Shells_Size;                                       // 0x073C (0x000C)
	float                                                                                                Shells_Time_Dilation;                              // 0x0748 (0x0004)
	float                                                                                                Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x074C (0x0004)
	float                                                                                                Scope_Camera_Offset_Amount;                        // 0x0750 (0x0004)
	bool                                                                                                 UseSmallShells_;                                   // 0x0754 (0x0001)
	bool                                                                                                 UseMediumShells_;                                  // 0x0755 (0x0001)
	bool                                                                                                 UseLargeShells_;                                   // 0x0756 (0x0001)
	bool                                                                                                 UseShotgunShells_;                                 // 0x0757 (0x0001)
	bool                                                                                                 UseEnergyShells_;                                  // 0x0758 (0x0001)
	uint8_t                                                                                              UnknownData_759[0x3];                              // 0x0759 (0x0003) MISSED OFFSET
	int32_t                                                                                              ShellReloadCounter;                                // 0x075C (0x0004)
	float                                                                                                Inherit_Parent_Velocity;                           // 0x0760 (0x0004)
	float                                                                                                Cylindrical_Radius;                                // 0x0764 (0x0004)
	bool                                                                                                 DebugShellsSocket_;                                // 0x0768 (0x0001)
	bool                                                                                                 Use_2_Post_Processes_For_the_Scope;                // 0x0769 (0x0001)
	uint8_t                                                                                              UnknownData_76A[0x2];                              // 0x076A (0x0002) MISSED OFFSET
	class USoundBase*                                                                                    Sound_ScopeZoomIn;                                 // 0x076C (0x0004)
	class USoundBase*                                                                                    Sound_ScopeZoomOut;                                // 0x0770 (0x0004)
public:
	void IsUsingFirstPersonCamera(bool UsingFirstPerson); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:IsUsingFirstPersonCamera
	void Shell_FX_On_Fire_Update(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:Shell FX On Fire Update
	void IsUsingScope(bool UsingScope); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:IsUsingScope
	FVector GetMuzzleLocation() const; // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:GetMuzzleLocation
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:Muzzle Play Reload FX
	void Muzzle_Flash_FX(bool Condition); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:Muzzle Flash FX
	void SetWpnRarity(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:SetWpnRarity
	void AddRandomScale(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:AddRandomScale
	void UserConstructionScript(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:UserConstructionScript
	void AnimateScopePostProcess__FinishedFunc(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:AnimateScopePostProcess__FinishedFunc
	void AnimateScopePostProcess__UpdateFunc(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:AnimateScopePostProcess__UpdateFunc
	void OnPlayWeaponFireFX(bool bPersistentFire); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnPlayWeaponFireFX
	void OnStopWeaponFireFX(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnStopWeaponFireFX
	void GameplayCue_Impact(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:GameplayCue.Impact
	void OnPlayReloadFX(EFortReloadFXState ReloadStage); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnPlayReloadFX
	void ShellsON__onFire_(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:ShellsON_(onFire)
	void ShellsOFF__onFire_(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:ShellsOFF_(onFire)
	void OnSetTargeting(bool bNewIsTargeting); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnSetTargeting
	void K2_OnUnEquip(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:K2_OnUnEquip
	void InitializeScopeVariables(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:InitializeScopeVariables
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32_t StencilBufferValue); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:Update Enemy Custom Depths
	void OnPlayImpactFX(FHitResult HitResult, EPhysicalSurface ImpactPhysicalSurface, class UParticleSystemComponent* SpawnedPSC); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnPlayImpactFX
	void OnAmmoCountChanged(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnAmmoCountChanged
	void OnWeaponAttached(); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnWeaponAttached
	void OnInitAlteration(class UFortAlterationItemDefinition* NewAlteration); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnInitAlteration
	void OnInitCosmeticAlterations(FFortCosmeticModification CosmeticMod, class UMaterialInstanceDynamic* DynamicMaterialInstance); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:OnInitCosmeticAlterations
	void ExecuteUbergraph_B_Ranged_Generic(int32_t EntryPoint); // Function /Game/Weapons/Blueprints/B_Ranged_Generic.B_Ranged_Generic_C:ExecuteUbergraph_B_Ranged_Generic
public:
	static class UClass* StaticClass();
};

