#pragma once
#include "FN_Basic.h"

#include "FN_B_Placement_Teleporter_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Placement_Teleporter
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C
// 0x0010 (0x036C)
class AB_Placement_Teleporter_C : public AFortDecoPreview
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x035C (0x0004)
	class UAudioComponent*                                                                               Placement_Audio;                                   // 0x0360 (0x0004)
	class UBoxComponent*                                                                                 Box1;                                              // 0x0364 (0x0004)
	class UParticleSystemComponent*                                                                      Good;                                              // 0x0368 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:UserConstructionScript
	void OnBounceMotionUpdate(float VectorScale); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:OnBounceMotionUpdate
	void OnInitializeDecoPreview(class ABuildingActor* NewBuildingActor, class UFortDecoItemDefinition* NewDecoItemDefinition); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:OnInitializeDecoPreview
	void OnUpdateScale(float Scale, FVector InWorldSpacePivot); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:OnUpdateScale
	void OnUpdateVisuals(float DeltaSeconds, bool bSafeToPlace); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:OnUpdateVisuals
	void SetScalarParameterValueOnAllPreviewMIDs(FName ParamName, float ParamValue); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:SetScalarParameterValueOnAllPreviewMIDs
	void SetVectorParameterValueOnAllPreviewMIDs(FName ParamName, FLinearColor ParamValue); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:SetVectorParameterValueOnAllPreviewMIDs
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:ReceiveBeginPlay
	void ExecuteUbergraph_B_Placement_Teleporter(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/B_Placement_Teleporter.B_Placement_Teleporter_C:ExecuteUbergraph_B_Placement_Teleporter
public:
	static class UClass* StaticClass();
};

