#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_BotTurret_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_BotTurret
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C
// 0x0120 (0x0538)
class AB_Prj_BotTurret_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      P_BotTurret_ProjectileRings_01;                    // 0x041C (0x0004)
	class UPointLightComponent*                                                                          Projectile_Light;                                  // 0x0420 (0x0004)
	class UBoxComponent*                                                                                 ImpactSpawnLocation;                               // 0x0424 (0x0004)
	class UStaticMeshComponent*                                                                          Projectile_Mesh;                                   // 0x0428 (0x0004)
	class UParticleSystemComponent*                                                                      Ribbon_Trail_PSC;                                  // 0x042C (0x0004)
	class UParticleSystemComponent*                                                                      Water_Explosion_PSC;                               // 0x0430 (0x0004)
	class UParticleSystem*                                                                               Ribbon_Trail_PS;                                   // 0x0434 (0x0004)
	class UParticleSystem*                                                                               Water_Explosion_PS;                                // 0x0438 (0x0004)
	class UParticleSystem*                                                                               Explosion_Generic_PS;                              // 0x043C (0x0004)
	class UParticleSystemComponent*                                                                      Explosion_Generic_PSC;                             // 0x0440 (0x0004)
	class USoundBase*                                                                                    Explosion_Generic_Sound;                           // 0x0444 (0x0004)
	FVector                                                                                              StopLocation;                                      // 0x0448 (0x000C)
	TArray<EObjectTypeQuery>                                                                             ObjectsToTraceAgainst;                             // 0x0454 (0x000C)
	class UParticleSystem*                                                                               Explosion_Flesh_Damage_PS;                         // 0x0460 (0x0004)
	FRotator                                                                                             StopRotX;                                          // 0x0464 (0x000C)
	float                                                                                                TrailLifetime;                                     // 0x0470 (0x0004)
	class UParticleSystemComponent*                                                                      Explosion_Flesh_Damage_PSC;                        // 0x0474 (0x0004)
	int32_t                                                                                              NumberOfBounces;                                   // 0x0478 (0x0004)
	class UClass*                                                                                        LaserDamage;                                       // 0x047C (0x0004)
	bool                                                                                                 ShouldBounce;                                      // 0x0480 (0x0001)
	uint8_t                                                                                              UnknownData_481[0x3];                              // 0x0481 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               Impact_Effect;                                     // 0x0484 (0x0004)
	int32_t                                                                                              MaxBounces;                                        // 0x0488 (0x0004)
	bool                                                                                                 Bounce;                                            // 0x048C (0x0001)
	uint8_t                                                                                              UnknownData_48D[0x3];                              // 0x048D (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      Projectile_MID__0;                                 // 0x0490 (0x0004)
	FLinearColor                                                                                         Projectile_Inner_Color_A__Friendly_;               // 0x0494 (0x0010)
	FLinearColor                                                                                         Projectile_Inner_Color_A__Enemy_;                  // 0x04A4 (0x0010)
	FLinearColor                                                                                         Projectile_Inner_Color_B__Friendly_;               // 0x04B4 (0x0010)
	FLinearColor                                                                                         Projectile_Inner_Color_B__Enemy_;                  // 0x04C4 (0x0010)
	FLinearColor                                                                                         Projectile_Highlight_Color__Friendly_;             // 0x04D4 (0x0010)
	FLinearColor                                                                                         Projectile_Highlight_Color__Enemy_;                // 0x04E4 (0x0010)
	FLinearColor                                                                                         Light_Color__Enemy_;                               // 0x04F4 (0x0010)
	FVector                                                                                              Start_Position;                                    // 0x0504 (0x000C)
	class AFortPawn*                                                                                     Pawn_Hit;                                          // 0x0510 (0x0004)
	FVector                                                                                              End_Position;                                      // 0x0514 (0x000C)
	class UParticleSystem*                                                                               Impact_Effect__Enemy_;                             // 0x0520 (0x0004)
	FLinearColor                                                                                         Light_Color__Friendly_;                            // 0x0524 (0x0010)
	class AFortPlayerState*                                                                              PlayerState;                                       // 0x0534 (0x0004)
public:
	void SetTeamColorVFX(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:SetTeamColorVFX
	void OnRep_Bounce(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:OnRep_Bounce
	void OnRep_ShouldBounce(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:OnRep_ShouldBounce
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:ReceiveBeginPlay
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:ReceiveHit
	void ReceiveActorBeginOverlap(class AActor* OtherActor); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:ReceiveActorBeginOverlap
	void HitStaticMesh(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:HitStaticMesh
	void Hit_Pawn(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:Hit Pawn
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:OnExploded
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:OnBounce
	void ExecuteUbergraph_B_Prj_BotTurret(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_Prj_BotTurret.B_Prj_BotTurret_C:ExecuteUbergraph_B_Prj_BotTurret
public:
	static class UClass* StaticClass();
};

