#pragma once
#include "FN_Basic.h"

#include "FN_B_FDP_SentryGun_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_FDP_SentryGun
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/SentryGun/B_FDP_SentryGun.B_FDP_SentryGun_C
// 0x0014 (0x0370)
class AB_FDP_SentryGun_C : public AFortDecoPreview
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x035C (0x0004)
	class UStaticMeshComponent*                                                                          AmmoMesh;                                          // 0x0360 (0x0004)
	class UStaticMeshComponent*                                                                          Gun;                                               // 0x0364 (0x0004)
	class UStaticMeshComponent*                                                                          Base;                                              // 0x0368 (0x0004)
	class UCapsuleComponent*                                                                             CollisionCapsule;                                  // 0x036C (0x0004)
public:
	void SetupMIDForMeshComponent(class UStaticMeshComponent* MeshComp); // Function /Game/Abilities/Player/Generic/Gadgets/SentryGun/B_FDP_SentryGun.B_FDP_SentryGun_C:SetupMIDForMeshComponent
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/SentryGun/B_FDP_SentryGun.B_FDP_SentryGun_C:UserConstructionScript
	void OnInitializeDecoPreview(class ABuildingActor* NewBuildingActor, class UFortDecoItemDefinition* NewDecoItemDefinition); // Function /Game/Abilities/Player/Generic/Gadgets/SentryGun/B_FDP_SentryGun.B_FDP_SentryGun_C:OnInitializeDecoPreview
	void ExecuteUbergraph_B_FDP_SentryGun(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/SentryGun/B_FDP_SentryGun.B_FDP_SentryGun_C:ExecuteUbergraph_B_FDP_SentryGun
public:
	static class UClass* StaticClass();
};

