#pragma once
#include "FN_Basic.h"

#include "FN_B_Melee_Generic_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Melee_Generic
*/

// BlueprintGeneratedClass /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C
// 0x0070 (0x0664)
class AB_Melee_Generic_C : public AFortWeapon
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x05F4 (0x0004)
	class UPointLightComponent*                                                                          Light_Melee;                                       // 0x05F8 (0x0004)
	class UParticleSystemComponent*                                                                      Rocket_Hammer_Idle_Effect;                         // 0x05FC (0x0004)
	class UParticleSystemComponent*                                                                      Laser_Axe_Idle_Effect;                             // 0x0600 (0x0004)
	class UBoxComponent*                                                                                 Box1;                                              // 0x0604 (0x0004)
	bool                                                                                                 Has_Idle_Effect;                                   // 0x0608 (0x0001)
	uint8_t                                                                                              UnknownData_609[0x3];                              // 0x0609 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               Idle_Effect;                                       // 0x060C (0x0004)
	FVector                                                                                              Effects_Color_Level;                               // 0x0610 (0x000C)
	bool                                                                                                 Has_Swing_Effect;                                  // 0x061C (0x0001)
	uint8_t                                                                                              UnknownData_61D[0x3];                              // 0x061D (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               Swing_Effect;                                      // 0x0620 (0x0004)
	bool                                                                                                 Use_Effect_Color_Override;                         // 0x0624 (0x0001)
	uint8_t                                                                                              UnknownData_625[0x3];                              // 0x0625 (0x0003) MISSED OFFSET
	FLinearColor                                                                                         Main_Effects_Color_Lv;                             // 0x0628 (0x0010)
	bool                                                                                                 Lv2_wpn;                                           // 0x0638 (0x0001)
	bool                                                                                                 Lv3_Wpn;                                           // 0x0639 (0x0001)
	uint8_t                                                                                              UnknownData_63A[0x2];                              // 0x063A (0x0002) MISSED OFFSET
	FLinearColor                                                                                         Main_Effects_Color2_Lv;                            // 0x063C (0x0010)
	class UParticleSystemComponent*                                                                      AnimTrail_PSC;                                     // 0x064C (0x0004)
	class UParticleSystem*                                                                               AnimTrail_ParticleSystem;                          // 0x0650 (0x0004)
	class UParticleSystemComponent*                                                                      MeleeHeavy_PSC;                                    // 0x0654 (0x0004)
	class UParticleSystem*                                                                               MeleeHeavy_ParticleSystem;                         // 0x0658 (0x0004)
	bool                                                                                                 NewVar;                                            // 0x065C (0x0001)
	uint8_t                                                                                              UnknownData_65D[0x3];                              // 0x065D (0x0003) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      AnimTrailMaterial;                                 // 0x0660 (0x0004)
public:
	void Melee_Effect_Color(FVector Melee_Color_Set); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:Melee_Effect_Color
	void SetWpnRarity(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:SetWpnRarity
	void UserConstructionScript(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:UserConstructionScript
	void MeleeSwingRight(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:MeleeSwingRight
	void MeleeSwingLeft(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:MeleeSwingLeft
	void FootStepLeft(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:FootStepLeft
	void FootStepRight(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:FootStepRight
	void ReceiveBeginPlay(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:ReceiveBeginPlay
	void OnPlayWeaponFireFX(bool bPersistentFire); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:OnPlayWeaponFireFX
	void PlayRClickImpacts(); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:PlayRClickImpacts
	void ExecuteUbergraph_B_Melee_Generic(int32_t EntryPoint); // Function /Game/Weapons/FORT_Melee/Blueprints/B_Melee_Generic.B_Melee_Generic_C:ExecuteUbergraph_B_Melee_Generic
public:
	static class UClass* StaticClass();
};

