#pragma once
#include "FN_Basic.h"

#include "FN_B_Pickups_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Pickups
*/

// BlueprintGeneratedClass /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C
// 0x00C0 (0x0330)
class AB_Pickups_C : public AFortPickupEffect
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0270 (0x0004)
	class URotatingMovementComponent*                                                                    RotatingMovement;                                  // 0x0274 (0x0004)
	class UParticleSystemComponent*                                                                      ParticleSystem;                                    // 0x0278 (0x0004)
	class UBillboardComponent*                                                                           Origin;                                            // 0x027C (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x0280 (0x0004)
	FVector                                                                                              Pivot_Offset;                                      // 0x0284 (0x000C)
	FRotator                                                                                             Rotation_Bias;                                     // 0x0290 (0x000C)
	float                                                                                                Rotation_Speed;                                    // 0x029C (0x0004)
	bool                                                                                                 Use_Static_Mesh;                                   // 0x02A0 (0x0001)
	uint8_t                                                                                              UnknownData_2A1[0x3];                              // 0x02A1 (0x0003) MISSED OFFSET
	class UStaticMeshComponent*                                                                          Static_Mesh_Pickup;                                // 0x02A4 (0x0004)
	class USkeletalMeshComponent*                                                                        Skeletal_Mesh_Pickup;                              // 0x02A8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Mid;                                               // 0x02AC (0x0004)
	bool                                                                                                 IsSkeletalMesh;                                    // 0x02B0 (0x0001)
	uint8_t                                                                                              UnknownData_2B1[0x3];                              // 0x02B1 (0x0003) MISSED OFFSET
	class UParticleSystemComponent*                                                                      Backpack_Particle;                                 // 0x02B4 (0x0004)
	bool                                                                                                 Is_a_Backpack;                                     // 0x02B8 (0x0001)
	uint8_t                                                                                              UnknownData_2B9[0x3];                              // 0x02B9 (0x0003) MISSED OFFSET
	TArray<class UMaterialInterface*>                                                                    ListOfMaterialsExemptFromReparenting;              // 0x02BC (0x000C)
	class UPrimitiveComponent*                                                                           SkeletalOrStaticMeshAssetPrimitive;                // 0x02C8 (0x0004)
	class UCurveFloat*                                                                                   ScaleByDistanceCurve;                              // 0x02CC (0x0004)
	class UCurveFloat*                                                                                   Size2Curve;                                        // 0x02D0 (0x0004)
	class UCurveFloat*                                                                                   AlphaCurve;                                        // 0x02D4 (0x0004)
	class UCurveFloat*                                                                                   SizeSparkleCurve;                                  // 0x02D8 (0x0004)
	FTextureParameterValue                                                                               Diffuse;                                           // 0x02DC (0x001C)
	class UMaterialInstanceDynamic*                                                                      Mid2;                                              // 0x02F8 (0x0004)
	bool                                                                                                 _2Materials;                                       // 0x02FC (0x0001)
	uint8_t                                                                                              UnknownData_2FD[0x3];                              // 0x02FD (0x0003) MISSED OFFSET
	int32_t                                                                                              CurrentElementIndex;                               // 0x0300 (0x0004)
	TArray<class UMaterialInstanceDynamic*>                                                              midArray;                                          // 0x0304 (0x000C)
	class UMaterialInterface*                                                                            CurrentMaterial;                                   // 0x0310 (0x0004)
	class UMaterialInterface*                                                                            CurrentParentMaterial;                             // 0x0314 (0x0004)
	bool                                                                                                 MaterialParentIsValid;                             // 0x0318 (0x0001)
	uint8_t                                                                                              UnknownData_319[0x3];                              // 0x0319 (0x0003) MISSED OFFSET
	TArray<class UMaterialInterface*>                                                                    ListOfParentMaterialsExemptFromReparenting;        // 0x031C (0x000C)
	float                                                                                                UpdateParametersRange;                             // 0x0328 (0x0004)
	FTimerHandle                                                                                         UpdateParametersHandle;                            // 0x032C (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:ReceiveBeginPlay
	void OnPickedUp(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:OnPickedUp
	void OnAboutToEnterBackpack(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:OnAboutToEnterBackpack
	void CheckIfInUpdateParametersRange(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:CheckIfInUpdateParametersRange
	void UpdateParameters(); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:UpdateParameters
	void ExecuteUbergraph_B_Pickups(int32_t EntryPoint); // Function /Game/Effects/Fort_Effects/Gameplay/Pickups/B_Pickups.B_Pickups_C:ExecuteUbergraph_B_Pickups
public:
	static class UClass* StaticClass();
};

