#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Commando_FragGrenade_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Commando_FragGrenade
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C
// 0x00DC (0x04F4)
class AB_Prj_Commando_FragGrenade_C : public AFortProj_M80
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      Fuse_Particle;                                     // 0x041C (0x0004)
	class UStaticMeshComponent*                                                                          Mesh;                                              // 0x0420 (0x0004)
	class UAudioComponent*                                                                               GrenadeFuse_AudioComponent;                        // 0x0424 (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Distance;                                   // 0x0428 (0x0004)
	float                                                                                                Prj_Rotation_NewTrack_0_6A6D6ECD4380FB32CEB9EE9E659BA233; // 0x042C (0x0004)
	ETimelineDirection                                                                                   Prj_Rotation__Direction_6A6D6ECD4380FB32CEB9EE9E659BA233; // 0x0430 (0x0001)
	uint8_t                                                                                              UnknownData_431[0x3];                              // 0x0431 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Prj_Rotation;                                      // 0x0434 (0x0004)
	FVector                                                                                              ParticleGuide_Size;                                // 0x0438 (0x000C)
	class UMaterialInstanceDynamic*                                                                      Material_MID;                                      // 0x0444 (0x0004)
	class UParticleSystem*                                                                               P_Explosion;                                       // 0x0448 (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x044C (0x000C)
	class USoundBase*                                                                                    Cue_DistantSound;                                  // 0x0458 (0x0004)
	class USoundBase*                                                                                    Cue_CloseSound;                                    // 0x045C (0x0004)
	float                                                                                                ExplosionRadius;                                   // 0x0460 (0x0004)
	int32_t                                                                                              NumberOfBouncesTillExplode;                        // 0x0464 (0x0004)
	int32_t                                                                                              CurrentNumberOfBounces;                            // 0x0468 (0x0004)
	class USoundBase*                                                                                    Cue_GrenadeFuseSound;                              // 0x046C (0x0004)
	float                                                                                                BouncePawnAgainstPawnGravityScale;                 // 0x0470 (0x0004)
	FHitResult                                                                                           StoredHit;                                         // 0x0474 (0x0080)
public:
	void OnRep_StoredHit(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:OnRep_StoredHit
	void UserConstructionScript(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:UserConstructionScript
	void Prj_Rotation__FinishedFunc(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:Prj_Rotation__FinishedFunc
	void Prj_Rotation__UpdateFunc(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:Prj_Rotation__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:ReceiveBeginPlay
	void OnStop(FHitResult Hit); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:OnStop
	void Stop_Rotation(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:Stop_Rotation
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:OnExploded
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:ReceiveAnyDamage
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:OnBounce
	void ExecuteUbergraph_B_Prj_Commando_FragGrenade(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/B_Prj_Commando_FragGrenade.B_Prj_Commando_FragGrenade_C:ExecuteUbergraph_B_Prj_Commando_FragGrenade
public:
	static class UClass* StaticClass();
};

