#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_Constructor_MiniPulse_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_Constructor_MiniPulse
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C
// 0x0029 (0x0441)
class AB_Prj_Constructor_MiniPulse_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class USphereComponent*                                                                              Radius_Sphere;                                     // 0x041C (0x0004)
	class UStaticMeshComponent*                                                                          Mesh;                                              // 0x0420 (0x0004)
	class UParticleSystemComponent*                                                                      ParticleSystem1;                                   // 0x0424 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Mine_Material;                                     // 0x0428 (0x0004)
	class USoundBase*                                                                                    MiniPulseCue;                                      // 0x042C (0x0004)
	class UParticleSystem*                                                                               P_Explosion;                                       // 0x0430 (0x0004)
	class USoundBase*                                                                                    ExplosionCue;                                      // 0x0434 (0x0004)
	class UClass*                                                                                        B_PostFX;                                          // 0x0438 (0x0004)
	float                                                                                                PostFX_BoxScale;                                   // 0x043C (0x0004)
	bool                                                                                                 PostFX_UseCameraShake;                             // 0x0440 (0x0001)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C:ReceiveBeginPlay
	void OnBounce(FHitResult Hit); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C:OnBounce
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C:OnExploded
	void ExecuteUbergraph_B_Prj_Constructor_MiniPulse(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/B_Prj_Constructor_MiniPulse.B_Prj_Constructor_MiniPulse_C:ExecuteUbergraph_B_Prj_Constructor_MiniPulse
public:
	static class UClass* StaticClass();
};

