#pragma once
#include "FN_Basic.h"

#include "FN_BuildingTooltip_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BuildingTooltip
*/

// WidgetBlueprintGeneratedClass /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C
// 0x0048 (0x028C)
class UBuildingTooltip_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UImage*                                                                                        BuildingIcon;                                      // 0x0248 (0x0004)
	class UBuildingLevelWidget_C*                                                                        BuildingLevelWidget;                               // 0x024C (0x0004)
	class UTextBlock*                                                                                    DescriptionText;                                   // 0x0250 (0x0004)
	class UTextBlock*                                                                                    Gadget_Description_Text;                           // 0x0254 (0x0004)
	class UImage*                                                                                        Gadget_Image;                                      // 0x0258 (0x0004)
	class UTextBlock*                                                                                    Gadget_Text;                                       // 0x025C (0x0004)
	class UVerticalBox*                                                                                  GadgetInfo_VBox;                                   // 0x0260 (0x0004)
	class UHorizontalBox*                                                                                Level___Rating_Row;                                // 0x0264 (0x0004)
	class UMovieWidget_C*                                                                                MovieWidget;                                       // 0x0268 (0x0004)
	class USizeBox*                                                                                      MovieWidget_SizeBox;                               // 0x026C (0x0004)
	class URatingWidget_C*                                                                               RatingWidget_Self;                                 // 0x0270 (0x0004)
	class URatingWidget_C*                                                                               RatingWidget_Team;                                 // 0x0274 (0x0004)
	class UTextBlock*                                                                                    TitleText;                                         // 0x0278 (0x0004)
	FString                                                                                              BuildingTemplateId;                                // 0x027C (0x000C)
	class UHomeBaseBuilding*                                                                             BuildingData;                                      // 0x0288 (0x0004)
public:
	void SetupTooltip(FString InBuildingTemplateId); // Function /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C:SetupTooltip
	class UFortItemDefinition* GetGadget(class UHomeBaseBuilding* Building); // Function /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C:GetGadget
	void Set_Visible(bool In_Visible); // Function /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C:Set Visible
	void Construct(); // Function /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C:Construct
	void ExecuteUbergraph_BuildingTooltip(int32_t EntryPoint); // Function /Game/UI/HomeBase/BuildingTooltip.BuildingTooltip_C:ExecuteUbergraph_BuildingTooltip
public:
	static class UClass* StaticClass();
};

