#pragma once
#include "FN_Basic.h"

#include "FN_B_GoinCommandoWeapon_parameters.h"
#include "FN_B_Ranged_Generic_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_GoinCommandoWeapon
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C
// 0x006C (0x07E0)
class AB_GoinCommandoWeapon_C : public AB_Ranged_Generic_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0774 (0x0004)
	class UParticleSystemComponent*                                                                      P_GoingCommando_WeaponArcs_01;                     // 0x0778 (0x0004)
	class UAudioComponent*                                                                               SpinDownSound;                                     // 0x077C (0x0004)
	class UAudioComponent*                                                                               SpinUpSound;                                       // 0x0780 (0x0004)
	class USoundBase*                                                                                    SpinUpStartSound;                                  // 0x0784 (0x0004)
	float                                                                                                Decal_Lifetime;                                    // 0x0788 (0x0004)
	class UDecalComponent*                                                                               NewVar_1;                                          // 0x078C (0x0004)
	bool                                                                                                 IsUpgraded_;                                       // 0x0790 (0x0001)
	uint8_t                                                                                              UnknownData_791[0x3];                              // 0x0791 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               BulletImpact_Lvl0_4;                               // 0x0794 (0x0004)
	float                                                                                                Decal_Size_Min;                                    // 0x0798 (0x0004)
	float                                                                                                Decal_Size_Max;                                    // 0x079C (0x0004)
	class UParticleSystem*                                                                               BulletImpact_Lvl5;                                 // 0x07A0 (0x0004)
	class UMaterialInterface*                                                                            DecalMaterial;                                     // 0x07A4 (0x0004)
	class UMaterialInterface*                                                                            DecalMaterialLvl0_4;                               // 0x07A8 (0x0004)
	class UMaterialInterface*                                                                            DecalMaterialLvl5;                                 // 0x07AC (0x0004)
	class UParticleSystem*                                                                               MuzzleLvl5;                                        // 0x07B0 (0x0004)
	class UParticleSystem*                                                                               MuzzleLvl0_4;                                      // 0x07B4 (0x0004)
	class UParticleSystemComponent*                                                                      NewVar_0;                                          // 0x07B8 (0x0004)
	class UClass*                                                                                        TracerLvl5;                                        // 0x07BC (0x0004)
	class UClass*                                                                                        TracerLvl0_4;                                      // 0x07C0 (0x0004)
	FGameplayTagContainer                                                                                TC_BoomStick;                                      // 0x07C4 (0x0018)
	class AActor*                                                                                        Set_Actor_Here;                                    // 0x07DC (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:UserConstructionScript
	void OnStartCharge(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:OnStartCharge
	void OnEndCharge(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:OnEndCharge
	void OnPlayWeaponFireFX(bool bPersistentFire); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:OnPlayWeaponFireFX
	void OnPlayImpactFX(FHitResult HitResult, EPhysicalSurface ImpactPhysicalSurface, class UParticleSystemComponent* SpawnedPSC); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:OnPlayImpactFX
	void SetUpgradeLevel(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:SetUpgradeLevel
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:ReceiveBeginPlay
	void ExecuteUbergraph_B_GoinCommandoWeapon(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/B_GoinCommandoWeapon.B_GoinCommandoWeapon_C:ExecuteUbergraph_B_GoinCommandoWeapon
public:
	static class UClass* StaticClass();
};

