#pragma once
#include "FN_Basic.h"

#include "FN_Blueprint_Paper_VIM_parameters.h"
#include "FN_AnimGraphRuntime_enums.h"
#include "FN_AnimGraphRuntime_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Blueprint_Paper_VIM
*/

// AnimBlueprintGeneratedClass /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x02DC (0x071C)
class UBlueprint_Paper_VIM_C : public UFortAnimInstance
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0440 (0x0004)
	FAnimNode_SpringBone                                                                                 AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F; // 0x0444 (0x0098)
	FAnimNode_SpringBone                                                                                 AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D; // 0x04DC (0x0098)
	FAnimNode_SpringBone                                                                                 AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0; // 0x0574 (0x0098)
	FAnimNode_SpringBone                                                                                 AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC; // 0x060C (0x0098)
	FAnimNode_ConvertComponentToLocalSpace                                                               AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E; // 0x06A4 (0x002C)
	FAnimNode_Root                                                                                       AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7; // 0x06D0 (0x002C)
	FAnimNode_MeshSpaceRefPose                                                                           AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF; // 0x06FC (0x0020)
public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32_t EntryPoint); // Function /Game/Weapons/FORT_BuildingTools/Meshes/Blueprint_Paper_VIM.Blueprint_Paper_VIM_C:ExecuteUbergraph_Blueprint_Paper_VIM
public:
	static class UClass* StaticClass();
};

