#pragma once
#include "FN_Basic.h"

#include "FN_BlasterPawn_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_HuskPawn_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: BlasterPawn
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C
// 0x0015 (0x1091)
class ABlasterPawn_C : public AHuskPawn_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x107C (0x0004)
	class UParticleSystemComponent*                                                                      Beam;                                              // 0x1080 (0x0004)
	class UAudioComponent*                                                                               BlastSound;                                        // 0x1084 (0x0004)
	class UParticleSystemComponent*                                                                      HeadEffect;                                        // 0x1088 (0x0004)
	class UParticleSystem*                                                                               HeadEffectTemplate;                                // 0x108C (0x0004)
	bool                                                                                                 HeadEffectStatus;                                  // 0x1090 (0x0001)
public:
	void OnRep_HeadEffectStatus(); // Function /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C:OnRep_HeadEffectStatus
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C:UserConstructionScript
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C:OnDeathServer
	void GameplayCue_Impact_Physical_Energy(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C:GameplayCue.Impact.Physical.Energy
	void ExecuteUbergraph_BlasterPawn(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/BlasterPawn.BlasterPawn_C:ExecuteUbergraph_BlasterPawn
public:
	static class UClass* StaticClass();
};

