#pragma once
#include "FN_Basic.h"

#include "FN_B_Constructor_BASE_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_StructRecyclingResource_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Constructor_BASE
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C
// 0x02D0 (0x0E50)
class AB_Constructor_BASE_C : public AFortConstructorBASE
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0B80 (0x0004)
	class UBoxComponent*                                                                                 Box;                                               // 0x0B84 (0x0004)
	class USphereComponent*                                                                              Sphere_Collision_For_Anim;                         // 0x0B88 (0x0004)
	class USkeletalMeshComponent*                                                                        SK_Base_Device;                                    // 0x0B8C (0x0004)
	class UFortMiniMapComponent*                                                                         FortMiniMap1;                                      // 0x0B90 (0x0004)
	class UAudioComponent*                                                                               Workbench_Ticking;                                 // 0x0B94 (0x0004)
	class UParticleSystemComponent*                                                                      Screen_Lightbeam_01;                               // 0x0B98 (0x0004)
	class UParticleSystemComponent*                                                                      smoke_puff;                                        // 0x0B9C (0x0004)
	class UParticleSystemComponent*                                                                      lightning2;                                        // 0x0BA0 (0x0004)
	class UParticleSystemComponent*                                                                      lightning1;                                        // 0x0BA4 (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x0BA8 (0x0004)
	FGameplayTagContainer                                                                                TC_BigBrother;                                     // 0x0BAC (0x0018)
	int32_t                                                                                              BigBrotherAdditionalNodes;                         // 0x0BC4 (0x0004)
	class UTexture2D*                                                                                    MiniMapIcon;                                       // 0x0BC8 (0x0004)
	float                                                                                                Minimap_View_Distance;                             // 0x0BCC (0x0004)
	class UClass*                                                                                        GE_ContainmentUnit;                                // 0x0BD0 (0x0004)
	class UClass*                                                                                        GE_Hyperthreading;                                 // 0x0BD4 (0x0004)
	FGameplayTagContainer                                                                                TC_Hyperthreading;                                 // 0x0BD8 (0x0018)
	FGameplayTagContainer                                                                                TC_SubroutineOptimization;                         // 0x0BF0 (0x0018)
	class UClass*                                                                                        GE_SubroutineOptimization;                         // 0x0C08 (0x0004)
	FGameplayTagContainer                                                                                TC_Recycling;                                      // 0x0C0C (0x0018)
	int32_t                                                                                              ConnectedWood;                                     // 0x0C24 (0x0004)
	int32_t                                                                                              ConnectedStone;                                    // 0x0C28 (0x0004)
	int32_t                                                                                              ConnectedMetal;                                    // 0x0C2C (0x0004)
	class UFortWorldItemDefinition*                                                                      Wood;                                              // 0x0C30 (0x0004)
	class UFortWorldItemDefinition*                                                                      Stone;                                             // 0x0C34 (0x0004)
	class UFortWorldItemDefinition*                                                                      Metal;                                             // 0x0C38 (0x0004)
	float                                                                                                RecyclingMultiplier;                               // 0x0C3C (0x0004)
	float                                                                                                MinRandomVector;                                   // 0x0C40 (0x0004)
	float                                                                                                MaxRandomVector;                                   // 0x0C44 (0x0004)
	bool                                                                                                 SpawnWood;                                         // 0x0C48 (0x0001)
	bool                                                                                                 SpawnStone;                                        // 0x0C49 (0x0001)
	bool                                                                                                 SpawnMetal;                                        // 0x0C4A (0x0001)
	uint8_t                                                                                              UnknownData_C4B[0x1];                              // 0x0C4B (0x0001) MISSED OFFSET
	int32_t                                                                                              SpawnMax;                                          // 0x0C4C (0x0004)
	float                                                                                                HyperThreadingMultiplier;                          // 0x0C50 (0x0004)
	FGameplayTagContainer                                                                                TC_DefensiveIntegration;                           // 0x0C54 (0x0018)
	class UClass*                                                                                        GE_DefensiveIntegration;                           // 0x0C6C (0x0004)
	FGameplayTagContainer                                                                                TC_AutomatedDefenses;                              // 0x0C70 (0x0018)
	int32_t                                                                                              AutomatedDefenses_Additional_Nodes;                // 0x0C88 (0x0004)
	FGameplayTagContainer                                                                                TC_TotalIntegration;                               // 0x0C8C (0x0018)
	FGameplayTagContainer                                                                                TC_PowerModulation;                                // 0x0CA4 (0x0018)
	class UClass*                                                                                        GE_PowerModulation;                                // 0x0CBC (0x0004)
	FGameplayTagContainer                                                                                TC_ExitPlan;                                       // 0x0CC0 (0x0018)
	int32_t                                                                                              DefensiveIntegrationLevel;                         // 0x0CD8 (0x0004)
	class UClass*                                                                                        GE_LoftyArchitecture;                              // 0x0CDC (0x0004)
	FGameplayTagContainer                                                                                TC_LoftyArchitecture;                              // 0x0CE0 (0x0018)
	FGameplayTagContainer                                                                                Safety_Protocols;                                  // 0x0CF8 (0x0018)
	class UClass*                                                                                        GE_SafetyProtocols;                                // 0x0D10 (0x0004)
	bool                                                                                                 BaseIsPlaced;                                      // 0x0D14 (0x0001)
	uint8_t                                                                                              UnknownData_D15[0x3];                              // 0x0D15 (0x0003) MISSED OFFSET
	int32_t                                                                                              NumbPlayersNearBase;                               // 0x0D18 (0x0004)
	bool                                                                                                 BaseStaticMeshArrays;                              // 0x0D1C (0x0001)
	uint8_t                                                                                              UnknownData_D1D[0x3];                              // 0x0D1D (0x0003) MISSED OFFSET
	float                                                                                                BasePowerLevel;                                    // 0x0D20 (0x0004)
	float                                                                                                BaseAnimPlayRate;                                  // 0x0D24 (0x0004)
	int32_t                                                                                              TotalResourcesSpawned;                             // 0x0D28 (0x0004)
	int32_t                                                                                              ResourceLimit;                                     // 0x0D2C (0x0004)
	FGameplayTagContainer                                                                                TC_Overclocking;                                   // 0x0D30 (0x0018)
	class UClass*                                                                                        GE_UpgradedPowerModulation;                        // 0x0D48 (0x0004)
	FGameplayTagContainer                                                                                TC_ElectrifiedFloors;                              // 0x0D4C (0x0018)
	FGameplayTagContainer                                                                                TC_SlowUnit;                                       // 0x0D64 (0x0018)
	class UClass*                                                                                        GE_SlowUnit;                                       // 0x0D7C (0x0004)
	FGameplayTagContainer                                                                                TC_ContainmentUnit;                                // 0x0D80 (0x0018)
	class UClass*                                                                                        GE_WallContainmentUnit;                            // 0x0D98 (0x0004)
	FGameplayTagContainer                                                                                TC_StrongerExit;                                   // 0x0D9C (0x0018)
	class UClass*                                                                                        GE_StrongerExit;                                   // 0x0DB4 (0x0004)
	FGameplayTagContainer                                                                                TC_CardioFeedbackLoop;                             // 0x0DB8 (0x0018)
	FGameplayTagContainer                                                                                TC_ShieldCapacitor;                                // 0x0DD0 (0x0018)
	class UClass*                                                                                        GE_ShieldCapacitor;                                // 0x0DE8 (0x0004)
	FStructRecyclingResource                                                                             StoredWood;                                        // 0x0DEC (0x0008)
	FStructRecyclingResource                                                                             StoredStone;                                       // 0x0DF4 (0x0008)
	FStructRecyclingResource                                                                             StoredMetal;                                       // 0x0DFC (0x0008)
	int32_t                                                                                              HyperthreadingResourceLimit;                       // 0x0E04 (0x0004)
	bool                                                                                                 CollectResources;                                  // 0x0E08 (0x0001)
	uint8_t                                                                                              UnknownData_E09[0x3];                              // 0x0E09 (0x0003) MISSED OFFSET
	int32_t                                                                                              CraneLv5AdditionalNodes;                           // 0x0E0C (0x0004)
	class UClass*                                                                                        GE_NeuroFeedbackLoop;                              // 0x0E10 (0x0004)
	class UAbilitySystemComponent*                                                                       ConstructorAbilitySystemComponent;                 // 0x0E14 (0x0004)
	class UClass*                                                                                        GE_OutgoingDamageAmp;                              // 0x0E18 (0x0004)
	float                                                                                                DamageAmp;                                         // 0x0E1C (0x0004)
	class UClass*                                                                                        GE_FullyContained;                                 // 0x0E20 (0x0004)
	TArray<class UMaterialInterface*>                                                                    Outer_MIDs;                                        // 0x0E24 (0x000C)
	class UStaticMeshComponent*                                                                          Effect_Mesh_Comp;                                  // 0x0E30 (0x0004)
	TArray<class UMaterialInterface*>                                                                    Inner_MIDs;                                        // 0x0E34 (0x000C)
	TArray<class UStaticMesh*>                                                                           BASEMeshes;                                        // 0x0E40 (0x000C)
	float                                                                                                Transition_Start_Delay;                            // 0x0E4C (0x0004)
public:
	void BaseSelfApplyGameplaySpec(FGameplayEffectSpecHandle GE_Spec); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BaseSelfApplyGameplaySpec
	void SetBaseVisualGlow(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetBaseVisualGlow
	void SetDamageMultiplier(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetDamageMultiplier
	void OnRep_CollectResources(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:OnRep_CollectResources
	FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn) const; // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BlueprintGetInteractionString
	void AddResourceToStack(FStructRecyclingResource RecyclingResource, int32_t AmountToSpawn, class UFortWorldItemDefinition* Stored_Resource, FStructRecyclingResource SetValue); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:AddResourceToStack
	void SpawnResourceForRecycling(class UFortWorldItemDefinition* ItemDefinition, int32_t AmountToSpawn, EFortResourceType ResourceType); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SpawnResourceForRecycling
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn) const; // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BlueprintCanInteract
	void AddGEToBaseArray(TArray<FBASEGameplayEffect> BaseArray, class UClass* GameplayEffect, int32_t LevelOverride); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:AddGEToBaseArray
	void OnRep_NumbPlayersNearBase(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:OnRep_NumbPlayersNearBase
	void OnRep_BaseIsPlaced(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:OnRep_BaseIsPlaced
	void RecycleResources(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:RecycleResources
	void SetupHostileEffects(class UAbilitySystemComponent* AbilitySystemComponent, TArray<FBASEGameplayEffect> HostileEffects); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetupHostileEffects
	void SetupFriendlyEffects(class UAbilitySystemComponent* AbilitySystemComponent, TArray<FBASEGameplayEffect> FriendlyEffects); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetupFriendlyEffects
	void SetupBuildingEffects(class UAbilitySystemComponent* AbilitySystemComponent, TArray<FBASEGameplayEffect> BuildingEffects); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetupBuildingEffects
	void Setup_Base_Effect_Array(class UAbilitySystemComponent* Instigator_Ability_System, TArray<FBASEGameplayEffect> BASEBuildingEffects, TArray<FBASEGameplayEffect> BASEFriendlyEffects, TArray<FBASEGameplayEffect> BASEHostileEffects); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:Setup Base Effect Array
	void SetupBaseDefaultValues(class UAbilitySystemComponent* Ability_System_Component, int32_t NodesToAffect); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:SetupBaseDefaultValues
	void UserConstructionScript(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:UserConstructionScript
	void OnPlaced(class UAbilitySystemComponent* InstigatorAbilitySystemComponent); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:OnPlaced
	void Recycling(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:Recycling
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_264_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BndEvt__Sphere_K2Node_ComponentBoundEvent_264_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_267_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BndEvt__Sphere_K2Node_ComponentBoundEvent_267_ComponentEndOverlapSignature__DelegateSignature
	void AnimateLegs(bool LegsUp); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:AnimateLegs
	void StartBuildingActorVisuals(class ABuildingSMActor* BuildingActor, class UStaticMeshComponent* EffectMeshComp); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:StartBuildingActorVisuals
	void StopBuildingActorVisuals(class ABuildingSMActor* BuildingActor, class UStaticMeshComponent* EffectMeshComp); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:StopBuildingActorVisuals
	void BlueprintOnInteract(class AFortPawn* InteractingPawn); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:BlueprintOnInteract
	void GetDamageAmp(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:GetDamageAmp
	void ResourcesCreated(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:ResourcesCreated
	void ExecuteUbergraph_B_Constructor_BASE(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/B_Constructor_BASE.B_Constructor_BASE_C:ExecuteUbergraph_B_Constructor_BASE
public:
	static class UClass* StaticClass();
};

