#pragma once
#include "FN_Basic.h"

#include "FN_B_Prj_AdrenalineRush_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_Prj_AdrenalineRush
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C
// 0x0058 (0x0470)
class AB_Prj_AdrenalineRush_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UParticleSystemComponent*                                                                      P_AdrenalineRush_HealingSparkleInit_01;            // 0x041C (0x0004)
	class UPostProcessComponent*                                                                         ShockwavePostProcess;                              // 0x0420 (0x0004)
	class UParticleSystemComponent*                                                                      Shockwave;                                         // 0x0424 (0x0004)
	float                                                                                                PP_Shockwave_Transition_9A3E45BA49610747DB8700A8BAA24ED4; // 0x0428 (0x0004)
	float                                                                                                PP_Shockwave_Fader_9A3E45BA49610747DB8700A8BAA24ED4; // 0x042C (0x0004)
	ETimelineDirection                                                                                   PP_Shockwave__Direction_9A3E45BA49610747DB8700A8BAA24ED4; // 0x0430 (0x0001)
	uint8_t                                                                                              UnknownData_431[0x3];                              // 0x0431 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            PP_Shockwave;                                      // 0x0434 (0x0004)
	float                                                                                                Shockwave_Ring_Size_Z;                             // 0x0438 (0x0004)
	class UPostProcessComponent*                                                                         ShockwavePP;                                       // 0x043C (0x0004)
	TArray<float>                                                                                        PP_Shockwave_PlayRate;                             // 0x0440 (0x000C)
	int32_t                                                                                              Minimum_Level_To_Cast_Shockwave_Particles;         // 0x044C (0x0004)
	TArray<float>                                                                                        PP_Shockwave_SpawnRate;                            // 0x0450 (0x000C)
	int32_t                                                                                              Minimum_Level_To_Cast_Shockwave_Post_Process;      // 0x045C (0x0004)
	float                                                                                                Shockwave_Particle_Max_Radius_Clamp;               // 0x0460 (0x0004)
	class USoundBase*                                                                                    Sound_AdrenalineRush_Start;                        // 0x0464 (0x0004)
	class USoundBase*                                                                                    Sound_AdrenalineShockWave_FP;                      // 0x0468 (0x0004)
	class USoundBase*                                                                                    Sound_AdrenalineShockWave_TP;                      // 0x046C (0x0004)
public:
	void DestroyPP(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:DestroyPP
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:UserConstructionScript
	void PP_Shockwave__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:PP Shockwave__FinishedFunc
	void PP_Shockwave__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:PP Shockwave__UpdateFunc
	void PassInfo(float Radius, class AFortPlayerPawn* Owner, int32_t Level); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:PassInfo
	void ExecuteUbergraph_B_Prj_AdrenalineRush(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/B_Prj_AdrenalineRush.B_Prj_AdrenalineRush_C:ExecuteUbergraph_B_Prj_AdrenalineRush
public:
	static class UClass* StaticClass();
};

