#pragma once
#include "FN_Basic.h"

#include "FN_B_BGA_BotTurret_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: B_BGA_BotTurret
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C
// 0x02A8 (0x0730)
class AB_BGA_BotTurret_C : public ABuildingGameplayActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0488 (0x0004)
	class UDecalComponent*                                                                               ScannerDecal;                                      // 0x048C (0x0004)
	class UParticleSystemComponent*                                                                      ScannerRays;                                       // 0x0490 (0x0004)
	class UParticleSystemComponent*                                                                      Thruster_L;                                        // 0x0494 (0x0004)
	class UParticleSystemComponent*                                                                      Thruster_R;                                        // 0x0498 (0x0004)
	class UParticleSystemComponent*                                                                      P_BotTurret_MF_R;                                  // 0x049C (0x0004)
	class UParticleSystemComponent*                                                                      P_BotTurret_MF_L;                                  // 0x04A0 (0x0004)
	class UAudioComponent*                                                                               Weapon_Fire_R_AudioComponent;                      // 0x04A4 (0x0004)
	class UAudioComponent*                                                                               Weapon_Fire_L_AudioComponent;                      // 0x04A8 (0x0004)
	class USkeletalMeshComponent*                                                                        SK_Bot_Turret;                                     // 0x04AC (0x0004)
	class USphereComponent*                                                                              Sphere_ViewRadius_Collision;                       // 0x04B0 (0x0004)
	class UAudioComponent*                                                                               Bot_Idle_AudioComponent;                           // 0x04B4 (0x0004)
	class UAudioComponent*                                                                               Bot_Explode_Cue;                                   // 0x04B8 (0x0004)
	class UAudioComponent*                                                                               Bot_WarmUP_Sound;                                  // 0x04BC (0x0004)
	class UAudioComponent*                                                                               Bot_StartUP_AudioComponent;                        // 0x04C0 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x04C4 (0x0004)
	FVector                                                                                              Timeline_2_Rotation_AC2F08D240A37A1E0A447EB04E197178; // 0x04C8 (0x000C)
	ETimelineDirection                                                                                   Timeline_2__Direction_AC2F08D240A37A1E0A447EB04E197178; // 0x04D4 (0x0001)
	uint8_t                                                                                              UnknownData_4D5[0x3];                              // 0x04D5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_2;                                        // 0x04D8 (0x0004)
	FVector                                                                                              Timeline_0_NewTrack_0_2A6889104467A297A0FF38B63E176895; // 0x04DC (0x000C)
	ETimelineDirection                                                                                   Timeline_0__Direction_2A6889104467A297A0FF38B63E176895; // 0x04E8 (0x0001)
	uint8_t                                                                                              UnknownData_4E9[0x3];                              // 0x04E9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x04EC (0x0004)
	FVector                                                                                              Initial_Location;                                  // 0x04F0 (0x000C)
	float                                                                                                DeltaTimeRot;                                      // 0x04FC (0x0004)
	float                                                                                                WarmupTime;                                        // 0x0500 (0x0004)
	float                                                                                                Bot_Rotation_Speed;                                // 0x0504 (0x0004)
	int32_t                                                                                              ShootingGun;                                       // 0x0508 (0x0004)
	float                                                                                                Duration;                                          // 0x050C (0x0004)
	FTransform                                                                                           StartTransform;                                    // 0x0510 (0x0030)
	class AFortPawn*                                                                                     TargetPawnToTrack;                                 // 0x0540 (0x0004)
	float                                                                                                Movement_Start_Timer;                              // 0x0544 (0x0004)
	float                                                                                                FireRate;                                          // 0x0548 (0x0004)
	bool                                                                                                 HasTarget;                                         // 0x054C (0x0001)
	uint8_t                                                                                              UnknownData_54D[0x3];                              // 0x054D (0x0003) MISSED OFFSET
	float                                                                                                Delta_Time;                                        // 0x0550 (0x0004)
	float                                                                                                BotRadius;                                         // 0x0554 (0x0004)
	TArray<class AFortPawn*>                                                                             PotentialTargets;                                  // 0x0558 (0x000C)
	float                                                                                                RangeSquared;                                      // 0x0564 (0x0004)
	FString                                                                                              TargetAcquisitionFunctionName;                     // 0x0568 (0x000C)
	float                                                                                                TargetAcquisitionCheckTimer;                       // 0x0574 (0x0004)
	FString                                                                                              FiringFunctionName;                                // 0x0578 (0x000C)
	float                                                                                                FireTimer;                                         // 0x0584 (0x0004)
	FVector                                                                                              Gun_Spawn_Loc;                                     // 0x0588 (0x000C)
	FRotator                                                                                             Gun_Spawn_Rot;                                     // 0x0594 (0x000C)
	class UClass*                                                                                        Projectile;                                        // 0x05A0 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Bot_MID__0;                                        // 0x05A4 (0x0004)
	FLinearColor                                                                                         Bot_Turret_Emissive_Color__Friendly_;              // 0x05A8 (0x0010)
	FLinearColor                                                                                         Bot_Turret_Emissive_Color__Enemy_;                 // 0x05B8 (0x0010)
	FLinearColor                                                                                         Scanner_Ray_Light_Color__Friendly_;                // 0x05C8 (0x0010)
	FLinearColor                                                                                         Scanner_Ray_Light_Color__Enemy_;                   // 0x05D8 (0x0010)
	FLinearColor                                                                                         Scanner_Ray_Core_Light_Color__Friendly_;           // 0x05E8 (0x0010)
	FLinearColor                                                                                         Scanner_Ray_Core_Light_Color__Enemy_;              // 0x05F8 (0x0010)
	FLinearColor                                                                                         MF_Sparks_Color__Friendly_;                        // 0x0608 (0x0010)
	FLinearColor                                                                                         MF_Sparks_Color__Enemy_;                           // 0x0618 (0x0010)
	FLinearColor                                                                                         MF_Light_Color__Friendly_;                         // 0x0628 (0x0010)
	FLinearColor                                                                                         MF_Light_Color__Enemy_;                            // 0x0638 (0x0010)
	FLinearColor                                                                                         MF_Ring_Color__Friendly_;                          // 0x0648 (0x0010)
	FLinearColor                                                                                         MF_Ring_Color__Enemy_;                             // 0x0658 (0x0010)
	FLinearColor                                                                                         Thruster_Light_Color__Friendly_;                   // 0x0668 (0x0010)
	FLinearColor                                                                                         Thruster_Light_Color__Enemy_;                      // 0x0678 (0x0010)
	FRotator                                                                                             Actor_Init_Rot;                                    // 0x0688 (0x000C)
	int32_t                                                                                              Left_Right_Gun;                                    // 0x0694 (0x0004)
	class UParticleSystem*                                                                               DeathExplodeTemplate;                              // 0x0698 (0x0004)
	float                                                                                                BotPitch;                                          // 0x069C (0x0004)
	FRotator                                                                                             AimRotation;                                       // 0x06A0 (0x000C)
	FVector                                                                                              ThrusterSize;                                      // 0x06AC (0x000C)
	FVector                                                                                              BotStartLocation;                                  // 0x06B8 (0x000C)
	FFortGameplayEffectContainer                                                                         EC_ProjectileDamage;                               // 0x06C4 (0x006C)
public:
	void OnRep_Left_Right_Gun(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnRep_Left_Right_Gun
	void SetTeamColorsVFX(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:SetTeamColorsVFX
	void UpdateScannerRay(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:UpdateScannerRay
	void AttemptAcquireTarget(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:AttemptAcquireTarget
	void SetFiringTimer(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:SetFiringTimer
	void OnPotentialTargetUntouched(class AFortPawn* UntouchedPotentialTarget); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnPotentialTargetUntouched
	void ClearFiringTimer(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:ClearFiringTimer
	void ClearTargetAcquisitionTimer(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:ClearTargetAcquisitionTimer
	void SetTargetAcquisitionTimer(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:SetTargetAcquisitionTimer
	void SetTrackingTarget(class AFortPawn* Target); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:SetTrackingTarget
	void IsValidTarget(class AFortPawn* PotentialTarget, bool IncludeSimpleRangeCheck, bool IncludeFireLimitCheck, bool IncludeObstructionCheck, bool ValidTarget); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:IsValidTarget
	void OnNewPotentialTargetTouched(class AFortPawn* PotentialTargetPawn); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnNewPotentialTargetTouched
	void Perform_Bot_Rotation(class AActor* LookAtActor); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Perform_Bot_Rotation
	void OnRep_NewVar0(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnRep_NewVar0
	void OnRep_ShootingGun(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnRep_ShootingGun
	void OnRep_Target_Location(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnRep_Target_Location
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Timeline_0__UpdateFunc
	void Timeline_2__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Timeline_2__FinishedFunc
	void Timeline_2__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Timeline_2__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:ReceiveBeginPlay
	void PassBotInfo(float WarmupTime, float BotDuration, float FireRate, float Radius); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:PassBotInfo
	void Bot_Explode(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:Bot_Explode
	void OnDamageServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnDamageServer
	void ReceiveTick(float DeltaSeconds); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:ReceiveTick
	void BndEvt__Sphere_ViewRadius_Collision_K2Node_ComponentBoundEvent_276_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:BndEvt__Sphere_ViewRadius_Collision_K2Node_ComponentBoundEvent_276_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Sphere_ViewRadius_Collision_K2Node_ComponentBoundEvent_439_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:BndEvt__Sphere_ViewRadius_Collision_K2Node_ComponentBoundEvent_439_ComponentEndOverlapSignature__DelegateSignature
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:OnDeathServer
	void AttemptFire(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:AttemptFire
	void ExecuteUbergraph_B_BGA_BotTurret(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/B_BGA_BotTurret.B_BGA_BotTurret_C:ExecuteUbergraph_B_BGA_BotTurret
public:
	static class UClass* StaticClass();
};

