#pragma once
#include "FN_Basic.h"

#include "FN_ConfirmationWindow_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ConfirmationWindow
*/

// WidgetBlueprintGeneratedClass /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C
// 0x001D (0x02D5)
class UConfirmationWindow_C : public UFortConfirmationWindow
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x02B8 (0x0004)
	class UVerticalBox*                                                                                  AdditionalContentBox;                              // 0x02BC (0x0004)
	class UHorizontalBox*                                                                                Button_Area;                                       // 0x02C0 (0x0004)
	class UButtonIconText_C*                                                                             Button_Confirm;                                    // 0x02C4 (0x0004)
	class UButtonIconText_C*                                                                             Button_Decline;                                    // 0x02C8 (0x0004)
	class UTextBlock*                                                                                    HeaderText;                                        // 0x02CC (0x0004)
	class UTextBlock*                                                                                    MessageText;                                       // 0x02D0 (0x0004)
	uint8_t                                                                                              ConfirmationType;                                  // 0x02D4 (0x0001)
public:
	void OnHandleAction(FEventReply Result, bool bPassThrough); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:OnHandleAction
	void HandleTimedOut(); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:HandleTimedOut
	void UpdateTimer(float Display_Time); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:UpdateTimer
	void UpdateButton(class UButtonIconText_C* Button, FText TEXT); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:UpdateButton
	void OnShow(); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:OnShow
	void OnKill(); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:OnKill
	void BndEvt__Button_Confirm_K2Node_ComponentBoundEvent_940_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:BndEvt__Button-Confirm_K2Node_ComponentBoundEvent_940_FortBaseButtonClicked__DelegateSignature
	void BndEvt__Button_Decline_K2Node_ComponentBoundEvent_951_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:BndEvt__Button-Decline_K2Node_ComponentBoundEvent_951_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_ConfirmationWindow(int32_t EntryPoint); // Function /Game/UI/ConfirmationWindow/ConfirmationWindow.ConfirmationWindow_C:ExecuteUbergraph_ConfirmationWindow
public:
	static class UClass* StaticClass();
};

