#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_parameters.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: CoreUObject
*/

// Class /Script/CoreUObject.Object
// 0x001C (0x001C)
class UObject
{
public:
	uint8_t                                                                                              UnknownData_0[0x1C];                               // 0x0000 (0x001C) MISSED OFFSET
public:
	void ExecuteUbergraph(int32_t EntryPoint); // Function /Script/CoreUObject.Object:ExecuteUbergraph
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Interface
// 0x0000 (0x001C)
class UInterface : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.GCObjectReferencer
// 0x000C (0x0028)
class UGCObjectReferencer : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0xC];                               // 0x001C (0x000C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.TextBuffer
// 0x001C (0x0038)
class UTextBuffer : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x1C];                              // 0x001C (0x001C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Field
// 0x0004 (0x0020)
class UField : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Struct
// 0x0038 (0x0058)
class UStruct : public UField
{
public:
	uint8_t                                                                                              UnknownData_20[0x38];                              // 0x0020 (0x0038) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ScriptStruct
// 0x000C (0x0064)
class UScriptStruct : public UStruct
{
public:
	uint8_t                                                                                              UnknownData_58[0xC];                               // 0x0058 (0x000C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Package
// 0x00A0 (0x00BC)
class UPackage : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0xA0];                              // 0x001C (0x00A0) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Class
// 0x012C (0x0184)
class UClass : public UStruct
{
public:
	uint8_t                                                                                              UnknownData_58[0x12C];                             // 0x0058 (0x012C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Function
// 0x0020 (0x0078)
class UFunction : public UStruct
{
public:
	uint8_t                                                                                              UnknownData_58[0x20];                              // 0x0058 (0x0020) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.DelegateFunction
// 0x0000 (0x0078)
class UDelegateFunction : public UFunction
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.DynamicClass
// 0x004C (0x01D0)
class UDynamicClass : public UClass
{
public:
	uint8_t                                                                                              UnknownData_184[0x4C];                             // 0x0184 (0x004C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.PackageMap
// 0x001C (0x0038)
class UPackageMap : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x1C];                              // 0x001C (0x001C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Enum
// 0x001C (0x003C)
class UEnum : public UField
{
public:
	uint8_t                                                                                              UnknownData_20[0x1C];                              // 0x0020 (0x001C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.LinkerPlaceholderClass
// 0x00FC (0x0280)
class ULinkerPlaceholderClass : public UClass
{
public:
	uint8_t                                                                                              UnknownData_184[0xFC];                             // 0x0184 (0x00FC) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.LinkerPlaceholderExportObject
// 0x0048 (0x0064)
class ULinkerPlaceholderExportObject : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x48];                              // 0x001C (0x0048) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.LinkerPlaceholderFunction
// 0x00FC (0x0174)
class ULinkerPlaceholderFunction : public UFunction
{
public:
	uint8_t                                                                                              UnknownData_78[0xFC];                              // 0x0078 (0x00FC) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.MetaData
// 0x003C (0x0058)
class UMetaData : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x3C];                              // 0x001C (0x003C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ObjectRedirector
// 0x0004 (0x0020)
class UObjectRedirector : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Property
// 0x0030 (0x0050)
class UProperty : public UField
{
public:
	uint8_t                                                                                              UnknownData_20[0x30];                              // 0x0020 (0x0030) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.NumericProperty
// 0x0000 (0x0050)
class UNumericProperty : public UProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ArrayProperty
// 0x0004 (0x0054)
class UArrayProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ObjectPropertyBase
// 0x0004 (0x0054)
class UObjectPropertyBase : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.AssetObjectProperty
// 0x0000 (0x0054)
class UAssetObjectProperty : public UObjectPropertyBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.AssetClassProperty
// 0x0004 (0x0058)
class UAssetClassProperty : public UAssetObjectProperty
{
public:
	uint8_t                                                                                              UnknownData_54[0x4];                               // 0x0054 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.BoolProperty
// 0x0004 (0x0054)
class UBoolProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ByteProperty
// 0x0004 (0x0054)
class UByteProperty : public UNumericProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ObjectProperty
// 0x0000 (0x0054)
class UObjectProperty : public UObjectPropertyBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.ClassProperty
// 0x0004 (0x0058)
class UClassProperty : public UObjectProperty
{
public:
	uint8_t                                                                                              UnknownData_54[0x4];                               // 0x0054 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.DelegateProperty
// 0x0004 (0x0054)
class UDelegateProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.DoubleProperty
// 0x0000 (0x0050)
class UDoubleProperty : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.FloatProperty
// 0x0000 (0x0050)
class UFloatProperty : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.IntProperty
// 0x0000 (0x0050)
class UIntProperty : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Int16Property
// 0x0000 (0x0050)
class UInt16Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Int64Property
// 0x0000 (0x0050)
class UInt64Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.Int8Property
// 0x0000 (0x0050)
class UInt8Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.InterfaceProperty
// 0x0004 (0x0054)
class UInterfaceProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.LazyObjectProperty
// 0x0000 (0x0054)
class ULazyObjectProperty : public UObjectPropertyBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.MapProperty
// 0x002C (0x007C)
class UMapProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x2C];                              // 0x0050 (0x002C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.MulticastDelegateProperty
// 0x0004 (0x0054)
class UMulticastDelegateProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.NameProperty
// 0x0000 (0x0050)
class UNameProperty : public UProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.StrProperty
// 0x0000 (0x0050)
class UStrProperty : public UProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.StructProperty
// 0x0004 (0x0054)
class UStructProperty : public UProperty
{
public:
	uint8_t                                                                                              UnknownData_50[0x4];                               // 0x0050 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.UInt16Property
// 0x0000 (0x0050)
class UUInt16Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.UInt32Property
// 0x0000 (0x0050)
class UUInt32Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.UInt64Property
// 0x0000 (0x0050)
class UUInt64Property : public UNumericProperty
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.WeakObjectProperty
// 0x0000 (0x0054)
class UWeakObjectProperty : public UObjectPropertyBase
{
public:
	static class UClass* StaticClass();
};

// Class /Script/CoreUObject.TextProperty
// 0x0000 (0x0050)
class UTextProperty : public UProperty
{
public:
	static class UClass* StaticClass();
};

