#pragma once
#include "FN_Basic.h"

#include "FN_CommanderRewardsShell_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: CommanderRewardsShell
*/

// WidgetBlueprintGeneratedClass /Game/UI/CommanderLevelRewards/CommanderRewardsShell.CommanderRewardsShell_C
// 0x0014 (0x0258)
class UCommanderRewardsShell_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UTextBlock*                                                                                    Max_Text;                                          // 0x0248 (0x0004)
	class UHorizontalBox*                                                                                Rewards_HBox;                                      // 0x024C (0x0004)
	int32_t                                                                                              StartLevel;                                        // 0x0250 (0x0004)
	int32_t                                                                                              EndLevel;                                          // 0x0254 (0x0004)
public:
	void CreateLevelBox(int32_t InLevel, bool isFirstLevel); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsShell.CommanderRewardsShell_C:CreateLevelBox
	void Init(); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsShell.CommanderRewardsShell_C:Init
	void Construct(); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsShell.CommanderRewardsShell_C:Construct
	void ExecuteUbergraph_CommanderRewardsShell(int32_t EntryPoint); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsShell.CommanderRewardsShell_C:ExecuteUbergraph_CommanderRewardsShell
public:
	static class UClass* StaticClass();
};

