#pragma once
#include "FN_Basic.h"

#include "FN_CommanderRewardsLevelBox_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: CommanderRewardsLevelBox
*/

// WidgetBlueprintGeneratedClass /Game/UI/CommanderLevelRewards/CommanderRewardsLevelBox.CommanderRewardsLevelBox_C
// 0x0015 (0x0259)
class UCommanderRewardsLevelBox_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UImage*                                                                                        Background_Image;                                  // 0x0248 (0x0004)
	class UTextBlock*                                                                                    Level_Text;                                        // 0x024C (0x0004)
	class UWrapBox*                                                                                      RewardsWrapBox;                                    // 0x0250 (0x0004)
	int32_t                                                                                              InLevel;                                           // 0x0254 (0x0004)
	bool                                                                                                 isNextLevel;                                       // 0x0258 (0x0001)
public:
	void Construct(); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsLevelBox.CommanderRewardsLevelBox_C:Construct
	void ExecuteUbergraph_CommanderRewardsLevelBox(int32_t EntryPoint); // Function /Game/UI/CommanderLevelRewards/CommanderRewardsLevelBox.CommanderRewardsLevelBox_C:ExecuteUbergraph_CommanderRewardsLevelBox
public:
	static class UClass* StaticClass();
};

