#pragma once
#include "FN_Basic.h"

#include "FN_CommanderLevelRewardItem_parameters.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: CommanderLevelRewardItem
*/

// WidgetBlueprintGeneratedClass /Game/UI/CommanderLevelRewards/CommanderLevelRewardItem.CommanderLevelRewardItem_C
// 0x0015 (0x0259)
class UCommanderLevelRewardItem_C : public UFortUserWidget
{
public:
	class UItemStackCounter_C*                                                                           ItemStackCounter;                                  // 0x0244 (0x0004)
	class UImage*                                                                                        RewardIcon;                                        // 0x0248 (0x0004)
	class UTextBlock*                                                                                    RewardName;                                        // 0x024C (0x0004)
	class UFortItemDefinition*                                                                           ItemReward;                                        // 0x0250 (0x0004)
	int32_t                                                                                              Quantity;                                          // 0x0254 (0x0004)
	bool                                                                                                 bShowDescription;                                  // 0x0258 (0x0001)
public:
	class UWidget* Get_RewardIcon_ToolTipWidget(); // Function /Game/UI/CommanderLevelRewards/CommanderLevelRewardItem.CommanderLevelRewardItem_C:Get_RewardIcon_ToolTipWidget
	void Init(FFortItemQuantityPair InItem); // Function /Game/UI/CommanderLevelRewards/CommanderLevelRewardItem.CommanderLevelRewardItem_C:Init
public:
	static class UClass* StaticClass();
};

