#pragma once
#include "FN_Basic.h"

#include "FN_DayPhaseLightingAndFog_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: DayPhaseLightingAndFog
*/

// BlueprintGeneratedClass /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C
// 0x007C (0x09AC)
class ADayPhaseLightingAndFog_C : public AFortDayNightLightingAndFog
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0930 (0x0004)
	class UStaticMeshComponent*                                                                          BackgroundBox;                                     // 0x0934 (0x0004)
	class UBillboardComponent*                                                                           Component_container;                               // 0x0938 (0x0004)
	float                                                                                                New_Storm_Timeline_Wind_Strength_4A2EEAF540854C2F80980F8E37C7ADF3; // 0x093C (0x0004)
	float                                                                                                New_Storm_Timeline_RainInt_4A2EEAF540854C2F80980F8E37C7ADF3; // 0x0940 (0x0004)
	float                                                                                                New_Storm_Timeline_Lightning_Modulator_4A2EEAF540854C2F80980F8E37C7ADF3; // 0x0944 (0x0004)
	float                                                                                                New_Storm_Timeline_Storm_Ramp_In_Value_4A2EEAF540854C2F80980F8E37C7ADF3; // 0x0948 (0x0004)
	ETimelineDirection                                                                                   New_Storm_Timeline__Direction_4A2EEAF540854C2F80980F8E37C7ADF3; // 0x094C (0x0001)
	uint8_t                                                                                              UnknownData_94D[0x3];                              // 0x094D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            New_Storm_Timeline;                                // 0x0950 (0x0004)
	float                                                                                                FlashLightning_lightning_alpha_0111C5F84B3EFF4A81A138BBC08CCD75; // 0x0954 (0x0004)
	float                                                                                                FlashLightning_Lightning_Intensity_0111C5F84B3EFF4A81A138BBC08CCD75; // 0x0958 (0x0004)
	ETimelineDirection                                                                                   FlashLightning__Direction_0111C5F84B3EFF4A81A138BBC08CCD75; // 0x095C (0x0001)
	uint8_t                                                                                              UnknownData_95D[0x3];                              // 0x095D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FlashLightning;                                    // 0x0960 (0x0004)
	float                                                                                                WindSpeed;                                         // 0x0964 (0x0004)
	float                                                                                                RandomWeatherWaitTime;                             // 0x0968 (0x0004)
	float                                                                                                CurrentAmountOfRandomWeatherTimeLeft;              // 0x096C (0x0004)
	float                                                                                                NewWeatherLerpAmount;                              // 0x0970 (0x0004)
	float                                                                                                WindStrength;                                      // 0x0974 (0x0004)
	float                                                                                                FutureWindStrength;                                // 0x0978 (0x0004)
	float                                                                                                FutureWindSpeed;                                   // 0x097C (0x0004)
	bool                                                                                                 bPickNewWindConditions;                            // 0x0980 (0x0001)
	uint8_t                                                                                              UnknownData_981[0x3];                              // 0x0981 (0x0003) MISSED OFFSET
	float                                                                                                LightningStrength;                                 // 0x0984 (0x0004)
	float                                                                                                ThreatCloudStormAmount;                            // 0x0988 (0x0004)
	bool                                                                                                 UseRainWithStorms;                                 // 0x098C (0x0001)
	bool                                                                                                 Play_a_Particle_Effect_Near_the_players_Feet;      // 0x098D (0x0001)
	bool                                                                                                 Internal_Rain_WindEffects_Should_be_Active;        // 0x098E (0x0001)
	uint8_t                                                                                              UnknownData_98F[0x1];                              // 0x098F (0x0001) MISSED OFFSET
	class UParticleSystemComponent*                                                                      Storm_Foot_Particle_Outdoor;                       // 0x0990 (0x0004)
	class UParticleSystem*                                                                               Storm_Foot_Particle_While_on_Terrain;              // 0x0994 (0x0004)
	class UParticleSystemComponent*                                                                      Storm_Foot_Particle_Indoor;                        // 0x0998 (0x0004)
	class UParticleSystem*                                                                               Storm_Foot_Particle_While_NOT_on_Terrain;          // 0x099C (0x0004)
	float                                                                                                Storm_Wind_Strength;                               // 0x09A0 (0x0004)
	bool                                                                                                 Generate_Foliage_Wind_Gusts;                       // 0x09A4 (0x0001)
	uint8_t                                                                                              UnknownData_9A5[0x3];                              // 0x09A5 (0x0003) MISSED OFFSET
	FTimerHandle                                                                                         LightningStrikeTimerHandle;                        // 0x09A8 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:UserConstructionScript
	void New_Storm_Timeline__FinishedFunc(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:New Storm Timeline__FinishedFunc
	void New_Storm_Timeline__UpdateFunc(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:New Storm Timeline__UpdateFunc
	void New_Storm_Timeline__FireOffRain__EventFunc(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:New Storm Timeline__FireOffRain__EventFunc
	void FlashLightning__FinishedFunc(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:FlashLightning__FinishedFunc
	void FlashLightning__UpdateFunc(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:FlashLightning__UpdateFunc
	void DisableLightAndFog(bool Enable); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:DisableLightAndFog
	void StartStorm(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:StartStorm
	void OnStormStart(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:OnStormStart
	void OnStormEnd(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:OnStormEnd
	void LightningStrike(); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:LightningStrike
	void ExecuteUbergraph_DayPhaseLightingAndFog(int32_t EntryPoint); // Function /Game/Blueprints/DayPhaseLightingAndFog.DayPhaseLightingAndFog_C:ExecuteUbergraph_DayPhaseLightingAndFog
public:
	static class UClass* StaticClass();
};

