#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: EngineMessages
*/

// ScriptStruct /Script/EngineMessages.EngineServiceNotification
// 0x0014 (0x0014)
struct FEngineServiceNotification
{
	FString                                                                                              TEXT;                                              // 0x0000 (0x000C)
	double                                                                                               TimeSeconds;                                       // 0x000C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServiceTerminate
// 0x000C (0x000C)
struct FEngineServiceTerminate
{
	FString                                                                                              UserName;                                          // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServiceExecuteCommand
// 0x0018 (0x0018)
struct FEngineServiceExecuteCommand
{
	FString                                                                                              Command;                                           // 0x0000 (0x000C)
	FString                                                                                              UserName;                                          // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServiceAuthGrant
// 0x0018 (0x0018)
struct FEngineServiceAuthGrant
{
	FString                                                                                              UserName;                                          // 0x0000 (0x000C)
	FString                                                                                              UserToGrant;                                       // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServiceAuthDeny
// 0x0018 (0x0018)
struct FEngineServiceAuthDeny
{
	FString                                                                                              UserName;                                          // 0x0000 (0x000C)
	FString                                                                                              UserToDeny;                                        // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServicePong
// 0x0044 (0x0044)
struct FEngineServicePong
{
	FString                                                                                              CurrentLevel;                                      // 0x0000 (0x000C)
	int32_t                                                                                              EngineVersion;                                     // 0x000C (0x0004)
	bool                                                                                                 HasBegunPlay;                                      // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	FGuid                                                                                                InstanceId;                                        // 0x0014 (0x0010)
	FString                                                                                              InstanceType;                                      // 0x0024 (0x000C)
	FGuid                                                                                                SessionId;                                         // 0x0030 (0x0010)
	float                                                                                                WorldTimeSeconds;                                  // 0x0040 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/EngineMessages.EngineServicePing
// 0x0001 (0x0001)
struct FEngineServicePing
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

