#pragma once
#include "FN_Basic.h"

#include "FN_Engine_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Engine
*/

// ScriptStruct /Script/Engine.DistributionLookupTable
// 0x001C (0x001C)
struct FDistributionLookupTable
{
	uint8_t                                                                                              Op;                                                // 0x0000 (0x0001)
	uint8_t                                                                                              EntryCount;                                        // 0x0001 (0x0001)
	uint8_t                                                                                              EntryStride;                                       // 0x0002 (0x0001)
	uint8_t                                                                                              SubEntryStride;                                    // 0x0003 (0x0001)
	float                                                                                                TimeScale;                                         // 0x0004 (0x0004)
	float                                                                                                TimeBias;                                          // 0x0008 (0x0004)
	TArray<float>                                                                                        Values;                                            // 0x000C (0x000C)
	uint8_t                                                                                              LockFlag;                                          // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RawDistribution
// 0x001C (0x001C)
struct FRawDistribution
{
	FDistributionLookupTable                                                                             Table;                                             // 0x0000 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FloatDistribution
// 0x001C (0x001C)
struct FFloatDistribution
{
	FDistributionLookupTable                                                                             Table;                                             // 0x0000 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.VectorDistribution
// 0x001C (0x001C)
struct FVectorDistribution
{
	FDistributionLookupTable                                                                             Table;                                             // 0x0000 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector4Distribution
// 0x001C (0x001C)
struct FVector4Distribution
{
	FDistributionLookupTable                                                                             Table;                                             // 0x0000 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FormatArgumentData
// 0x0018 (0x0018)
struct FFormatArgumentData
{
	FString                                                                                              ArgumentName;                                      // 0x0000 (0x000C)
	FText                                                                                                ArgumentValue;                                     // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ExpressionInput
// 0x002C (0x002C)
struct FExpressionInput
{
	class UMaterialExpression*                                                                           Expression;                                        // 0x0000 (0x0004)
	int32_t                                                                                              OutputIndex;                                       // 0x0004 (0x0004)
	FString                                                                                              InputName;                                         // 0x0008 (0x000C)
	int32_t                                                                                              Mask;                                              // 0x0014 (0x0004)
	int32_t                                                                                              MaskR;                                             // 0x0018 (0x0004)
	int32_t                                                                                              MaskG;                                             // 0x001C (0x0004)
	int32_t                                                                                              MaskB;                                             // 0x0020 (0x0004)
	int32_t                                                                                              MaskA;                                             // 0x0024 (0x0004)
	int32_t                                                                                              GCC64_Padding;                                     // 0x0028 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.MaterialAttributesInput
// 0x0000 (0x002C)
struct FMaterialAttributesInput : public FExpressionInput
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ExpressionOutput
// 0x0020 (0x0020)
struct FExpressionOutput
{
	FString                                                                                              OutputName;                                        // 0x0000 (0x000C)
	int32_t                                                                                              Mask;                                              // 0x000C (0x0004)
	int32_t                                                                                              MaskR;                                             // 0x0010 (0x0004)
	int32_t                                                                                              MaskG;                                             // 0x0014 (0x0004)
	int32_t                                                                                              MaskB;                                             // 0x0018 (0x0004)
	int32_t                                                                                              MaskA;                                             // 0x001C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.MaterialInput
// 0x002C (0x002C)
struct FMaterialInput
{
	class UMaterialExpression*                                                                           Expression;                                        // 0x0000 (0x0004)
	int32_t                                                                                              OutputIndex;                                       // 0x0004 (0x0004)
	FString                                                                                              InputName;                                         // 0x0008 (0x000C)
	int32_t                                                                                              Mask;                                              // 0x0014 (0x0004)
	int32_t                                                                                              MaskR;                                             // 0x0018 (0x0004)
	int32_t                                                                                              MaskG;                                             // 0x001C (0x0004)
	int32_t                                                                                              MaskB;                                             // 0x0020 (0x0004)
	int32_t                                                                                              MaskA;                                             // 0x0024 (0x0004)
	int32_t                                                                                              GCC64_Padding;                                     // 0x0028 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ColorMaterialInput
// 0x0008 (0x0034)
struct FColorMaterialInput : public FMaterialInput
{
	uint8_t                                                                                              UseConstant : 1;                                   // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	FColor                                                                                               Constant;                                          // 0x0030 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ScalarMaterialInput
// 0x0008 (0x0034)
struct FScalarMaterialInput : public FMaterialInput
{
	uint8_t                                                                                              UseConstant : 1;                                   // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	float                                                                                                Constant;                                          // 0x0030 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.VectorMaterialInput
// 0x0010 (0x003C)
struct FVectorMaterialInput : public FMaterialInput
{
	uint8_t                                                                                              UseConstant : 1;                                   // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	FVector                                                                                              Constant;                                          // 0x0030 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector2MaterialInput
// 0x000C (0x0038)
struct FVector2MaterialInput : public FMaterialInput
{
	uint8_t                                                                                              UseConstant : 1;                                   // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	float                                                                                                ConstantX;                                         // 0x0030 (0x0004)
	float                                                                                                ConstantY;                                         // 0x0034 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector_NetQuantize
// 0x0000 (0x000C)
struct FVector_NetQuantize : public FVector
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector_NetQuantizeNormal
// 0x0000 (0x000C)
struct FVector_NetQuantizeNormal : public FVector
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.HitResult
// 0x0080 (0x0080)
struct FHitResult
{
	uint8_t                                                                                              bBlockingHit : 1;                                  // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bStartPenetrating : 1;                             // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	float                                                                                                Time;                                              // 0x0004 (0x0004)
	float                                                                                                Distance;                                          // 0x0008 (0x0004)
	FVector_NetQuantize                                                                                  Location;                                          // 0x000C (0x000C)
	FVector_NetQuantize                                                                                  ImpactPoint;                                       // 0x0018 (0x000C)
	FVector_NetQuantizeNormal                                                                            Normal;                                            // 0x0024 (0x000C)
	FVector_NetQuantizeNormal                                                                            ImpactNormal;                                      // 0x0030 (0x000C)
	FVector_NetQuantize                                                                                  TraceStart;                                        // 0x003C (0x000C)
	FVector_NetQuantize                                                                                  TraceEnd;                                          // 0x0048 (0x000C)
	float                                                                                                PenetrationDepth;                                  // 0x0054 (0x0004)
	int32_t                                                                                              Item;                                              // 0x0058 (0x0004)
	TWeakObjectPtr<class UPhysicalMaterial>                                                              PhysMaterial;                                      // 0x005C (0x0008)
	TWeakObjectPtr<class AActor>                                                                         Actor;                                             // 0x0064 (0x0008)
	TWeakObjectPtr<class UPrimitiveComponent>                                                            Component;                                         // 0x006C (0x0008)
	FName                                                                                                BoneName;                                          // 0x0074 (0x0008)
	int32_t                                                                                              FaceIndex;                                         // 0x007C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.SimpleMemberReference
// 0x001C (0x001C)
struct FSimpleMemberReference
{
	class UObject*                                                                                       MemberParent;                                      // 0x0000 (0x0004)
	FName                                                                                                MemberName;                                        // 0x0004 (0x0008)
	FGuid                                                                                                MemberGuid;                                        // 0x000C (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.TickFunction
// 0x0034 (0x0034)
struct FTickFunction
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	ETickingGroup                                                                                        TickGroup;                                         // 0x0004 (0x0001)
	ETickingGroup                                                                                        EndTickGroup;                                      // 0x0005 (0x0001)
	uint8_t                                                                                              UnknownData_6[0x2];                                // 0x0006 (0x0002) MISSED OFFSET
	uint8_t                                                                                              bTickEvenWhenPaused : 1;                           // 0x0008 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bCanEverTick : 1;                                  // 0x0008 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bStartWithTickEnabled : 1;                         // 0x0008 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bAllowTickOnDedicatedServer : 1;                   // 0x0008 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_9[0x23];                               // 0x0009 (0x0023) MISSED OFFSET
	float                                                                                                TickInterval;                                      // 0x002C (0x0004)
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ActorComponentTickFunction
// 0x0004 (0x0038)
struct FActorComponentTickFunction : public FTickFunction
{
	uint8_t                                                                                              UnknownData_34[0x4];                               // 0x0034 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.SubtitleCue
// 0x0010 (0x0010)
struct FSubtitleCue
{
	FText                                                                                                TEXT;                                              // 0x0000 (0x000C)
	float                                                                                                Time;                                              // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.InterpControlPoint
// 0x001C (0x001C)
struct FInterpControlPoint
{
	FVector                                                                                              PositionControlPoint;                              // 0x0000 (0x000C)
	bool                                                                                                 bPositionIsRelative;                               // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0xF];                                // 0x000D (0x000F) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PlatformInterfaceData
// 0x0024 (0x0024)
struct FPlatformInterfaceData
{
	FName                                                                                                DataName;                                          // 0x0000 (0x0008)
	EPlatformInterfaceDataType                                                                           Type;                                              // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	int32_t                                                                                              IntValue;                                          // 0x000C (0x0004)
	float                                                                                                FloatValue;                                        // 0x0010 (0x0004)
	FString                                                                                              StringValue;                                       // 0x0014 (0x000C)
	class UObject*                                                                                       ObjectValue;                                       // 0x0020 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PlatformInterfaceDelegateResult
// 0x0028 (0x0028)
struct FPlatformInterfaceDelegateResult
{
	bool                                                                                                 bSuccessful;                                       // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FPlatformInterfaceData                                                                               Data;                                              // 0x0004 (0x0024)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.DebugFloatHistory
// 0x001C (0x001C)
struct FDebugFloatHistory
{
	TArray<float>                                                                                        Samples;                                           // 0x0000 (0x000C)
	float                                                                                                MaxSamples;                                        // 0x000C (0x0004)
	float                                                                                                MinValue;                                          // 0x0010 (0x0004)
	float                                                                                                MaxValue;                                          // 0x0014 (0x0004)
	bool                                                                                                 bAutoAdjustMinMax;                                 // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.LatentActionInfo
// 0x0014 (0x0014)
struct FLatentActionInfo
{
	int32_t                                                                                              Linkage;                                           // 0x0000 (0x0004)
	int32_t                                                                                              UUID;                                              // 0x0004 (0x0004)
	FName                                                                                                ExecutionFunction;                                 // 0x0008 (0x0008)
	class UObject*                                                                                       CallbackTarget;                                    // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.TimerHandle
// 0x0004 (0x0004)
struct FTimerHandle
{
	int32_t                                                                                              Handle;                                            // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.CollisionProfileName
// 0x0008 (0x0008)
struct FCollisionProfileName
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.GenericStruct
// 0x0004 (0x0004)
struct FGenericStruct
{
	int32_t                                                                                              Data;                                              // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FastArraySerializerItem
// 0x000C (0x000C)
struct FFastArraySerializerItem
{
	int32_t                                                                                              ReplicationID;                                     // 0x0000 (0x0004)
	int32_t                                                                                              ReplicationKey;                                    // 0x0004 (0x0004)
	int32_t                                                                                              MostRecentArrayReplicationKey;                     // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.CurveTableRowHandle
// 0x000C (0x000C)
struct FCurveTableRowHandle
{
	class UCurveTable*                                                                                   CurveTable;                                        // 0x0000 (0x0004)
	FName                                                                                                RowName;                                           // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector_NetQuantize10
// 0x0000 (0x000C)
struct FVector_NetQuantize10 : public FVector
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Vector_NetQuantize100
// 0x0000 (0x000C)
struct FVector_NetQuantize100 : public FVector
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FastArraySerializer
// 0x0080 (0x0080)
struct FFastArraySerializer
{
	uint8_t                                                                                              UnknownData_0[0x80];                               // 0x0000 (0x0080) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.UniqueNetIdRepl
// 0x0008 (0x0008)
struct FUniqueNetIdRepl
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.DataTableRowHandle
// 0x000C (0x000C)
struct FDataTableRowHandle
{
	class UDataTable*                                                                                    DataTable;                                         // 0x0000 (0x0004)
	FName                                                                                                RowName;                                           // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.TableRowBase
// 0x0001 (0x0001)
struct FTableRowBase
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.KeyHandleMap
// 0x003C (0x003C)
struct FKeyHandleMap
{
	uint8_t                                                                                              UnknownData_0[0x3C];                               // 0x0000 (0x003C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.IndexedCurve
// 0x0040 (0x0040)
struct FIndexedCurve
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	FKeyHandleMap                                                                                        KeyHandlesToIndices;                               // 0x0004 (0x003C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RichCurveKey
// 0x001C (0x001C)
struct FRichCurveKey
{
	ERichCurveInterpMode                                                                                 InterpMode;                                        // 0x0000 (0x0001)
	ERichCurveTangentMode                                                                                TangentMode;                                       // 0x0001 (0x0001)
	ERichCurveTangentWeightMode                                                                          TangentWeightMode;                                 // 0x0002 (0x0001)
	uint8_t                                                                                              UnknownData_3[0x1];                                // 0x0003 (0x0001) MISSED OFFSET
	float                                                                                                Time;                                              // 0x0004 (0x0004)
	float                                                                                                Value;                                             // 0x0008 (0x0004)
	float                                                                                                ArriveTangent;                                     // 0x000C (0x0004)
	float                                                                                                ArriveTangentWeight;                               // 0x0010 (0x0004)
	float                                                                                                LeaveTangent;                                      // 0x0014 (0x0004)
	float                                                                                                LeaveTangentWeight;                                // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RichCurve
// 0x0014 (0x0054)
struct FRichCurve : public FIndexedCurve
{
	ERichCurveExtrapolation                                                                              PreInfinityExtrap;                                 // 0x0040 (0x0001)
	ERichCurveExtrapolation                                                                              PostInfinityExtrap;                                // 0x0041 (0x0001)
	uint8_t                                                                                              UnknownData_42[0x2];                               // 0x0042 (0x0002) MISSED OFFSET
	TArray<FRichCurveKey>                                                                                Keys;                                              // 0x0044 (0x000C)
	float                                                                                                DefaultValue;                                      // 0x0050 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ExposedValueCopyRecord
// 0x0030 (0x0030)
struct FExposedValueCopyRecord
{
	class UProperty*                                                                                     SourceProperty;                                    // 0x0000 (0x0004)
	FName                                                                                                SourcePropertyName;                                // 0x0004 (0x0008)
	FName                                                                                                SourceSubPropertyName;                             // 0x000C (0x0008)
	int32_t                                                                                              SourceArrayIndex;                                  // 0x0014 (0x0004)
	class UProperty*                                                                                     DestProperty;                                      // 0x0018 (0x0004)
	int32_t                                                                                              DestArrayIndex;                                    // 0x001C (0x0004)
	int32_t                                                                                              Size;                                              // 0x0020 (0x0004)
	EPostCopyOperation                                                                                   PostCopyOperation;                                 // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0xB];                               // 0x0025 (0x000B) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ExposedValueHandler
// 0x001C (0x001C)
struct FExposedValueHandler
{
	FName                                                                                                BoundFunction;                                     // 0x0000 (0x0008)
	TArray<FExposedValueCopyRecord>                                                                      CopyRecords;                                       // 0x0008 (0x000C)
	uint8_t                                                                                              UnknownData_14[0x8];                               // 0x0014 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.AnimNode_Base
// 0x0020 (0x0020)
struct FAnimNode_Base
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	FExposedValueHandler                                                                                 EvaluateGraphExposedInputs;                        // 0x0004 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.InputScaleBias
// 0x0008 (0x0008)
struct FInputScaleBias
{
	float                                                                                                Scale;                                             // 0x0000 (0x0004)
	float                                                                                                Bias;                                              // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PoseLinkBase
// 0x000C (0x000C)
struct FPoseLinkBase
{
	int32_t                                                                                              LinkID;                                            // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0x8];                                // 0x0004 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PoseLink
// 0x0000 (0x000C)
struct FPoseLink : public FPoseLinkBase
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.BlendSampleData
// 0x002C (0x002C)
struct FBlendSampleData
{
	int32_t                                                                                              SampleDataIndex;                                   // 0x0000 (0x0004)
	float                                                                                                TotalWeight;                                       // 0x0004 (0x0004)
	float                                                                                                Time;                                              // 0x0008 (0x0004)
	float                                                                                                PreviousTime;                                      // 0x000C (0x0004)
	uint8_t                                                                                              UnknownData_10[0x1C];                              // 0x0010 (0x001C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.AlphaBlend
// 0x002C (0x002C)
struct FAlphaBlend
{
	EAlphaBlendOption                                                                                    BlendOption;                                       // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	class UCurveFloat*                                                                                   CustomCurve;                                       // 0x0004 (0x0004)
	float                                                                                                BlendTime;                                         // 0x0008 (0x0004)
	uint8_t                                                                                              UnknownData_C[0x20];                               // 0x000C (0x0020) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.AnimNode_AssetPlayerBase
// 0x0028 (0x0048)
struct FAnimNode_AssetPlayerBase : public FAnimNode_Base
{
	bool                                                                                                 bIgnoreForRelevancyTest;                           // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	int32_t                                                                                              GroupIndex;                                        // 0x0024 (0x0004)
	EAnimGroupRole                                                                                       GroupRole;                                         // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	float                                                                                                BlendWeight;                                       // 0x002C (0x0004)
	float                                                                                                InternalTimeAccumulator;                           // 0x0030 (0x0004)
	uint8_t                                                                                              UnknownData_34[0x14];                              // 0x0034 (0x0014) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.BlendFilter
// 0x006C (0x006C)
struct FBlendFilter
{
	uint8_t                                                                                              UnknownData_0[0x6C];                               // 0x0000 (0x006C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ComponentSpacePoseLink
// 0x0000 (0x000C)
struct FComponentSpacePoseLink : public FPoseLinkBase
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.BranchFilter
// 0x000C (0x000C)
struct FBranchFilter
{
	FName                                                                                                BoneName;                                          // 0x0000 (0x0008)
	int32_t                                                                                              BlendDepth;                                        // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.InputBlendPose
// 0x000C (0x000C)
struct FInputBlendPose
{
	TArray<FBranchFilter>                                                                                BranchFilters;                                     // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.BoneReference
// 0x000C (0x000C)
struct FBoneReference
{
	FName                                                                                                BoneName;                                          // 0x0000 (0x0008)
	uint8_t                                                                                              UnknownData_8[0x4];                                // 0x0008 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RuntimeFloatCurve
// 0x0058 (0x0058)
struct FRuntimeFloatCurve
{
	FRichCurve                                                                                           EditorCurveData;                                   // 0x0000 (0x0054)
	class UCurveFloat*                                                                                   ExternalCurve;                                     // 0x0054 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.DirectoryPath
// 0x000C (0x000C)
struct FDirectoryPath
{
	FString                                                                                              Path;                                              // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ExposureSettings
// 0x0008 (0x0008)
struct FExposureSettings
{
	int32_t                                                                                              LogOffset;                                         // 0x0000 (0x0004)
	bool                                                                                                 bFixed;                                            // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.URL
// 0x0050 (0x0050)
struct FURL
{
	FString                                                                                              Protocol;                                          // 0x0000 (0x000C)
	FString                                                                                              Host;                                              // 0x000C (0x000C)
	int32_t                                                                                              Port;                                              // 0x0018 (0x0004)
	FString                                                                                              Map;                                               // 0x001C (0x000C)
	FString                                                                                              RedirectURL;                                       // 0x0028 (0x000C)
	TArray<FString>                                                                                      Op;                                                // 0x0034 (0x000C)
	FString                                                                                              Portal;                                            // 0x0040 (0x000C)
	int32_t                                                                                              Valid;                                             // 0x004C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PrimitiveComponentPostPhysicsTickFunction
// 0x0004 (0x0038)
struct FPrimitiveComponentPostPhysicsTickFunction : public FTickFunction
{
	uint8_t                                                                                              UnknownData_34[0x4];                               // 0x0034 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ActorTickFunction
// 0x0004 (0x0038)
struct FActorTickFunction : public FTickFunction
{
	uint8_t                                                                                              UnknownData_34[0x4];                               // 0x0034 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.TickPrerequisite
// 0x000C (0x000C)
struct FTickPrerequisite
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.CanvasUVTri
// 0x0060 (0x0060)
struct FCanvasUVTri
{
	FVector2D                                                                                            V0_Pos;                                            // 0x0000 (0x0008)
	FVector2D                                                                                            V0_UV;                                             // 0x0008 (0x0008)
	FLinearColor                                                                                         V0_Color;                                          // 0x0010 (0x0010)
	FVector2D                                                                                            V1_Pos;                                            // 0x0020 (0x0008)
	FVector2D                                                                                            V1_UV;                                             // 0x0028 (0x0008)
	FLinearColor                                                                                         V1_Color;                                          // 0x0030 (0x0010)
	FVector2D                                                                                            V2_Pos;                                            // 0x0040 (0x0008)
	FVector2D                                                                                            V2_UV;                                             // 0x0048 (0x0008)
	FLinearColor                                                                                         V2_Color;                                          // 0x0050 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.DepthFieldGlowInfo
// 0x0024 (0x0024)
struct FDepthFieldGlowInfo
{
	uint8_t                                                                                              bEnableGlow : 1;                                   // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FLinearColor                                                                                         GlowColor;                                         // 0x0004 (0x0010)
	FVector2D                                                                                            GlowOuterRadius;                                   // 0x0014 (0x0008)
	FVector2D                                                                                            GlowInnerRadius;                                   // 0x001C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FontRenderInfo
// 0x0028 (0x0028)
struct FFontRenderInfo
{
	uint8_t                                                                                              bClipText : 1;                                     // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bEnableShadow : 1;                                 // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FDepthFieldGlowInfo                                                                                  GlowInfo;                                          // 0x0004 (0x0024)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.Redirector
// 0x0010 (0x0010)
struct FRedirector
{
	FName                                                                                                OldName;                                           // 0x0000 (0x0008)
	FName                                                                                                NewName;                                           // 0x0008 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.FilePath
// 0x000C (0x000C)
struct FFilePath
{
	FString                                                                                              FilePath;                                          // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ComponentReference
// 0x0014 (0x0014)
struct FComponentReference
{
	class AActor*                                                                                        OtherActor;                                        // 0x0000 (0x0004)
	FName                                                                                                ComponentProperty;                                 // 0x0004 (0x0008)
	uint8_t                                                                                              UnknownData_C[0x8];                                // 0x000C (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.ConstrainComponentPropName
// 0x0008 (0x0008)
struct FConstrainComponentPropName
{
	FName                                                                                                ComponentName;                                     // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.WalkableSlopeOverride
// 0x0008 (0x0008)
struct FWalkableSlopeOverride
{
	EWalkableSlopeBehavior                                                                               WalkableSlopeBehavior;                             // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	float                                                                                                WalkableSlopeAngle;                                // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RepAttachment
// 0x0034 (0x0034)
struct FRepAttachment
{
	class AActor*                                                                                        AttachParent;                                      // 0x0000 (0x0004)
	FVector_NetQuantize100                                                                               LocationOffset;                                    // 0x0004 (0x000C)
	FVector_NetQuantize100                                                                               RelativeScale3D;                                   // 0x0010 (0x000C)
	FRotator                                                                                             RotationOffset;                                    // 0x001C (0x000C)
	FName                                                                                                AttachSocket;                                      // 0x0028 (0x0008)
	class USceneComponent*                                                                               AttachComponent;                                   // 0x0030 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RepMovement
// 0x0034 (0x0034)
struct FRepMovement
{
	FVector                                                                                              LinearVelocity;                                    // 0x0000 (0x000C)
	FVector                                                                                              AngularVelocity;                                   // 0x000C (0x000C)
	FVector                                                                                              Location;                                          // 0x0018 (0x000C)
	FRotator                                                                                             Rotation;                                          // 0x0024 (0x000C)
	uint8_t                                                                                              bSimulatedPhysicSleep : 1;                         // 0x0030 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bRepPhysics : 1;                                   // 0x0030 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	EVectorQuantization                                                                                  LocationQuantizationLevel;                         // 0x0031 (0x0001)
	EVectorQuantization                                                                                  VelocityQuantizationLevel;                         // 0x0032 (0x0001)
	ERotatorQuantization                                                                                 RotationQuantizationLevel;                         // 0x0033 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.DamageEvent
// 0x0008 (0x0008)
struct FDamageEvent
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	class UClass*                                                                                        DamageTypeClass;                                   // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RadialDamageParams
// 0x0014 (0x0014)
struct FRadialDamageParams
{
	float                                                                                                BaseDamage;                                        // 0x0000 (0x0004)
	float                                                                                                MinimumDamage;                                     // 0x0004 (0x0004)
	float                                                                                                InnerRadius;                                       // 0x0008 (0x0004)
	float                                                                                                OuterRadius;                                       // 0x000C (0x0004)
	float                                                                                                DamageFalloff;                                     // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.RadialDamageEvent
// 0x002C (0x0034)
struct FRadialDamageEvent : public FDamageEvent
{
	FRadialDamageParams                                                                                  Params;                                            // 0x0008 (0x0014)
	FVector                                                                                              Origin;                                            // 0x001C (0x000C)
	TArray<FHitResult>                                                                                   ComponentHits;                                     // 0x0028 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.PointDamageEvent
// 0x0090 (0x0098)
struct FPointDamageEvent : public FDamageEvent
{
	float                                                                                                Damage;                                            // 0x0008 (0x0004)
	FVector_NetQuantizeNormal                                                                            ShotDirection;                                     // 0x000C (0x000C)
	FHitResult                                                                                           HitInfo;                                           // 0x0018 (0x0080)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Engine.MaterialProxySettings
// 0x0064 (0x0064)
struct FMaterialProxySettings
{
	FIntPoint                                                                                            TextureSize;                                       // 0x0000 (0x0008)
	ETextureSizingType                                                                                   TextureSizingType;                                 // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	float                                                                                                GutterSpace;                                       // 0x000C (0x0004)
	bool                                                                                                 bNormalMap;                                        // 0x0010 (0x0001)
	bool                                                                                                 bMetallicMap;                                      // 0x0011 (0x0001)
	uint8_t                                                                                              UnknownData_12[0x2];                               // 0x0012 (0x0002) MISSED OFFSET
	float                                                                                                MetallicConstant;                                  // 0x0014 (0x0004)
	bool                                                                                                 bRoughnessMap;                                     // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET
	float                                                                                                RoughnessConstant;                                 // 0x001C (0x0004)
	bool                                                                                                 bSpecularMap;                                      // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	float                                                                                                SpecularConstant;                                  // 0x0024 (0x0004)
