#pragma once
#include "FN_Basic.h"

#include "FN_ErrorEntry_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ErrorEntry
*/

// WidgetBlueprintGeneratedClass /Game/UI/ErrorDialog/ErrorEntry.ErrorEntry_C
// 0x0030 (0x0274)
class UErrorEntry_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UButton*                                                                                       Button_50;                                         // 0x0248 (0x0004)
	class UTextBlock*                                                                                    Message;                                           // 0x024C (0x0004)
	FText                                                                                                ErrorText;                                         // 0x0250 (0x000C)
	FString                                                                                              ErrorCode;                                         // 0x025C (0x000C)
	FString                                                                                              ErrorUrlBase;                                      // 0x0268 (0x000C)
public:
	void Construct(); // Function /Game/UI/ErrorDialog/ErrorEntry.ErrorEntry_C:Construct
	void BndEvt__Button_50_K2Node_ComponentBoundEvent_82_OnButtonClickedEvent__DelegateSignature(); // Function /Game/UI/ErrorDialog/ErrorEntry.ErrorEntry_C:BndEvt__Button_50_K2Node_ComponentBoundEvent_82_OnButtonClickedEvent__DelegateSignature
	void ExecuteUbergraph_ErrorEntry(int32_t EntryPoint); // Function /Game/UI/ErrorDialog/ErrorEntry.ErrorEntry_C:ExecuteUbergraph_ErrorEntry
public:
	static class UClass* StaticClass();
};

