#pragma once
#include "FN_Basic.h"

#include "FN_EditorStyle_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: EditorStyle
*/

// Class /Script/EditorStyle.EditorStyleSettings
// 0x0068 (0x0084)
class UEditorStyleSettings : public UObject
{
public:
	FLinearColor                                                                                         SelectionColor;                                    // 0x001C (0x0010)
	FLinearColor                                                                                         PressedSelectionColor;                             // 0x002C (0x0010)
	FLinearColor                                                                                         InactiveSelectionColor;                            // 0x003C (0x0010)
	FLinearColor                                                                                         KeyboardFocusColor;                                // 0x004C (0x0010)
	EColorVisionDeficiency                                                                               ColorVisionDeficiencyPreviewType;                  // 0x005C (0x0001)
	uint8_t                                                                                              UnknownData_5D[0x3];                               // 0x005D (0x0003) MISSED OFFSET
	uint8_t                                                                                              bUseSmallToolBarIcons : 1;                         // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bEnableWindowAnimations : 1;                       // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bShowFriendlyNames : 1;                            // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bExpandConfigurationMenus : 1;                     // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bShowProjectMenus : 1;                             // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bShowLaunchMenus : 1;                              // 0x0060 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              UnknownData_61[0x3];                               // 0x0061 (0x0003) MISSED OFFSET
	ELogTimes                                                                                            LogTimestampMode;                                  // 0x0064 (0x0001)
	bool                                                                                                 bPromoteOutputLogWarningsDuringPIE;                // 0x0065 (0x0001)
	bool                                                                                                 bOpenAssetEditorTabsInNewWindow;                   // 0x0066 (0x0001)
	uint8_t                                                                                              UnknownData_67[0x1D];                              // 0x0067 (0x001D) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

