#pragma once
#include "FN_Basic.h"

#include "FN_EngineSettings_enums.h"
#include "FN_EngineSettings_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: EngineSettings
*/

// Class /Script/EngineSettings.ConsoleSettings
// 0x001C (0x0038)
class UConsoleSettings : public UObject
{
public:
	int32_t                                                                                              MaxScrollbackSize;                                 // 0x001C (0x0004)
	TArray<FAutoCompleteCommand>                                                                         ManualAutoCompleteList;                            // 0x0020 (0x000C)
	TArray<FString>                                                                                      AutoCompleteMapPaths;                              // 0x002C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.GameMapsSettings
// 0x0064 (0x0080)
class UGameMapsSettings : public UObject
{
public:
	FString                                                                                              EditorStartupMap;                                  // 0x001C (0x000C)
	FString                                                                                              LocalMapOptions;                                   // 0x0028 (0x000C)
	FString                                                                                              TransitionMap;                                     // 0x0034 (0x000C)
	bool                                                                                                 bUseSplitscreen;                                   // 0x0040 (0x0001)
	ETwoPlayerSplitScreenType                                                                            TwoPlayerSplitscreenLayout;                        // 0x0041 (0x0001)
	EThreePlayerSplitScreenType                                                                          ThreePlayerSplitscreenLayout;                      // 0x0042 (0x0001)
	uint8_t                                                                                              UnknownData_43[0x1];                               // 0x0043 (0x0001) MISSED OFFSET
	FStringClassReference                                                                                GameInstanceClass;                                 // 0x0044 (0x000C)
	FString                                                                                              GameDefaultMap;                                    // 0x0050 (0x000C)
	FString                                                                                              ServerDefaultMap;                                  // 0x005C (0x000C)
	FStringClassReference                                                                                GlobalDefaultGameMode;                             // 0x0068 (0x000C)
	FStringClassReference                                                                                GlobalDefaultServerGameMode;                       // 0x0074 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.GameNetworkManagerSettings
// 0x002C (0x0048)
class UGameNetworkManagerSettings : public UObject
{
public:
	int32_t                                                                                              MinDynamicBandwidth;                               // 0x001C (0x0004)
	int32_t                                                                                              MaxDynamicBandwidth;                               // 0x0020 (0x0004)
	int32_t                                                                                              TotalNetBandwidth;                                 // 0x0024 (0x0004)
	int32_t                                                                                              BadPingThreshold;                                  // 0x0028 (0x0004)
	uint8_t                                                                                              bIsStandbyCheckingEnabled : 1;                     // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	float                                                                                                StandbyRxCheatTime;                                // 0x0030 (0x0004)
	float                                                                                                StandbyTxCheatTime;                                // 0x0034 (0x0004)
	float                                                                                                PercentMissingForRxStandby;                        // 0x0038 (0x0004)
	float                                                                                                PercentMissingForTxStandby;                        // 0x003C (0x0004)
	float                                                                                                PercentForBadPing;                                 // 0x0040 (0x0004)
	float                                                                                                JoinInProgressStandbyWaitTime;                     // 0x0044 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.GameSessionSettings
// 0x000C (0x0028)
class UGameSessionSettings : public UObject
{
public:
	int32_t                                                                                              MaxSpectators;                                     // 0x001C (0x0004)
	int32_t                                                                                              MaxPlayers;                                        // 0x0020 (0x0004)
	uint8_t                                                                                              bRequiresPushToTalk : 1;                           // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.GeneralEngineSettings
// 0x0000 (0x001C)
class UGeneralEngineSettings : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.GeneralProjectSettings
// 0x0094 (0x00B0)
class UGeneralProjectSettings : public UObject
{
public:
	FString                                                                                              CompanyName;                                       // 0x001C (0x000C)
	FString                                                                                              CompanyDistinguishedName;                          // 0x0028 (0x000C)
	FString                                                                                              CopyrightNotice;                                   // 0x0034 (0x000C)
	FString                                                                                              Description;                                       // 0x0040 (0x000C)
	FString                                                                                              Homepage;                                          // 0x004C (0x000C)
	FString                                                                                              LicensingTerms;                                    // 0x0058 (0x000C)
	FString                                                                                              PrivacyPolicy;                                     // 0x0064 (0x000C)
	FGuid                                                                                                ProjectID;                                         // 0x0070 (0x0010)
	FString                                                                                              ProjectName;                                       // 0x0080 (0x000C)
	FString                                                                                              ProjectVersion;                                    // 0x008C (0x000C)
	FString                                                                                              SupportContact;                                    // 0x0098 (0x000C)
	FText                                                                                                ProjectDisplayedTitle;                             // 0x00A4 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/EngineSettings.HudSettings
// 0x0010 (0x002C)
class UHudSettings : public UObject
{
public:
	uint8_t                                                                                              bShowHUD : 1;                                      // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET
	TArray<FName>                                                                                        DebugDisplay;                                      // 0x0020 (0x000C)
public:
	static class UClass* StaticClass();
};

