#pragma once
#include "FN_Basic.h"

#include "FN_FlingerPawn_parameters.h"
#include "FN_ElementalEnum_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FlingerPawn
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C
// 0x0094 (0x0EE4)
class AFlingerPawn_C : public AFortPawn_Flinger
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0E50 (0x0004)
	float                                                                                                Disolve___Particle_Trigger_Disolve_The_Enemy_F0337528460D20BFFECC03A7A471C144; // 0x0E54 (0x0004)
	ETimelineDirection                                                                                   Disolve___Particle_Trigger__Direction_F0337528460D20BFFECC03A7A471C144; // 0x0E58 (0x0001)
	uint8_t                                                                                              UnknownData_E59[0x3];                              // 0x0E59 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Disolve___Particle_Trigger;                        // 0x0E5C (0x0004)
	float                                                                                                Timeline_0_ColorFadeOutTrack_FF5DFFCA47FEE11FBE8FFF9B5CFA3D28; // 0x0E60 (0x0004)
	float                                                                                                Timeline_0_FadeInTrack_FF5DFFCA47FEE11FBE8FFF9B5CFA3D28; // 0x0E64 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_FF5DFFCA47FEE11FBE8FFF9B5CFA3D28; // 0x0E68 (0x0001)
	uint8_t                                                                                              UnknownData_E69[0x3];                              // 0x0E69 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0E6C (0x0004)
	float                                                                                                MontagePlayTime;                                   // 0x0E70 (0x0004)
	class AFortAIPawn*                                                                                   PawnHeldByFlinger;                                 // 0x0E74 (0x0004)
	FGameplayTagContainer                                                                                TC_WasThisAMeleeStrike;                            // 0x0E78 (0x0018)
	ElementalEnum                                                                                        ElementalType;                                     // 0x0E90 (0x0001)
	uint8_t                                                                                              UnknownData_E91[0x3];                              // 0x0E91 (0x0003) MISSED OFFSET
	class UParticleSystemComponent*                                                                      AmbientParticleEffect;                             // 0x0E94 (0x0004)
	FName                                                                                                ImpactMeleeSocket;                                 // 0x0E98 (0x0008)
	class UParticleSystem*                                                                               ImpactParticles_Default;                           // 0x0EA0 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Wood;                              // 0x0EA4 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Stone;                             // 0x0EA8 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Metal;                             // 0x0EAC (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_HumanFlesh;                        // 0x0EB0 (0x0004)
	bool                                                                                                 MeleeImpact_UseSocketTransforms;                   // 0x0EB4 (0x0001)
	uint8_t                                                                                              UnknownData_EB5[0x3];                              // 0x0EB5 (0x0003) MISSED OFFSET
	FName                                                                                                Impact_MeleeSocket;                                // 0x0EB8 (0x0008)
	FGameplayTagContainer                                                                                TC_NPCAbilityNonAttackRoar;                        // 0x0EC0 (0x0018)
	class UParticleSystemComponent*                                                                      FlingerRangedFX;                                   // 0x0ED8 (0x0004)
	class UParticleSystem*                                                                               FlingerRangedSkullFXTemplate;                      // 0x0EDC (0x0004)
	class UParticleSystem*                                                                               FlingerRangedHuskFXTemplate;                       // 0x0EE0 (0x0004)
public:
	bool IsReadyToReceiveNewSpawnGroup(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:IsReadyToReceiveNewSpawnGroup
	bool OnReceiveSpawnGroup(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnReceiveSpawnGroup
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Timeline_0__UpdateFunc
	void Timeline_0__Spawn__EventFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Timeline_0__Spawn__EventFunc
	void Disolve___Particle_Trigger__FinishedFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Disolve & Particle Trigger__FinishedFunc
	void Disolve___Particle_Trigger__UpdateFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Disolve & Particle Trigger__UpdateFunc
	void Disolve___Particle_Trigger__Spawn_Death_FX__EventFunc(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:Disolve & Particle Trigger__Spawn Death FX__EventFunc
	void FlingerSpawnedAnEnemy(class AFortAIPawn* EnemySpawned, class AFortProjectileBase* ProjectileThatSpawnedThisEnemy); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerSpawnedAnEnemy
	void CanFlingerSpawnAnEnemy(class AActor* ActorWhoAsked); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:CanFlingerSpawnAnEnemy
	void FlingerCanSpawnAnEnemy(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerCanSpawnAnEnemy
	void FlingerCan_tSpawnAnEnemy(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerCan'tSpawnAnEnemy
	void FlingerThrewAProjectileContainingAnEnemy(class AFortProjectileBase* Projectile); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerThrewAProjectileContainingAnEnemy
	void FlingerEnemyFailedToSpawn(class AFortProjectileBase* FailedProjectile); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerEnemyFailedToSpawn
	void AlertEnemySpawnedByFlinger(FVector PushMomentum, float PushDuration, class APawn* OwningFlinger); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:AlertEnemySpawnedByFlinger
	void FlingerEnemyDied(class APawn* PawnThatDied); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:FlingerEnemyDied
	void MantleStart(FVector StartPos, FVector MidPos, FVector EndPos, bool LowWall, bool MidWall, bool FullWall, bool WindowWall); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:MantleStart
	void MantleEnd(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:MantleEnd
	void HuskEvadeStart(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:HuskEvadeStart
	void VerifyTakerAttack(bool SpecialAttack, bool Swoop, bool Soul_Suck, bool Portal); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:VerifyTakerAttack
	void ResetTakerSpecialAttackTimer(bool Swoop, bool SoulSuckMelee, bool Portal); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:ResetTakerSpecialAttackTimer
	void BeginTakerSwoopAttack(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:BeginTakerSwoopAttack
	void EndTakerSwoopAttack(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:EndTakerSwoopAttack
	void TakerWallPortalBehavior(class AActor* BuildingPart, class UBTTask_BlueprintBase* Task, FVector DesiredMoveLocation, bool Debug); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:TakerWallPortalBehavior
	void IsTakerWallPortalAvailable(bool Portal_Available_); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:IsTakerWallPortalAvailable
	void TakerAttackFSM(bool SuccessfulHit); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:TakerAttackFSM
	void TakerSoulSuckSoundBegin(bool Success); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:TakerSoulSuckSoundBegin
	void TakerSoulSuckSoundEnd(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:TakerSoulSuckSoundEnd
	void PortalAdd(class ABuildingActor* BuildingActor, TArray<class ABuildingActor*> BuildingActorList); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:PortalAdd
	void PortalClear(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:PortalClear
	void TakerSoulSuckInterrupted(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:TakerSoulSuckInterrupted
	void PortalGet(class ABuildingActor* BuildingActor, TArray<class ABuildingActor*> BuildingActorList, class AActor* BT); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:PortalGet
	void PortalFX(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:PortalFX
	void PortalCollision(bool Collide_); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:PortalCollision
	void OnSpawnedFromRift(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnSpawnedFromRift
	void OnForceSpawnEffectCompletion(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnForceSpawnEffectCompletion
	void OnDamagePlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnDamagePlayEffects
	void AdditiveHitReactDelay(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:AdditiveHitReactDelay
	void ReceiveBeginPlay(); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:ReceiveBeginPlay
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnDeathServer
	void GameplayCue_Impact_Physical_Creature(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:GameplayCue.Impact.Physical.Creature
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:OnDeathPlayEffects
	void GameplayCue_NPC_Ranged_Grab(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:GameplayCue.NPC.Ranged.Grab
	void GameplayCue_NPC_Ranged_Throw(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:GameplayCue.NPC.Ranged.Throw
	void GameplayCue_NPC_Flinger_Ranged_Grab_NPC(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:GameplayCue.NPC.Flinger.Ranged.Grab.NPC
	void ExecuteUbergraph_FlingerPawn(int32_t EntryPoint); // Function /Game/Characters/Enemies/Flinger/Blueprints/FlingerPawn.FlingerPawn_C:ExecuteUbergraph_FlingerPawn
public:
	static class UClass* StaticClass();
};

