#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortUITheme
*/

// UserDefinedStruct /Game/UI/Global_Elements/FortUITheme.FortUITheme
// 0x0060 (0x0060)
struct FFortUITheme
{
	FLinearColor                                                                                         Light_2_BAF9E4AF40C0A5C1B86A439B79B3A1E4;          // 0x0000 (0x0010)
	FLinearColor                                                                                         Faded_5_2FCC8A1C4BA623597B91E882E0A95F26;          // 0x0010 (0x0010)
	FLinearColor                                                                                         Active_8_10AE283B44A455DE7AF248B79132A69C;         // 0x0020 (0x0010)
	FLinearColor                                                                                         Normal_11_F26C9BAB4EC26A2F2B63A6A5F67AE748;        // 0x0030 (0x0010)
	FLinearColor                                                                                         Dark_14_B49822CC48FC28E72DFACCA1F36B2C18;          // 0x0040 (0x0010)
	FLinearColor                                                                                         Ultra_17_D9B7B92B475B19E3C7733C85FA62631C;         // 0x0050 (0x0010)

	static class UScriptStruct* StaticStruct();
};

