#pragma once
#include "FN_Basic.h"

#include "FN_Fort_Entry_Music_Controller_BP_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Fort_Entry_Music_Controller_BP
*/

// BlueprintGeneratedClass /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C
// 0x0034 (0x0274)
class AFort_Entry_Music_Controller_BP_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UAudioComponent*                                                                               MenuMusic_B;                                       // 0x0244 (0x0004)
	class UAudioComponent*                                                                               MenuMusic_A;                                       // 0x0248 (0x0004)
	class UAudioComponent*                                                                               Hexmap_Music;                                      // 0x024C (0x0004)
	class UAudioComponent*                                                                               Homebase_Music;                                    // 0x0250 (0x0004)
	class UAudioComponent*                                                                               OverView_Music;                                    // 0x0254 (0x0004)
	class UAudioComponent*                                                                               LobbyMusic;                                        // 0x0258 (0x0004)
	class UAudioComponent*                                                                               LlamaVO;                                           // 0x025C (0x0004)
	class UAudioComponent*                                                                               LoginMusic;                                        // 0x0260 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x0264 (0x0004)
	float                                                                                                FadeOutTime;                                       // 0x0268 (0x0004)
	class USoundBase*                                                                                    Sound_Current_Music_A;                             // 0x026C (0x0004)
	class USoundBase*                                                                                    Sound_Current_Music_B;                             // 0x0270 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:UserConstructionScript
	void Music_Login_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Login_FadeIn
	void Music_Store_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Store_FadeIn
	void Music_Lobby_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Lobby_FadeIn
	void Music_WorldOverview_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_WorldOverview_FadeIn
	void Music_HomeBase_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_HomeBase_FadeIn
	void Music_Hexmap_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Hexmap_FadeIn
	void Music_Heroes_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Heroes_FadeIn
	void Music_Vault_FadeIn(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Vault_FadeIn
	void Music_Store_CardIntro_Fadein(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Music_Store_CardIntro_Fadein
	void Store_Transition_To_Purchase(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Store_Transition_To_Purchase
	void Store_Llama_HangingOut(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Store_Llama_HangingOut
	void Store_CardpackSummaryOpenAndLoop(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Store_CardpackSummaryOpenAndLoop
	void Store_HitLlamaAndLoop(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Store_HitLlamaAndLoop
	void Store_Intro_Loop(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:Store_Intro_Loop
	void VBucks_Menu_Enter(); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:VBucks_Menu_Enter
	void ExecuteUbergraph_Fort_Entry_Music_Controller_BP(int32_t EntryPoint); // Function /Game/Sounds/Fort_Audio_Blueprints/Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C:ExecuteUbergraph_Fort_Entry_Music_Controller_BP
public:
	static class UClass* StaticClass();
};

