#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FriendsAndChat
*/

// ScriptStruct /Script/FriendsAndChat.FriendsFontStyle
// 0x0120 (0x0124)
struct FFriendsFontStyle : public FSlateWidgetStyle
{
	FSlateFontInfo                                                                                       FriendsFontSmall;                                  // 0x0004 (0x0028)
	FSlateFontInfo                                                                                       FriendsFontSmallBold;                              // 0x002C (0x0028)
	FSlateFontInfo                                                                                       FriendsFontNormal;                                 // 0x0054 (0x0028)
	FSlateFontInfo                                                                                       FriendsFontNormalBold;                             // 0x007C (0x0028)
	FSlateFontInfo                                                                                       FriendsFontLarge;                                  // 0x00A4 (0x0028)
	FSlateFontInfo                                                                                       FriendsFontLargeBold;                              // 0x00CC (0x0028)
	FLinearColor                                                                                         DefaultFontColor;                                  // 0x00F4 (0x0010)
	FLinearColor                                                                                         InvertedFontColor;                                 // 0x0104 (0x0010)
	FLinearColor                                                                                         DefaultDullFontColor;                              // 0x0114 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsListStyle
// 0x2168 (0x216C)
struct FFriendsListStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         GlobalChatButtonStyle;                             // 0x0004 (0x022C)
	FButtonStyle                                                                                         FriendItemButtonStyle;                             // 0x0230 (0x022C)
	FButtonStyle                                                                                         ConfirmButtonStyle;                                // 0x045C (0x022C)
	FButtonStyle                                                                                         CancelButtonStyle;                                 // 0x0688 (0x022C)
	FSlateColor                                                                                          ButtonContentColor;                                // 0x08B4 (0x001C)
	FSlateColor                                                                                          ButtonHoverContentColor;                           // 0x08D0 (0x001C)
	FSlateBrush                                                                                          ActionMenuArrowBrush;                              // 0x08EC (0x0074)
	FButtonStyle                                                                                         BackButtonStyle;                                   // 0x0960 (0x022C)
	FButtonStyle                                                                                         HeaderButtonStyle;                                 // 0x0B8C (0x022C)
	FButtonStyle                                                                                         FriendListActionButtonStyle;                       // 0x0DB8 (0x022C)
	FSlateBrush                                                                                          AddFriendButtonContentBrush;                       // 0x0FE4 (0x0074)
	FSlateBrush                                                                                          StatusIconBrush;                                   // 0x1058 (0x0074)
	FSlateBrush                                                                                          FriendImageBrush;                                  // 0x10CC (0x0074)
	FSlateBrush                                                                                          FortniteImageBrush;                                // 0x1140 (0x0074)
	FSlateBrush                                                                                          FortniteDevImageBrush;                             // 0x11B4 (0x0074)
	FSlateBrush                                                                                          FortniteTestImageBrush;                            // 0x1228 (0x0074)
	FSlateBrush                                                                                          LauncherImageBrush;                                // 0x129C (0x0074)
	FSlateBrush                                                                                          UTImageBrush;                                      // 0x1310 (0x0074)
	FSlateBrush                                                                                          OfflineBrush;                                      // 0x1384 (0x0074)
	FSlateBrush                                                                                          OnlineBrush;                                       // 0x13F8 (0x0074)
	FSlateBrush                                                                                          AwayBrush;                                         // 0x146C (0x0074)
	FSlateBrush                                                                                          FriendsContainerBackground;                        // 0x14E0 (0x0074)
	FSlateBrush                                                                                          FriendsListBackground;                             // 0x1554 (0x0074)
	FEditableTextBoxStyle                                                                                AddFriendEditableTextStyle;                        // 0x15C8 (0x0698)
	FVector2D                                                                                            UserPresenceImageSize;                             // 0x1C60 (0x0008)
	FSlateBrush                                                                                          BackBrush;                                         // 0x1C68 (0x0074)
	FSlateBrush                                                                                          SelectedOptionBrush;                               // 0x1CDC (0x0074)
	FSlateBrush                                                                                          SettingsBrush;                                     // 0x1D50 (0x0074)
	FSlateBrush                                                                                          SeperatorBrush;                                    // 0x1DC4 (0x0074)
	FSlateBrush                                                                                          FontSizeBrush;                                     // 0x1E38 (0x0074)
	FSlateBrush                                                                                          SearchBrush;                                       // 0x1EAC (0x0074)
	FMargin                                                                                              BackButtonMargin;                                  // 0x1F20 (0x0010)
	FMargin                                                                                              HeaderButtonMargin;                                // 0x1F30 (0x0010)
	FMargin                                                                                              FriendsListMargin;                                 // 0x1F40 (0x0010)
	FMargin                                                                                              BackButtonContentMargin;                           // 0x1F50 (0x0010)
	FMargin                                                                                              FriendsListNoFriendsMargin;                        // 0x1F60 (0x0010)
	FMargin                                                                                              FriendsListHeaderMargin;                           // 0x1F70 (0x0010)
	FMargin                                                                                              FriendsListHeaderCountMargin;                      // 0x1F80 (0x0010)
	FMargin                                                                                              HeaderButtonContentMargin;                         // 0x1F90 (0x0010)
	FMargin                                                                                              FriendItemMargin;                                  // 0x1FA0 (0x0010)
	FMargin                                                                                              FriendItemStatusMargin;                            // 0x1FB0 (0x0010)
	FMargin                                                                                              FriendItemPresenceMargin;                          // 0x1FC0 (0x0010)
	FMargin                                                                                              ConfirmationBorderMargin;                          // 0x1FD0 (0x0010)
	FMargin                                                                                              ConfirmationButtonMargin;                          // 0x1FE0 (0x0010)
	FMargin                                                                                              ConfirmationButtonContentMargin;                   // 0x1FF0 (0x0010)
	FMargin                                                                                              SubMenuBackIconMargin;                             // 0x2000 (0x0010)
	FMargin                                                                                              SubMenuPageIconMargin;                             // 0x2010 (0x0010)
	FMargin                                                                                              RadioSettingTitleMargin;                           // 0x2020 (0x0010)
	FMargin                                                                                              SubMenuSearchIconMargin;                           // 0x2030 (0x0010)
	FMargin                                                                                              SubMenuSearchTextMargin;                           // 0x2040 (0x0010)
	FMargin                                                                                              SubMenuBackButtonMargin;                           // 0x2050 (0x0010)
	FMargin                                                                                              SubMenuSettingButtonMargin;                        // 0x2060 (0x0010)
	FMargin                                                                                              SubMenuListMargin;                                 // 0x2070 (0x0010)
	float                                                                                                SubMenuSeperatorThickness;                         // 0x2080 (0x0004)
	FSlateBrush                                                                                          ClanDetailsBrush;                                  // 0x2084 (0x0074)
	FSlateBrush                                                                                          ClanMembersBrush;                                  // 0x20F8 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsComboStyle
// 0x0DAC (0x0DB0)
struct FFriendsComboStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         ComboItemButtonStyle;                              // 0x0004 (0x022C)
	FLinearColor                                                                                         ComboItemTextColorNormal;                          // 0x0230 (0x0010)
	FLinearColor                                                                                         ComboItemTextColorInverted;                        // 0x0240 (0x0010)
	FTextBlockStyle                                                                                      ComboItemTextStyle;                                // 0x0250 (0x0100)
	FTextBlockStyle                                                                                      FriendsComboTextStyle;                             // 0x0350 (0x0100)
	FVector2D                                                                                            StatusButtonSize;                                  // 0x0450 (0x0008)
	FVector2D                                                                                            ActionComboButtonSize;                             // 0x0458 (0x0008)
	FComboButtonStyle                                                                                    ActionComboButtonStyle;                            // 0x0460 (0x0328)
	FTextBlockStyle                                                                                      ActionComboButtonTextStyle;                        // 0x0788 (0x0100)
	FMargin                                                                                              ComboMenuPadding;                                  // 0x0888 (0x0010)
	FMargin                                                                                              ComboItemPadding;                                  // 0x0898 (0x0010)
	FMargin                                                                                              ComboItemContentPadding;                           // 0x08A8 (0x0010)
	FSlateBrush                                                                                          FriendComboBackgroundLeftBrush;                    // 0x08B8 (0x0074)
	FSlateBrush                                                                                          FriendComboBackgroundRightBrush;                   // 0x092C (0x0074)
	FSlateBrush                                                                                          FriendComboBackgroundLeftFlippedBrush;             // 0x09A0 (0x0074)
	FSlateBrush                                                                                          FriendComboBackgroundRightFlippedBrush;            // 0x0A14 (0x0074)
	FComboButtonStyle                                                                                    FriendListComboButtonStyle;                        // 0x0A88 (0x0328)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsChatStyle
// 0x1260 (0x1264)
struct FFriendsChatStyle : public FSlateWidgetStyle
{
	FTextBlockStyle                                                                                      TextStyle;                                         // 0x0004 (0x0100)
	FTextBlockStyle                                                                                      TimeStampTextStyle;                                // 0x0104 (0x0100)
	float                                                                                                TimeStampOpacity;                                  // 0x0204 (0x0004)
	FLinearColor                                                                                         DefaultChatColor;                                  // 0x0208 (0x0010)
	FLinearColor                                                                                         WhisperChatColor;                                  // 0x0218 (0x0010)
	FLinearColor                                                                                         GlobalChatColor;                                   // 0x0228 (0x0010)
	FLinearColor                                                                                         GameChatColor;                                     // 0x0238 (0x0010)
	FLinearColor                                                                                         PartyChatColor;                                    // 0x0248 (0x0010)
	FLinearColor                                                                                         AdminChatColor;                                    // 0x0258 (0x0010)
	FLinearColor                                                                                         WhisperHyperlinkChatColor;                         // 0x0268 (0x0010)
	FLinearColor                                                                                         GlobalHyperlinkChatColor;                          // 0x0278 (0x0010)
	FLinearColor                                                                                         GameHyperlinkChatColor;                            // 0x0288 (0x0010)
	FLinearColor                                                                                         PartyHyperlinkChatColor;                           // 0x0298 (0x0010)
	FEditableTextBoxStyle                                                                                ChatEntryTextStyle;                                // 0x02A8 (0x0698)
	FEditableTextBoxStyle                                                                                ChatDisplayTextStyle;                              // 0x0940 (0x0698)
	FScrollBoxStyle                                                                                      ScrollBorderStyle;                                 // 0x0FD8 (0x01D4)
	FSlateBrush                                                                                          MessageNotificationBrush;                          // 0x11AC (0x0074)
	FMargin                                                                                              ChatEntryPadding;                                  // 0x1220 (0x0010)
	float                                                                                                ChatEntryHeight;                                   // 0x1230 (0x0004)
	FMargin                                                                                              FriendActionPadding;                               // 0x1234 (0x0010)
	FMargin                                                                                              FriendActionHeaderPadding;                         // 0x1244 (0x0010)
	FMargin                                                                                              FriendActionStatusMargin;                          // 0x1254 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsChatChromeStyle
// 0x02E8 (0x02EC)
struct FFriendsChatChromeStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          ChatBackgroundBrush;                               // 0x0004 (0x0074)
	FSlateBrush                                                                                          ChatEntryBackgroundBrush;                          // 0x0078 (0x0074)
	FSlateBrush                                                                                          ChannelBackgroundBrush;                            // 0x00EC (0x0074)
	FLinearColor                                                                                         ChatEntryBackgroundColor;                          // 0x0160 (0x0010)
	FSlateBrush                                                                                          TabBackgroundBrush;                                // 0x0170 (0x0074)
	FLinearColor                                                                                         NoneActiveTabColor;                                // 0x01E4 (0x0010)
	FLinearColor                                                                                         TabFontColor;                                      // 0x01F4 (0x0010)
	FLinearColor                                                                                         TabFontColorInverted;                              // 0x0204 (0x0010)
	float                                                                                                TabWidth;                                          // 0x0214 (0x0004)
	FMargin                                                                                              TabPadding;                                        // 0x0218 (0x0010)
	FMargin                                                                                              ChatWindowPadding;                                 // 0x0228 (0x0010)
	FMargin                                                                                              ChatWindowToEntryMargin;                           // 0x0238 (0x0010)
	FMargin                                                                                              ChatChannelPadding;                                // 0x0248 (0x0010)
	FMargin                                                                                              ChatEntryPadding;                                  // 0x0258 (0x0010)
	FLinearColor                                                                                         ChatBackgroundColor;                               // 0x0268 (0x0010)
	FSlateBrush                                                                                          ChatMenuBackgroundBrush;                           // 0x0278 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsMarkupStyle
// 0x048C (0x0490)
struct FFriendsMarkupStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         MarkupButtonStyle;                                 // 0x0004 (0x022C)
	FTextBlockStyle                                                                                      MarkupTextStyle;                                   // 0x0230 (0x0100)
	FSlateBrush                                                                                          MarkupBackground;                                  // 0x0330 (0x0074)
	FSlateColor                                                                                          ButtonColor;                                       // 0x03A4 (0x001C)
	FSlateColor                                                                                          ButtonHoverColor;                                  // 0x03C0 (0x001C)
	FSlateColor                                                                                          TipColor;                                          // 0x03DC (0x001C)
	FSlateBrush                                                                                          SeperatorBrush;                                    // 0x03F8 (0x0074)
	float                                                                                                SeperatorThickness;                                // 0x046C (0x0004)
	FMargin                                                                                              MarkupPadding;                                     // 0x0470 (0x0010)
	FMargin                                                                                              ButtonPadding;                                     // 0x0480 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FriendsAndChat.FriendsAndChatStyle
// 0x4E6C (0x4E70)
struct FFriendsAndChatStyle : public FSlateWidgetStyle
{
	FScrollBarStyle                                                                                      ScrollBarStyle;                                    // 0x0004 (0x0418)
	FButtonStyle                                                                                         ActionButtonStyle;                                 // 0x041C (0x022C)
	FFriendsFontStyle                                                                                    FriendsSmallFontStyle;                             // 0x0648 (0x0124)
	FFriendsFontStyle                                                                                    FriendsNormalFontStyle;                            // 0x076C (0x0124)
	FFriendsFontStyle                                                                                    FriendsLargeFontStyle;                             // 0x0890 (0x0124)
	FCheckBoxStyle                                                                                       CheckBoxStyle;                                     // 0x09B4 (0x04B8)
	FCheckBoxStyle                                                                                       RadioBoxStyle;                                     // 0x0E6C (0x04B8)
	FFriendsListStyle                                                                                    FriendsListStyle;                                  // 0x1324 (0x216C)
	FFriendsChatStyle                                                                                    FriendsChatStyle;                                  // 0x3490 (0x1264)
	FFriendsChatChromeStyle                                                                              FriendsChatChromeStyle;                            // 0x46F4 (0x02EC)
	FFriendsMarkupStyle                                                                                  FriendsMarkupStyle;                                // 0x49E0 (0x0490)

	static class UScriptStruct* StaticStruct();
};

