#pragma once
#include "FN_Basic.h"

#include "FN_FortnitePartyHeroSelect_Camera_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortnitePartyHeroSelect_Camera
*/

// BlueprintGeneratedClass /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C
// 0x0010 (0x0618)
class AFortnitePartyHeroSelect_Camera_C : public AFortCameraBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	class UCameraComponent*                                                                              CameraActor_0;                                     // 0x060C (0x0004)
	bool                                                                                                 MouseDown;                                         // 0x0610 (0x0001)
	uint8_t                                                                                              UnknownData_611[0x3];                              // 0x0611 (0x0003) MISSED OFFSET
	class AFortPlayerPawn*                                                                               CachedPawn;                                        // 0x0614 (0x0004)
public:
	void HandleMousePress(); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:HandleMousePress
	void HandleMouseRelease(); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:HandleMouseRelease
	void UserConstructionScript(); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:UserConstructionScript
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_19(FKey Key); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_19
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_18(FKey Key); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_18
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_17(FKey Key); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_17
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_16(FKey Key); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_16
	void OnActivated(); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:OnActivated
	void OnDeactivated(); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:OnDeactivated
	void ReceiveTick(float DeltaSeconds); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:ReceiveTick
	void ExecuteUbergraph_FortnitePartyHeroSelect_Camera(int32_t EntryPoint); // Function /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.FortnitePartyHeroSelect_Camera_C:ExecuteUbergraph_FortnitePartyHeroSelect_Camera
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/Environments/FrontEnd/Blueprints/FortnitePartyHeroSelect_Camera.PLACEHOLDER-CLASS__TVPostProcessBP_C_140
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_140
{
public:
	static class UClass* StaticClass();
};

