#pragma once
#include "FN_Basic.h"

#include "FN_FortniteEntry_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortniteEntry
*/

// LinkerPlaceholderClass /Game/Maps/FortniteEntry.PLACEHOLDER-CLASS__HBOnboardingFlow_C_129
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__HBOnboardingFlow_C_129
{
public:
	static class UClass* StaticClass();
};

// BlueprintGeneratedClass /Game/Maps/FortniteEntry.FortniteEntry_C
// 0x000C (0x0258)
class AFortniteEntry_C : public AFortLevelScriptActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x024C (0x0004)
	bool                                                                                                 bStartedTutorial;                                  // 0x0250 (0x0001)
	uint8_t                                                                                              UnknownData_251[0x3];                              // 0x0251 (0x0003) MISSED OFFSET
	class AHBOnboardingFlow_C*                                                                           HBOnboardingFlow_55_ExecuteUbergraph_FortniteEntry_RefProperty; // 0x0254 (0x0004)
public:
	void OnMatchStarted(); // Function /Game/Maps/FortniteEntry.FortniteEntry_C:OnMatchStarted
	void EnableTutorial(); // Function /Game/Maps/FortniteEntry.FortniteEntry_C:EnableTutorial
	void ReceiveBeginPlay(); // Function /Game/Maps/FortniteEntry.FortniteEntry_C:ReceiveBeginPlay
	void ExecuteUbergraph_FortniteEntry(int32_t EntryPoint); // Function /Game/Maps/FortniteEntry.FortniteEntry_C:ExecuteUbergraph_FortniteEntry
public:
	static class UClass* StaticClass();
};

