#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_FortUITheme_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortUIStylesheet
*/

// UserDefinedStruct /Game/UI/Global_Elements/FortUIStylesheet.FortUIStylesheet
// 0x0968 (0x0968)
struct FFortUIStylesheet
{
	FFortUITheme                                                                                         Theme_Default_91_015CB18F413B4A467B38CB93E8734A68; // 0x0000 (0x0060)
	FFortUITheme                                                                                         Theme_Emphasis_94_962F11A944E9DF11F547FBBDB98DD4BE; // 0x0060 (0x0060)
	FFortUITheme                                                                                         Theme_Critical_97_43F63D0C4E71395016AE00B41BB7BA0C; // 0x00C0 (0x0060)
	FFortMultiSizeBrush                                                                                  Standard_Icon_Size_131_774B5BB9434A3E02AEC16CA1BB6B253A; // 0x0120 (0x02B8)
	FFortMultiSizeBrush                                                                                  Item_Size_144_A36DAD55442FF44849D422B57DDD037A;    // 0x03D8 (0x02B8)
	FFortMultiSizeBrush                                                                                  Item_Icon_Size_134_098E0A9F46695EDB2E9166978E7B49F1; // 0x0690 (0x02B8)
	FLinearColor                                                                                         Color_Additive_137_AC063FB242D9ECBD0B6306BBE205C7F7; // 0x0948 (0x0010)
	FLinearColor                                                                                         Color_Negative_140_0402338944FCC3DED4C90E9A78FD8BC5; // 0x0958 (0x0010)

	static class UScriptStruct* StaticStruct();
};

