#pragma once
#include "FN_Basic.h"

#include "FN_Foliage_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Foliage
*/

// ScriptStruct /Script/Foliage.ProceduralFoliageInstance
// 0x0050 (0x0050)
struct FProceduralFoliageInstance
{
	FVector                                                                                              Location;                                          // 0x0000 (0x000C)
	uint8_t                                                                                              UnknownData_C[0x4];                                // 0x000C (0x0004) MISSED OFFSET
	FQuat                                                                                                Rotation;                                          // 0x0010 (0x0010)
	FVector                                                                                              Normal;                                            // 0x0020 (0x000C)
	float                                                                                                Age;                                               // 0x002C (0x0004)
	float                                                                                                Scale;                                             // 0x0030 (0x0004)
	class UFoliageType_InstancedStaticMesh*                                                              Type;                                              // 0x0034 (0x0004)
	uint8_t                                                                                              UnknownData_38[0x18];                              // 0x0038 (0x0018) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Foliage.FoliageTypeObject
// 0x0010 (0x0010)
struct FFoliageTypeObject
{
	class UObject*                                                                                       FoliageTypeObject;                                 // 0x0000 (0x0004)
	class UFoliageType_InstancedStaticMesh*                                                              TypeInstance;                                      // 0x0004 (0x0004)
	bool                                                                                                 bIsAsset;                                          // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	class UClass*                                                                                        Type;                                              // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

