#pragma once
#include "FN_Basic.h"

#include "FN_FortniteGame_enums.h"
#include "FN_AIModule_enums.h"
#include "FN_AIModule_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"
#include "FN_Lobby_structs.h"
#include "FN_McpProfileSys_structs.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"
#include "FN_Party_enums.h"
#include "FN_Party_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortniteGame
*/

// ScriptStruct /Script/FortniteGame.ProjectileEventData
// 0x001C (0x001C)
struct FProjectileEventData
{
	class AFortProjectileBase*                                                                           SpawnedProjectile;                                 // 0x0000 (0x0004)
	TArray<FHitResult>                                                                                   Hits;                                              // 0x0004 (0x000C)
	TArray<class AActor*>                                                                                ExplodedActors;                                    // 0x0010 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAIDirectorEvent
// 0x0010 (0x0010)
struct FFortAIDirectorEvent
{
	EFortAIDirectorEvent                                                                                 Event;                                             // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	class UObject*                                                                                       EventSource;                                       // 0x0004 (0x0004)
	class UObject*                                                                                       EventTarget;                                       // 0x0008 (0x0004)
	float                                                                                                EventValue;                                        // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.MtxPackage
// 0x003C (0x003C)
struct FMtxPackage
{
	FString                                                                                              OfferId;                                           // 0x0000 (0x000C)
	FText                                                                                                Title;                                             // 0x000C (0x000C)
	int32_t                                                                                              TotalAmount;                                       // 0x0018 (0x0004)
	int32_t                                                                                              BonusAmount;                                       // 0x001C (0x0004)
	FText                                                                                                Price;                                             // 0x0020 (0x000C)
	uint8_t                                                                                              UnknownData_2C[0x4];                               // 0x002C (0x0004) MISSED OFFSET
	FText                                                                                                SaleBasePrice;                                     // 0x0030 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPublicAccountInfo
// 0x0018 (0x0018)
struct FFortPublicAccountInfo
{
	int32_t                                                                                              Level;                                             // 0x0000 (0x0004)
	int32_t                                                                                              MaxLevel;                                          // 0x0004 (0x0004)
	int32_t                                                                                              TotalXp;                                           // 0x0008 (0x0004)
	int32_t                                                                                              TotalXpForLevel;                                   // 0x000C (0x0004)
	int32_t                                                                                              LevelXp;                                           // 0x0010 (0x0004)
	int32_t                                                                                              LevelXpForLevel;                                   // 0x0014 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPrivateAccountInfo
// 0x0004 (0x001C)
struct FFortPrivateAccountInfo : public FFortPublicAccountInfo
{
	int32_t                                                                                              MtxBalance;                                        // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.MyTownBannerData
// 0x00E8 (0x00E8)
struct FMyTownBannerData
{
	FSlateBrush                                                                                          BigBannerImage;                                    // 0x0000 (0x0074)
	FSlateBrush                                                                                          SmallBannerImage;                                  // 0x0074 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortHomeBaseInfo
// 0x011C (0x011C)
struct FFortHomeBaseInfo
{
	int32_t                                                                                              Rating;                                            // 0x0000 (0x0004)
	int32_t                                                                                              PartyRating;                                       // 0x0004 (0x0004)
	FMyTownBannerData                                                                                    Banner;                                            // 0x0008 (0x00E8)
	FLinearColor                                                                                         Color;                                             // 0x00F0 (0x0010)
	FText                                                                                                Name;                                              // 0x0100 (0x000C)
	TArray<int32_t>                                                                                      Resources;                                         // 0x010C (0x000C)
	bool                                                                                                 ValidData;                                         // 0x0118 (0x0001)
	uint8_t                                                                                              UnknownData_119[0x3];                              // 0x0119 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortTeamMemberInfo
// 0x01E8 (0x01E8)
struct FFortTeamMemberInfo
{
	FUniqueNetIdRepl                                                                                     MemberUniqueId;                                    // 0x0000 (0x0008)
	FUniqueNetIdRepl                                                                                     PartyLeaderUniqueId;                               // 0x0008 (0x0008)
	FText                                                                                                PlayerName;                                        // 0x0010 (0x000C)
	bool                                                                                                 bPartyLeader;                                      // 0x001C (0x0001)
	bool                                                                                                 bIsInZone;                                         // 0x001D (0x0001)
	uint8_t                                                                                              UnknownData_1E[0x2];                               // 0x001E (0x0002) MISSED OFFSET
	int32_t                                                                                              NumPlayersInParty;                                 // 0x0020 (0x0004)
	int32_t                                                                                              PlayerIndex;                                       // 0x0024 (0x0004)
	EFortTeam                                                                                            TeamAffiliation;                                   // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	FText                                                                                                HeroClass;                                         // 0x002C (0x000C)
	FText                                                                                                HeroLevel;                                         // 0x0038 (0x000C)
	int32_t                                                                                              HeroXP;                                            // 0x0044 (0x0004)
	class UFortItem*                                                                                     HeroItem;                                          // 0x0048 (0x0004)
	TArray<class UFortItem*>                                                                             SelectedGadgetItems;                               // 0x004C (0x000C)
	FSlateBrush                                                                                          HeroIcon;                                          // 0x0058 (0x0074)
	FFortHomeBaseInfo                                                                                    HomeBaseInfo;                                      // 0x00CC (0x011C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingUpgradeAttribute
// 0x0018 (0x0018)
struct FBuildingUpgradeAttribute
{
	bool                                                                                                 bAchieved;                                         // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	int32_t                                                                                              Level;                                             // 0x0004 (0x0004)
	int32_t                                                                                              CurrentLevel;                                      // 0x0008 (0x0004)
	FText                                                                                                DisplayName;                                       // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingUpgradeCost
// 0x000C (0x000C)
struct FBuildingUpgradeCost
{
	bool                                                                                                 bAchieved;                                         // 0x0000 (0x0001)
	EFortPersistentResources                                                                             Type;                                              // 0x0001 (0x0001)
	uint8_t                                                                                              UnknownData_2[0x2];                                // 0x0002 (0x0002) MISSED OFFSET
	int32_t                                                                                              Cost;                                              // 0x0004 (0x0004)
	int32_t                                                                                              Available;                                         // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingUpgradeItemCost
// 0x0010 (0x0010)
struct FBuildingUpgradeItemCost
{
	bool                                                                                                 bAchieved;                                         // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	class UFortItemDefinition*                                                                           Item;                                              // 0x0004 (0x0004)
	int32_t                                                                                              Quantity;                                          // 0x0008 (0x0004)
	int32_t                                                                                              Available;                                         // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingUpgradeRequirementsForLevel
// 0x002C (0x002C)
struct FBuildingUpgradeRequirementsForLevel
{
	bool                                                                                                 bAllAchieved;                                      // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	int32_t                                                                                              AccountLevel;                                      // 0x0004 (0x0004)
	TArray<FBuildingUpgradeAttribute>                                                                    Attributes;                                        // 0x0008 (0x000C)
	TArray<FBuildingUpgradeCost>                                                                         Costs;                                             // 0x0014 (0x000C)
	TArray<FBuildingUpgradeItemCost>                                                                     ItemCosts;                                         // 0x0020 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortQuestReward
// 0x0008 (0x0008)
struct FFortQuestReward
{
	class UFortItem*                                                                                     Item;                                              // 0x0000 (0x0004)
	int32_t                                                                                              Quantity;                                          // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortMultiSizeBrush
// 0x02B8 (0x02B8)
struct FFortMultiSizeBrush
{
	FSlateBrush                                                                                          Brush_XXS;                                         // 0x0000 (0x0074)
	FSlateBrush                                                                                          Brush_XS;                                          // 0x0074 (0x0074)
	FSlateBrush                                                                                          Brush_S;                                           // 0x00E8 (0x0074)
	FSlateBrush                                                                                          Brush_M;                                           // 0x015C (0x0074)
	FSlateBrush                                                                                          Brush_L;                                           // 0x01D0 (0x0074)
	FSlateBrush                                                                                          Brush_XL;                                          // 0x0244 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAttributeDetailsInfo
// 0x02E8 (0x02E8)
struct FFortAttributeDetailsInfo
{
	FGameplayTagContainer                                                                                RequiredTags;                                      // 0x0000 (0x0018)
	FFortMultiSizeBrush                                                                                  Icon;                                              // 0x0018 (0x02B8)
	FText                                                                                                DisplayName;                                       // 0x02D0 (0x000C)
	FText                                                                                                Description;                                       // 0x02DC (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAttributeInfo
// 0x0024 (0x0024)
struct FFortAttributeInfo
{
	FGameplayAttribute                                                                                   Attribute;                                         // 0x0000 (0x0004)
	EFortAttributeDisplay                                                                                DisplayMethod;                                     // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	FText                                                                                                UnitDisplayName;                                   // 0x0008 (0x000C)
	TArray<FFortAttributeDetailsInfo>                                                                    AttributeDetails;                                  // 0x0014 (0x000C)
	bool                                                                                                 bShowInSummaries;                                  // 0x0020 (0x0001)
	bool                                                                                                 bShowInDifferences;                                // 0x0021 (0x0001)
	bool                                                                                                 bNegativeValuesShouldBeDisplayedPositively;        // 0x0022 (0x0001)
	uint8_t                                                                                              UnknownData_23[0x1];                               // 0x0023 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.SingleBuildingBonusDescription
// 0x0054 (0x0054)
struct FSingleBuildingBonusDescription
{
	FText                                                                                                NumericDescription;                                // 0x0000 (0x000C)
	FFortAttributeInfo                                                                                   AffectedAttributeInfo;                             // 0x000C (0x0024)
	FGameplayTagContainer                                                                                RequiredTags;                                      // 0x0030 (0x0018)
	FText                                                                                                RequiredTagsDescription;                           // 0x0048 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.WorkerSetBonusState
// 0x0010 (0x0010)
struct FWorkerSetBonusState
{
	FGameplayTag                                                                                         SetBonusTag;                                       // 0x0000 (0x0008)
	int32_t                                                                                              CurrentMatchCount;                                 // 0x0008 (0x0004)
	int32_t                                                                                              RequiredMatchCountToActivate;                      // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortQuestObjectiveCompletion
// 0x0014 (0x0014)
struct FFortQuestObjectiveCompletion
{
	FString                                                                                              StatName;                                          // 0x0000 (0x000C)
	EFortQuestObjectiveType                                                                              ObjectiveType;                                     // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET
	int32_t                                                                                              Count;                                             // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.GameSummaryInfo
// 0x0010 (0x0010)
struct FGameSummaryInfo
{
	FString                                                                                              GameSessionID;                                     // 0x0000 (0x000C)
	bool                                                                                                 Completed;                                         // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPlayerDeathReport
// 0x0018 (0x0018)
struct FFortPlayerDeathReport
{
	float                                                                                                ServerTimeForRespawn;                              // 0x0000 (0x0004)
	float                                                                                                LethalDamage;                                      // 0x0004 (0x0004)
	class AFortPlayerState*                                                                              KillerPlayerState;                                 // 0x0008 (0x0004)
	class AFortPawn*                                                                                     KillerPawn;                                        // 0x000C (0x0004)
	class AActor*                                                                                        DamageCauser;                                      // 0x0010 (0x0004)
	uint8_t                                                                                              bDroppedBackpack : 1;                              // 0x0014 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_15[0x3];                               // 0x0015 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.GameplayEffectInfo
// 0x0024 (0x0024)
struct FGameplayEffectInfo
{
	FName                                                                                                Attribute;                                         // 0x0000 (0x0008)
	float                                                                                                Magnitude;                                         // 0x0008 (0x0004)
	FName                                                                                                Operation;                                         // 0x000C (0x0008)
	int32_t                                                                                              Rating;                                            // 0x0014 (0x0004)
	FText                                                                                                NumericDescription;                                // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortClientEvent
// 0x0018 (0x0018)
struct FFortClientEvent
{
	FName                                                                                                CategoryName;                                      // 0x0000 (0x0008)
	FName                                                                                                EventName;                                         // 0x0008 (0x0008)
	class UObject*                                                                                       EventSource;                                       // 0x0010 (0x0004)
	class UObject*                                                                                       EventFocus;                                        // 0x0014 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortEventName
// 0x0010 (0x0010)
struct FFortEventName
{
	FName                                                                                                CategoryName;                                      // 0x0000 (0x0008)
	FName                                                                                                EventName;                                         // 0x0008 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortClientEventName
// 0x0000 (0x0010)
struct FFortClientEventName : public FFortEventName
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortMissionEventName
// 0x0000 (0x0010)
struct FFortMissionEventName : public FFortEventName
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortCatalogMeta
// 0x0010 (0x0010)
struct FFortCatalogMeta
{
	TArray<class UFortAccountItemDefinition*>                                                            ChaseItems;                                        // 0x0000 (0x000C)
	class UFortCardPackItemDefinition*                                                                   PackDefinition;                                    // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortSpawnContext
// 0x001C (0x001C)
struct FFortSpawnContext
{
	EFortTeam                                                                                            Team;                                              // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                Tags;                                              // 0x0004 (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortDailyQuestInfo
// 0x0010 (0x0010)
struct FFortDailyQuestInfo
{
	FName                                                                                                DefaultQuestPack;                                  // 0x0000 (0x0008)
	int32_t                                                                                              MaxActiveDailyQuests;                              // 0x0008 (0x0004)
	int32_t                                                                                              MaxRerollsPerDay;                                  // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortLoginReward
// 0x001B (0x001C)
struct FFortLoginReward : public FTableRowBase
{
	TAssetPtr<UFortAccountItemDefinition>                                                                ItemDefinition;                                    // 0x0000 (0x0018)
	int32_t                                                                                              ItemCount;                                         // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortLocalWildcardData
// 0x0008 (0x0008)
struct FFortLocalWildcardData
{
	FName                                                                                                ColumnName;                                        // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortWildcardData
// 0x000C (0x000C)
struct FFortWildcardData
{
	FName                                                                                                RowName;                                           // 0x0000 (0x0008)
	int32_t                                                                                              Idx;                                               // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.EncounterEnvironmentQueryInfo
// 0x001C (0x001C)
struct FEncounterEnvironmentQueryInfo
{
	class UEnvQuery*                                                                                     EnvironmentQuery;                                  // 0x0000 (0x0004)
	TArray<FEnvNamedValue>                                                                               QueryParams;                                       // 0x0004 (0x000C)
	uint8_t                                                                                              UnknownData_10[0x8];                               // 0x0010 (0x0008) MISSED OFFSET
	bool                                                                                                 bIsDirectional;                                    // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortEncounterSettings
// 0x0030 (0x0030)
struct FFortEncounterSettings
{
	TArray<EFortEncounterDirection>                                                                      ForbiddenSpawnDirections;                          // 0x0000 (0x000C)
	bool                                                                                                 bRiftsDestroyPlayerBuiltBuildings;                 // 0x000C (0x0001)
	bool                                                                                                 bMustFindSpawnPoints;                              // 0x000D (0x0001)
	uint8_t                                                                                              UnknownData_E[0x2];                                // 0x000E (0x0002) MISSED OFFSET
	int32_t                                                                                              NumRiftsToUseOverride;                             // 0x0010 (0x0004)
	class UEnvQuery*                                                                                     RiftSelectionQuery;                                // 0x0014 (0x0004)
	TArray<class AActor*>                                                                                ScriptedSpawnPoints;                               // 0x0018 (0x000C)
	TArray<class AActor*>                                                                                WorkingScriptedSpawnPoints;                        // 0x0024 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.OnTimeHitInfo
// 0x0030 (0x0030)
struct FOnTimeHitInfo
{
	struct FFortniteGame_OnTimeHitCallback__DelegateSignature                                            TimeCallback;                                      // 0x0000 (0x0010)
	uint8_t                                                                                              UnknownData_10[0x20];                              // 0x0010 (0x0020) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortDayPhaseCallbackHandle
// 0x0010 (0x0010)
struct FFortDayPhaseCallbackHandle
{
	uint8_t                                                                                              UnknownData_0[0x10];                               // 0x0000 (0x0010) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.ItemCategory
// 0x02DC (0x02DC)
struct FItemCategory
{
	FGameplayTagContainer                                                                                TagContainer;                                      // 0x0000 (0x0018)
	FText                                                                                                CategoryName;                                      // 0x0018 (0x000C)
	FFortMultiSizeBrush                                                                                  CategoryBrush;                                     // 0x0024 (0x02B8)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.ChoiceDataEntry
// 0x0028 (0x0028)
struct FChoiceDataEntry
{
	FText                                                                                                ButtonText;                                        // 0x0000 (0x000C)
	FText                                                                                                ButtonDescription;                                 // 0x000C (0x000C)
	FText                                                                                                ConfirmText;                                       // 0x0018 (0x000C)
	bool                                                                                                 bEnabled;                                          // 0x0024 (0x0001)
	bool                                                                                                 bRequireConfirmation;                              // 0x0025 (0x0001)
	bool                                                                                                 bCloseAfterSelection;                              // 0x0026 (0x0001)
	uint8_t                                                                                              UnknownData_27[0x1];                               // 0x0027 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.ChoiceData
// 0x0020 (0x0020)
struct FChoiceData
{
	int32_t                                                                                              MenuIdentifier;                                    // 0x0000 (0x0004)
	bool                                                                                                 bShowCloseButton;                                  // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	FText                                                                                                Title;                                             // 0x0008 (0x000C)
	TArray<FChoiceDataEntry>                                                                             Items;                                             // 0x0014 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortMultiSizeMargin
// 0x0060 (0x0060)
struct FFortMultiSizeMargin
{
	FMargin                                                                                              Margin_XXS;                                        // 0x0000 (0x0010)
	FMargin                                                                                              Margin_XS;                                         // 0x0010 (0x0010)
	FMargin                                                                                              Margin_S;                                          // 0x0020 (0x0010)
	FMargin                                                                                              Margin_M;                                          // 0x0030 (0x0010)
	FMargin                                                                                              Margin_L;                                          // 0x0040 (0x0010)
	FMargin                                                                                              Margin_XL;                                         // 0x0050 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortMultiSizeFont
// 0x00F0 (0x00F0)
struct FFortMultiSizeFont
{
	FSlateFontInfo                                                                                       Font_XXS;                                          // 0x0000 (0x0028)
	FSlateFontInfo                                                                                       Font_XS;                                           // 0x0028 (0x0028)
	FSlateFontInfo                                                                                       Font_S;                                            // 0x0050 (0x0028)
	FSlateFontInfo                                                                                       Font_M;                                            // 0x0078 (0x0028)
	FSlateFontInfo                                                                                       Font_L;                                            // 0x00A0 (0x0028)
	FSlateFontInfo                                                                                       Font_XL;                                           // 0x00C8 (0x0028)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortRequirementsInfo
// 0x0020 (0x0020)
struct FFortRequirementsInfo
{
	int32_t                                                                                              CommanderLevel;                                    // 0x0000 (0x0004)
	int32_t                                                                                              PersonalPowerRating;                               // 0x0004 (0x0004)
	int32_t                                                                                              PartyPowerRating;                                  // 0x0008 (0x0004)
	class UFortQuestItemDefinition*                                                                      QuestDefinition;                                   // 0x000C (0x0004)
	FDataTableRowHandle                                                                                  ObjectiveStatHandle;                               // 0x0010 (0x000C)
	class UFortItemDefinition*                                                                           ItemDefinition;                                    // 0x001C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortNavLinkPattern
// 0x0008 (0x0008)
struct FFortNavLinkPattern
{
	int32_t                                                                                              PatternBits;                                       // 0x0000 (0x0004)
	int32_t                                                                                              WildcardBits;                                      // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingActorNavArea
// 0x0004 (0x0004)
struct FBuildingActorNavArea
{
	int32_t                                                                                              AreaBits;                                          // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAIAssignmentIdentifier
// 0x0020 (0x0020)
struct FFortAIAssignmentIdentifier
{
	EAssignmentType                                                                                      AssignmentType;                                    // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                AssignmentGameplayTags;                            // 0x0004 (0x0018)
	EFortTeam                                                                                            AssignmentTeam;                                    // 0x001C (0x0001)
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.AIHotSpotSlotConfig
// 0x001C (0x001C)
struct FAIHotSpotSlotConfig
{
	FVector                                                                                              Offset;                                            // 0x0000 (0x000C)
	FVector                                                                                              Direction;                                         // 0x000C (0x000C)
	EFortHotSpotSlot                                                                                     SlotType;                                          // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.AIHotSpotSlotInfo
// 0x0008 (0x0008)
struct FAIHotSpotSlotInfo
{
	class AAIHotSpot*                                                                                    HotSpot;                                           // 0x0000 (0x0004)
	int32_t                                                                                              SlotIndex;                                         // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.BuildingActorHotSpotDirection
// 0x0018 (0x0018)
struct FBuildingActorHotSpotDirection
{
	class UAIHotSpotConfig*                                                                              HotSpotConfig;                                     // 0x0000 (0x0004)
	FVector                                                                                              Offset;                                            // 0x0004 (0x000C)
	uint8_t                                                                                              bMirrorX : 1;                                      // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bMirrorY : 1;                                      // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	EFortHotSpotDirection                                                                                Direction;                                         // 0x0014 (0x0001)
	uint8_t                                                                                              UnknownData_15[0x3];                               // 0x0015 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortSearchPassState
// 0x001C (0x001C)
struct FFortSearchPassState
{
	int32_t                                                                                              BestSessionIdx;                                    // 0x0000 (0x0004)
	FString                                                                                              WUIDLockSemaphore;                                 // 0x0004 (0x000C)
	bool                                                                                                 bWasCanceled;                                      // 0x0010 (0x0001)
	bool                                                                                                 bWasFailure;                                       // 0x0011 (0x0001)
	EMatchmakingState                                                                                    MatchmakingState;                                  // 0x0012 (0x0001)
	EPartyReservationResult                                                                              LastBeaconResponse;                                // 0x0013 (0x0001)
	uint8_t                                                                                              UnknownData_14[0x8];                               // 0x0014 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortSearchPassParams
// 0x001C (0x001C)
struct FFortSearchPassParams
{
	int32_t                                                                                              ControllerId;                                      // 0x0000 (0x0004)
	FName                                                                                                SessionName;                                       // 0x0004 (0x0008)
	FString                                                                                              BestDatacenterId;                                  // 0x000C (0x000C)
	uint8_t                                                                                              UnknownData_18[0x4];                               // 0x0018 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.MMAttemptState
// 0x000C (0x000C)
struct FMMAttemptState
{
	int32_t                                                                                              BestSessionIdx;                                    // 0x0000 (0x0004)
	int32_t                                                                                              NumSearchResults;                                  // 0x0004 (0x0004)
	EMatchmakingState                                                                                    State;                                             // 0x0008 (0x0001)
	EPartyReservationResult                                                                              LastBeaconResponse;                                // 0x0009 (0x0001)
	uint8_t                                                                                              UnknownData_A[0x2];                                // 0x000A (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.MatchmakingParams
// 0x0064 (0x0064)
struct FMatchmakingParams
{
	int32_t                                                                                              ControllerId;                                      // 0x0000 (0x0004)
	int32_t                                                                                              PartySize;                                         // 0x0004 (0x0004)
	FString                                                                                              DatacenterId;                                      // 0x0008 (0x000C)
	int32_t                                                                                              PlaylistId;                                        // 0x0014 (0x0004)
	int32_t                                                                                              MatchmakingLevel;                                  // 0x0018 (0x0004)
	int32_t                                                                                              MissionPowerMin;                                   // 0x001C (0x0004)
	int32_t                                                                                              MissionPowerMax;                                   // 0x0020 (0x0004)
	FString                                                                                              TheaterId;                                         // 0x0024 (0x000C)
	FString                                                                                              ZoneInstanceId;                                    // 0x0030 (0x000C)
	FString                                                                                              WUID;                                              // 0x003C (0x000C)
	FUniqueNetIdRepl                                                                                     WorldOwnerId;                                      // 0x0048 (0x0008)
	FString                                                                                              SessionId;                                         // 0x0050 (0x000C)
	EMatchmakingStartLocation                                                                            StartWith;                                         // 0x005C (0x0001)
	EMatchmakingFlags                                                                                    Flags;                                             // 0x005D (0x0001)
	uint8_t                                                                                              UnknownData_5E[0x2];                               // 0x005E (0x0002) MISSED OFFSET
	float                                                                                                ChanceToHostOverride;                              // 0x0060 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAbilitySetHandle
// 0x0020 (0x0020)
struct FFortAbilitySetHandle
{
	TWeakObjectPtr<class UAbilitySystemComponent>                                                        TargetAbilitySystemComponent;                      // 0x0000 (0x0008)
	TArray<FGameplayAbilitySpecHandle>                                                                   GrantedAbilityHandles;                             // 0x0008 (0x000C)
	TArray<FActiveGameplayEffectHandle>                                                                  AppliedEffectHandles;                              // 0x0014 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.GameplayEffectApplicationInfo
// 0x0008 (0x0008)
struct FGameplayEffectApplicationInfo
{
	class UClass*                                                                                        GameplayEffect;                                    // 0x0000 (0x0004)
	float                                                                                                Level;                                             // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPresenceBasicInfo
// 0x0018 (0x0018)
struct FFortPresenceBasicInfo
{
	int32_t                                                                                              HomeBaseRating;                                    // 0x0000 (0x0004)
	int32_t                                                                                              BannerPatternIndex;                                // 0x0004 (0x0004)
	FLinearColor                                                                                         BannerColor;                                       // 0x0008 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortZoneInstanceInfo
// 0x003C (0x003C)
struct FFortZoneInstanceInfo
{
	FString                                                                                              WorldId;                                           // 0x0000 (0x000C)
	FString                                                                                              TheaterId;                                         // 0x000C (0x000C)
	FString                                                                                              TheaterMissionId;                                  // 0x0018 (0x000C)
	TAssetPtr<UClass>                                                                                    ZoneThemeClass;                                    // 0x0024 (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortZoneInstanceDetails
// 0x0028 (0x0064)
struct FFortZoneInstanceDetails : public FFortZoneInstanceInfo
{
	TAssetPtr<UClass>                                                                                    MissionGenerator;                                  // 0x003C (0x0018)
	FDataTableRowHandle                                                                                  ZoneDifficultyInfo;                                // 0x0054 (0x000C)
	int32_t                                                                                              TileIndex;                                         // 0x0060 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortSavedModeLoadout
// 0x0018 (0x0018)
struct FFortSavedModeLoadout
{
	FString                                                                                              LoadoutName;                                       // 0x0000 (0x000C)
	TArray<FString>                                                                                      SelectedGadgets;                                   // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPersistentGameplayStatValue
// 0x0010 (0x0010)
struct FFortPersistentGameplayStatValue
{
	FString                                                                                              StatName;                                          // 0x0000 (0x000C)
	int32_t                                                                                              StatValue;                                         // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPersistentGameplayStatContainer
// 0x000C (0x000C)
struct FFortPersistentGameplayStatContainer
{
	TArray<FFortPersistentGameplayStatValue>                                                             GameplayStats;                                     // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.ReplicatedStatValues
// 0x0008 (0x0008)
struct FReplicatedStatValues
{
	int32_t                                                                                              StatValue;                                         // 0x0000 (0x0004)
	int32_t                                                                                              ScoreValue;                                        // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortPlayerScoreReport
// 0x0228 (0x0228)
struct FFortPlayerScoreReport
{
	TWeakObjectPtr<class AFortPlayerState>                                                               PlayerState;                                       // 0x0000 (0x0008)
	FString                                                                                              PlayerName;                                        // 0x0008 (0x000C)
	EFortTeam                                                                                            PlayerTeam;                                        // 0x0014 (0x0001)
	uint8_t                                                                                              UnknownData_15[0x3];                               // 0x0015 (0x0003) MISSED OFFSET
	FReplicatedStatValues                                                                                ReplicatedStats_Campaign[33];                      // 0x0018 (0x0108)
	FReplicatedStatValues                                                                                ReplicatedStats_Zone[33];                          // 0x0120 (0x0108)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortAdvancementInfo
// 0x0020 (0x0020)
struct FFortAdvancementInfo
{
	FString                                                                                              TemplateName;                                      // 0x0000 (0x000C)
	FString                                                                                              InstanceId;                                        // 0x000C (0x000C)
	int32_t                                                                                              Level;                                             // 0x0018 (0x0004)
	int32_t                                                                                              XP;                                                // 0x001C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortGiftingInfo
// 0x0018 (0x0018)
struct FFortGiftingInfo
{
	FString                                                                                              PlayerName;                                        // 0x0000 (0x000C)
	class UFortHeroType*                                                                                 HeroType;                                          // 0x000C (0x0004)
	uint8_t                                                                                              UnknownData_10[0x8];                               // 0x0010 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortItemEntryStateValue
// 0x0010 (0x0010)
struct FFortItemEntryStateValue
{
	int32_t                                                                                              IntValue;                                          // 0x0000 (0x0004)
	FName                                                                                                NameValue;                                         // 0x0004 (0x0008)
	EFortItemEntryState                                                                                  StateType;                                         // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteGame.FortItemEntry
// 0x0070 (0x007C)
struct FFortItemEntry : public FFastArraySerializerItem
{
	int32_t                                                                                              Count;                                             // 0x000C (0x0004)
