#pragma once
#include "FN_Basic.h"

#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_FriendsAndChat_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTags_classes.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortniteUI
*/

// Class /Script/FortniteUI.FortAbstractButtonGroup
// 0x0048 (0x0118)
class UFortAbstractButtonGroup : public UWidget
{
public:
	int32_t                                                                                              SelectedIndex;                                     // 0x00D0 (0x0004)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x00D4 (0x0001)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x00D5 (0x0001)
	uint8_t                                                                                              UnknownData_D6[0x2];                               // 0x00D6 (0x0002) MISSED OFFSET
	FMargin                                                                                              InternalPadding;                                   // 0x00D8 (0x0010)
	ESelectionMode                                                                                       SelectionMode;                                     // 0x00E8 (0x0001)
	EButtonGroupDirection                                                                                LayoutMode;                                        // 0x00E9 (0x0001)
	uint8_t                                                                                              UnknownData_EA[0x2];                               // 0x00EA (0x0002) MISSED OFFSET
	struct FFortniteUI_FortButtonGroupClick__DelegateSignature                                           OnButtonClicked;                                   // 0x00EC (0x000C)
	TArray<FText>                                                                                        DataProvider;                                      // 0x00F8 (0x000C)
	TArray<class UFortButton*>                                                                           Buttons;                                           // 0x0104 (0x000C)
	uint8_t                                                                                              UnknownData_110[0x8];                              // 0x0110 (0x0008) MISSED OFFSET
public:
	void SetDataProvider(TArray<FText> InDataProvider); // Function /Script/FortniteUI.FortAbstractButtonGroup:SetDataProvider
	void HandleButtonClicked(class UFortButton* Button); // Function /Script/FortniteUI.FortAbstractButtonGroup:HandleButtonClicked
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortButtonGroup
// 0x0014 (0x012C)
class UFortButtonGroup : public UFortAbstractButtonGroup
{
public:
	struct FFortniteUI_OnGenerateButton__DelegateSignature                                               OnGenerateButtonEvent;                             // 0x0118 (0x0010)
	class UClass*                                                                                        ButtonClass;                                       // 0x0128 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortTabButtonGroup
// 0x0014 (0x012C)
class UFortTabButtonGroup : public UFortAbstractButtonGroup
{
public:
	struct FFortniteUI_OnGenerateTabButton__DelegateSignature                                            OnGenerateButtonEvent;                             // 0x0118 (0x0010)
	class UClass*                                                                                        ButtonClass;                                       // 0x0128 (0x0004)
public:
	void SetInitialButtonSelection(int32_t INDEX); // Function /Script/FortniteUI.FortTabButtonGroup:SetInitialButtonSelection
	class UFortTabButton* GetTabButton(int32_t INDEX); // Function /Script/FortniteUI.FortTabButtonGroup:GetTabButton
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortActorCanvas
// 0x0008 (0x00E8)
class UFortActorCanvas : public UPanelWidget
{
public:
	uint8_t                                                                                              UnknownData_E0[0x8];                               // 0x00E0 (0x0008) MISSED OFFSET
public:
	class UFortActorCanvasSlot* AddActorIndicator(class UFortActorIndicatorWidget* Indicator); // Function /Script/FortniteUI.FortActorCanvas:AddActorIndicator
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortActorCanvasSlot
// 0x0008 (0x002C)
class UFortActorCanvasSlot : public UPanelSlot
{
public:
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0024 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0025 (0x0001)
	bool                                                                                                 bCanAutoRemove;                                    // 0x0026 (0x0001)
	uint8_t                                                                                              UnknownData_27[0x5];                               // 0x0027 (0x0005) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/FortniteUI.FortActorCanvasSlot:SetVerticalAlignment
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/FortniteUI.FortActorCanvasSlot:SetHorizontalAlignment
	void SetCanAutoRemove(bool bAllowAutoRemove); // Function /Script/FortniteUI.FortActorCanvasSlot:SetCanAutoRemove
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortAsyncAction_SetUIState
// 0x0014 (0x0030)
class UFortAsyncAction_SetUIState : public UBlueprintAsyncActionBase
{
public:
	struct FFortniteUI_SetUIStateDelegate__DelegateSignature                                             OnStateEntered;                                    // 0x001C (0x000C)
	class UObject*                                                                                       WorldContextObject;                                // 0x0028 (0x0004)
	uint8_t                                                                                              UnknownData_2C[0x4];                               // 0x002C (0x0004) MISSED OFFSET
public:
	static class UFortAsyncAction_SetUIState* SetUIState(class UObject* InWorldContextObject, EFortUIState DesiredState); // Function /Script/FortniteUI.FortAsyncAction_SetUIState:SetUIState
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortAsyncAction_ShowConfirmation
// 0x0078 (0x0094)
class UFortAsyncAction_ShowConfirmation : public UBlueprintAsyncActionBase
{
public:
	struct FFortniteUI_FortConfirmationResultDelegate__DelegateSignature                                 OnConfirmed;                                       // 0x001C (0x000C)
	struct FFortniteUI_FortConfirmationResultDelegate__DelegateSignature                                 OnDeclined;                                        // 0x0028 (0x000C)
	struct FFortniteUI_FortConfirmationResultDelegate__DelegateSignature                                 OnTimedOut;                                        // 0x0034 (0x000C)
	class UObject*                                                                                       WorldContextObject;                                // 0x0040 (0x0004)
	FFortDialogDescription                                                                               Description;                                       // 0x0044 (0x0050)
public:
	static class UFortAsyncAction_ShowConfirmation* ShowConfirmationDialog(class UObject* InWorldContextObject, FText Title, FText Message, FText ConfirmButtonText, FText DeclineButtonText, class UFortUserWidget* InAdditionalContent, float InDisplayTime); // Function /Script/FortniteUI.FortAsyncAction_ShowConfirmation:ShowConfirmationDialog
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortBangWrapper
// 0x0030 (0x0110)
class UFortBangWrapper : public UContentWidget
{
public:
	uint8_t                                                                                              UnknownData_E0[0x4];                               // 0x00E0 (0x0004) MISSED OFFSET
	EFortBangSize                                                                                        Size;                                              // 0x00E4 (0x0001)
	uint8_t                                                                                              UnknownData_E5[0x3];                               // 0x00E5 (0x0003) MISSED OFFSET
	FVector2D                                                                                            Offset;                                            // 0x00E8 (0x0008)
	EFortBangType                                                                                        BangType;                                          // 0x00F0 (0x0001)
	uint8_t                                                                                              UnknownData_F1[0x3];                               // 0x00F1 (0x0003) MISSED OFFSET
	FName                                                                                                TutorialNameID;                                    // 0x00F4 (0x0008)
	EFortTutorialGlowType                                                                                TutorialGlowType;                                  // 0x00FC (0x0001)
	uint8_t                                                                                              UnknownData_FD[0x13];                              // 0x00FD (0x0013) MISSED OFFSET
public:
	void SetBangVisibility(bool InVisible); // Function /Script/FortniteUI.FortBangWrapper:SetBangVisibility
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortButtonInternalWidget
// 0x000C (0x0384)
class UFortButtonInternalWidget : public UButton
{
public:
	bool                                                                                                 IsClickable;                                       // 0x0378 (0x0001)
	uint8_t                                                                                              UnknownData_379[0xB];                              // 0x0379 (0x000B) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortUserWidget
// 0x008C (0x0244)
class UFortUserWidget : public UUserWidget
{
public:
	uint8_t                                                                                              UnknownData_1B8[0x4];                              // 0x01B8 (0x0004) MISSED OFFSET
	bool                                                                                                 bConsumePointerInput;                              // 0x01BC (0x0001)
	uint8_t                                                                                              UnknownData_1BD[0x87];                             // 0x01BD (0x0087) MISSED OFFSET
public:
	void UnregisterForEvent(FName EventName, struct FFortniteUI_WidgetEventListener__DelegateSignature InCallback); // Function /Script/FortniteUI.FortUserWidget:UnregisterForEvent
	void RegisterForInvalidation(FName InvalidationType, struct FFortniteUI_OnInvalidType__DelegateSignature Callback); // Function /Script/FortniteUI.FortUserWidget:RegisterForInvalidation
	void RegisterForEvent(FName EventName, struct FFortniteUI_WidgetEventListener__DelegateSignature InCallback); // Function /Script/FortniteUI.FortUserWidget:RegisterForEvent
	void PreConstruct(bool IsDesignTime); // Function /Script/FortniteUI.FortUserWidget:PreConstruct
	bool IsInvalid(FName Type) const; // Function /Script/FortniteUI.FortUserWidget:IsInvalid
	void DispatchEvent(FName EventName); // Function /Script/FortniteUI.FortUserWidget:DispatchEvent
	void _BPInvalidate(FName Type); // Function /Script/FortniteUI.FortUserWidget:_BPInvalidate
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortButtonStyle
// 0x15C0 (0x15DC)
class UFortButtonStyle : public UObject
{
public:
	FFortStateStyle                                                                                      NormalBase;                                        // 0x001C (0x02D8)
	FFortStateStyle                                                                                      NormalHovered;                                     // 0x02F4 (0x02D8)
	FFortStateStyle                                                                                      NormalPressed;                                     // 0x05CC (0x02D8)
	FFortStateStyle                                                                                      SelectedBase;                                      // 0x08A4 (0x02D8)
	FFortStateStyle                                                                                      SelectedHovered;                                   // 0x0B7C (0x02D8)
	FFortStateStyle                                                                                      SelectedPressed;                                   // 0x0E54 (0x02D8)
	FFortStateStyle                                                                                      Disabled;                                          // 0x112C (0x02D8)
	FFortMultiSizeMargin                                                                                 ButtonPadding;                                     // 0x1404 (0x0060)
	FFortMultiSizeFont                                                                                   Font;                                              // 0x1464 (0x00F0)
	FFortMultiSizeMargin                                                                                 CustomPadding;                                     // 0x1554 (0x0060)
	FSlateSound                                                                                          PressedSlateSound;                                 // 0x15B4 (0x0014)
	FSlateSound                                                                                          HoveredSlateSound;                                 // 0x15C8 (0x0014)
public:
	static FMargin GetMarginBySizeFromMultiSizeMargin(FFortMultiSizeMargin MultiSizeMargin, EFortBrushSize Size); // Function /Script/FortniteUI.FortButtonStyle:GetMarginBySizeFromMultiSizeMargin
	static FSlateFontInfo GetFontBySizeFromMultiSizeFont(FFortMultiSizeFont MultiSizeFont, EFortBrushSize Size); // Function /Script/FortniteUI.FortButtonStyle:GetFontBySizeFromMultiSizeFont
	FSlateFontInfo GetFontBySize(EFortBrushSize Size) const; // Function /Script/FortniteUI.FortButtonStyle:GetFontBySize
	FMargin GetCustomPaddingBySize(EFortBrushSize Size) const; // Function /Script/FortniteUI.FortButtonStyle:GetCustomPaddingBySize
	FMargin GetButtonPaddingBySize(EFortBrushSize Size) const; // Function /Script/FortniteUI.FortButtonStyle:GetButtonPaddingBySize
	static FSlateBrush GetBrushBySizeFromMultiSizeBrush(FFortMultiSizeBrush MultiSizeBrush, EFortBrushSize Size); // Function /Script/FortniteUI.FortButtonStyle:GetBrushBySizeFromMultiSizeBrush
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortBaseButton
// 0x04F8 (0x073C)
class UFortBaseButton : public UFortUserWidget
{
public:
	uint8_t                                                                                              UnknownData_244[0x4];                              // 0x0244 (0x0004) MISSED OFFSET
	struct FFortniteUI_FortEnabledStateChanged__DelegateSignature                                        EnabledChanged;                                    // 0x0248 (0x000C)
	struct FFortniteUI_FortSelectedStateChanged__DelegateSignature                                       SelectedChanged;                                   // 0x0254 (0x000C)
	struct FFortniteUI_FortBaseButtonClicked__DelegateSignature                                          ButtonClicked;                                     // 0x0260 (0x000C)
	EFortBangSize                                                                                        BangSize;                                          // 0x026C (0x0001)
	uint8_t                                                                                              UnknownData_26D[0x3];                              // 0x026D (0x0003) MISSED OFFSET
	FVector2D                                                                                            BangOffset;                                        // 0x0270 (0x0008)
	EFortBangType                                                                                        BangType;                                          // 0x0278 (0x0001)
	uint8_t                                                                                              UnknownData_279[0x3];                              // 0x0279 (0x0003) MISSED OFFSET
	FName                                                                                                TutorialNameID;                                    // 0x027C (0x0008)
	EFortTutorialGlowType                                                                                TutorialGlowType;                                  // 0x0284 (0x0001)
	uint8_t                                                                                              UnknownData_285[0x3];                              // 0x0285 (0x0003) MISSED OFFSET
	class UClass*                                                                                        Style;                                             // 0x0288 (0x0004)
	EFortBrushSize                                                                                       BrushSize;                                         // 0x028C (0x0001)
	uint8_t                                                                                              UnknownData_28D[0x3];                              // 0x028D (0x0003) MISSED OFFSET
	FSlateSound                                                                                          PressedSlateSoundOverride;                         // 0x0290 (0x0014)
	FSlateSound                                                                                          HoveredSlateSoundOverride;                         // 0x02A4 (0x0014)
	bool                                                                                                 bSelectable;                                       // 0x02B8 (0x0001)
	uint8_t                                                                                              UnknownData_2B9[0x3];                              // 0x02B9 (0x0003) MISSED OFFSET
	FName                                                                                                SelectionGroup;                                    // 0x02BC (0x0008)
	bool                                                                                                 bToggleable;                                       // 0x02C4 (0x0001)
	bool                                                                                                 bClickable;                                        // 0x02C5 (0x0001)
	EButtonClickMethod                                                                                   ClickMethod;                                       // 0x02C6 (0x0001)
	uint8_t                                                                                              UnknownData_2C7[0x475];                            // 0x02C7 (0x0475) MISSED OFFSET
public:
	void SetStyle(class UClass* InStyle); // Function /Script/FortniteUI.FortBaseButton:SetStyle
	void SetSelectionGroup(FName InSelectionGroup); // Function /Script/FortniteUI.FortBaseButton:SetSelectionGroup
	void SetSelected(bool InSelected); // Function /Script/FortniteUI.FortBaseButton:SetSelected
	void SetHovered(bool InHovered); // Function /Script/FortniteUI.FortBaseButton:SetHovered
	void SetClickMethod(EButtonClickMethod InClickMethod); // Function /Script/FortniteUI.FortBaseButton:SetClickMethod
	void SetClickable(bool InClickable); // Function /Script/FortniteUI.FortBaseButton:SetClickable
	void SetBrushSize(EFortBrushSize InSize); // Function /Script/FortniteUI.FortBaseButton:SetBrushSize
	void SetBangVisibility(bool bVisible); // Function /Script/FortniteUI.FortBaseButton:SetBangVisibility
	void OnButtonClicked(); // Function /Script/FortniteUI.FortBaseButton:OnButtonClicked
	class UFortButtonStyle* GetStyle() const; // Function /Script/FortniteUI.FortBaseButton:GetStyle
	int32_t GetSelectionGroupIndex(); // Function /Script/FortniteUI.FortBaseButton:GetSelectionGroupIndex
	bool GetSelected() const; // Function /Script/FortniteUI.FortBaseButton:GetSelected
	FFortStateStyle GetCurrentStateStyle() const; // Function /Script/FortniteUI.FortBaseButton:GetCurrentStateStyle
	FSlateFontInfo GetCurrentFont() const; // Function /Script/FortniteUI.FortBaseButton:GetCurrentFont
	FMargin GetCurrentCustomPadding() const; // Function /Script/FortniteUI.FortBaseButton:GetCurrentCustomPadding
	FMargin GetCurrentButtonPadding() const; // Function /Script/FortniteUI.FortBaseButton:GetCurrentButtonPadding
	void ForceClick(); // Function /Script/FortniteUI.FortBaseButton:ForceClick
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortFrontEndContext
// 0x0118 (0x0134)
class UFortFrontEndContext : public UBlueprintContextBase
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
	struct FFortniteUI_OnCameraChangedDelegate__DelegateSignature                                        OnFrontEndCameraChanged;                           // 0x0020 (0x000C)
	struct FFortniteUI_TheaterSelectedDelegate__DelegateSignature                                        OnTheaterSelected;                                 // 0x002C (0x000C)
	struct FFortniteUI_TheaterDataChangedDelegate__DelegateSignature                                     OnTheaterDataChanged;                              // 0x0038 (0x000C)
	struct FFortniteUI_TheaterTileClickedDelegate__DelegateSignature                                     OnTheaterTileClicked;                              // 0x0044 (0x000C)
	struct FFortniteUI_TheaterTileClickedDelegate__DelegateSignature                                     OnTheaterTileUnselected;                           // 0x0050 (0x000C)
	struct FFortniteUI_RecruitHeroDelegate__DelegateSignature                                            OnRecruitHero;                                     // 0x005C (0x000C)
	struct FFortniteUI_PlayerLoginDelegate__DelegateSignature                                            OnPlayerLoggedIn;                                  // 0x0068 (0x000C)
	struct FFortniteUI_PlayerLoginDelegate__DelegateSignature                                            OnPlayerLoggedOut;                                 // 0x0074 (0x000C)
	struct FFortniteUI_OnOutpostViewLoadedDelegate__DelegateSignature                                    OnOutpostViewLoaded;                               // 0x0080 (0x000C)
	FFortFrontEndFeatureStruct                                                                           Features[9];                                       // 0x008C (0x0090)
	FFortSavedModeLoadout                                                                                CachedModeLoadout;                                 // 0x011C (0x0018)
public:
	void ViewVaultItem(class UFortItem* ItemToView); // Function /Script/FortniteUI.FortFrontEndContext:ViewVaultItem
	void TriggerUIFeedbackEvent(FName EventName) const; // Function /Script/FortniteUI.FortFrontEndContext:TriggerUIFeedbackEvent
	void SkipInitialBenchmark(); // Function /Script/FortniteUI.FortFrontEndContext:SkipInitialBenchmark
	bool ShouldRunInitialBenchmark() const; // Function /Script/FortniteUI.FortFrontEndContext:ShouldRunInitialBenchmark
	void SetSelectedTheater(int32_t TheaterIndex); // Function /Script/FortniteUI.FortFrontEndContext:SetSelectedTheater
	void SetPersonalHeroChoice(class UFortHero* Hero); // Function /Script/FortniteUI.FortFrontEndContext:SetPersonalHeroChoice
	void SetHeroChoice(int32_t PartyMemberIndex, class UFortHero* Hero); // Function /Script/FortniteUI.FortFrontEndContext:SetHeroChoice
	void SetFrontEndCamera(EFrontEndCamera NewState); // Function /Script/FortniteUI.FortFrontEndContext:SetFrontEndCamera
	void SelectGadgetForSlot(int32_t Slot, class UFortItemDefinition* GadgetDefinition); // Function /Script/FortniteUI.FortFrontEndContext:SelectGadgetForSlot
	void SelectDefaultTheaterTile(); // Function /Script/FortniteUI.FortFrontEndContext:SelectDefaultTheaterTile
	void RunBenchmarkAndApplyBestSettings(); // Function /Script/FortniteUI.FortFrontEndContext:RunBenchmarkAndApplyBestSettings
	void NotifyCreateBuildingClosed(class UHomeBaseBuilding* Building); // Function /Script/FortniteUI.FortFrontEndContext:NotifyCreateBuildingClosed
	void MarkSeenItemsInVault(); // Function /Script/FortniteUI.FortFrontEndContext:MarkSeenItemsInVault
	bool LoadOutpostView(int32_t TheaterSlot); // Function /Script/FortniteUI.FortFrontEndContext:LoadOutpostView
	bool IsFabricatorDisintegrating(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:IsFabricatorDisintegrating
	bool IsActiveTileMissionValid(); // Function /Script/FortniteUI.FortFrontEndContext:IsActiveTileMissionValid
	bool GetTileMissionDetails(class AFortTheaterMapTile* Tile, FFortMissionDetails MissionDetails) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTileMissionDetails
	EFortTheaterType GetTheaterType(int32_t TheaterIndex) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTheaterType
	int32_t GetTheaterRegionCount(int32_t TheaterIndex) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTheaterRegionCount
	FText GetTheaterName(int32_t TheaterIndex) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTheaterName
	FText GetTheaterDifficultyText(int32_t TheaterIndex) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTheaterDifficultyText
	bool GetTheaterData(int32_t TheaterIndex, FFortTheaterMapData OutTheaterData) const; // Function /Script/FortniteUI.FortFrontEndContext:GetTheaterData
	int32_t GetSelectedTheaterIndex() const; // Function /Script/FortniteUI.FortFrontEndContext:GetSelectedTheaterIndex
	bool GetSelectedTheaterData(FFortTheaterMapData OutTheaterData) const; // Function /Script/FortniteUI.FortFrontEndContext:GetSelectedTheaterData
	void GetSelectableGadgets(TArray<class UFortWorldItem*> SelectableGadgets, TArray<class UFortWorldItem*> LastSelectedGadgets); // Function /Script/FortniteUI.FortFrontEndContext:GetSelectableGadgets
	FSlateBrush GetSchematicXpResourceBrush() const; // Function /Script/FortniteUI.FortFrontEndContext:GetSchematicXpResourceBrush
	class UFortPersistentResourceItemDefinition* GetSchematicResourceItemDefinition() const; // Function /Script/FortniteUI.FortFrontEndContext:GetSchematicResourceItemDefinition
	FText GetRequirementText(FFortRequirementsInfo InRequirements) const; // Function /Script/FortniteUI.FortFrontEndContext:GetRequirementText
	FSlateBrush GetPersonnelXpResourceBrush() const; // Function /Script/FortniteUI.FortFrontEndContext:GetPersonnelXpResourceBrush
	class UFortPersistentResourceItemDefinition* GetPersonnelResourceItemDefinition() const; // Function /Script/FortniteUI.FortFrontEndContext:GetPersonnelResourceItemDefinition
	class UFortPersistentResourceItemDefinition* GetPersistentResourceItemDefinition(EFortPersistentResources ResourceType); // Function /Script/FortniteUI.FortFrontEndContext:GetPersistentResourceItemDefinition
	void GetOutpostStructureUpgradeCost(int32_t TheaterSlot, int32_t UpgradeLevel, class UFortOutpostItemDefinition* OutpostStructure, TArray<FFortItemQuantityPair> OutWorldItems, TArray<FFortItemQuantityPair> OutAccountItems) const; // Function /Script/FortniteUI.FortFrontEndContext:GetOutpostStructureUpgradeCost
	int32_t GetOutpostStructureMaxLevel(int32_t TheaterSlot, class UFortOutpostItemDefinition* OutpostStructure) const; // Function /Script/FortniteUI.FortFrontEndContext:GetOutpostStructureMaxLevel
	int32_t GetOutpostStructureLevel(int32_t TheaterSlot, class UFortOutpostItemDefinition* OutpostStructure) const; // Function /Script/FortniteUI.FortFrontEndContext:GetOutpostStructureLevel
	int32_t GetNumberOfItemsInStorageVault(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetNumberOfItemsInStorageVault
	int32_t GetMaxNumberOfItemsInStorageVault(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetMaxNumberOfItemsInStorageVault
	class UFortItemDefinition* GetItemFromItemQuantityPair(FFortItemQuantityPair InPair) const; // Function /Script/FortniteUI.FortFrontEndContext:GetItemFromItemQuantityPair
	class AFortPlayerPawn* GetHeroPlayerPawnByIndex(int32_t PartyMemberIndex); // Function /Script/FortniteUI.FortFrontEndContext:GetHeroPlayerPawnByIndex
	class UFortWorldItemDefinition* GetHarvestingToolForLevel(int32_t TheaterSlot, int32_t InHarvestingOptimizerLevel) const; // Function /Script/FortniteUI.FortFrontEndContext:GetHarvestingToolForLevel
	EFrontEndCamera GetFrontEndCamera() const; // Function /Script/FortniteUI.FortFrontEndContext:GetFrontEndCamera
	EFortFrontEndFeatureState GetFeatureState(EFortFrontEndFeature Feature) const; // Function /Script/FortniteUI.FortFrontEndContext:GetFeatureState
	int32_t GetFabricatorStoredGooAmount(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetFabricatorStoredGooAmount
	int32_t GetFabricatorMaxCapacity(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetFabricatorMaxCapacity
	int32_t GetFabricatorIncomingGooAmount(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetFabricatorIncomingGooAmount
	int32_t GetFabricatorDisintegrationSecondsRemaining(int32_t TheaterSlot) const; // Function /Script/FortniteUI.FortFrontEndContext:GetFabricatorDisintegrationSecondsRemaining
	EFrontEndCamera GetDesiredPlayButtonCamera() const; // Function /Script/FortniteUI.FortFrontEndContext:GetDesiredPlayButtonCamera
	FText GetCurrentTheaterName() const; // Function /Script/FortniteUI.FortFrontEndContext:GetCurrentTheaterName
	TArray<FGameDifficultyInfo> GetAvailibleDifficulties() const; // Function /Script/FortniteUI.FortFrontEndContext:GetAvailibleDifficulties
	FFortMultiSizeBrush GetAttributeIcon(FFortAttributeInfo InAttribute, FGameplayTagContainer InRequiredTags); // Function /Script/FortniteUI.FortFrontEndContext:GetAttributeIcon
	FText GetAttributeDisplayName(FFortAttributeInfo InAttribute, FGameplayTagContainer InRequiredTags); // Function /Script/FortniteUI.FortFrontEndContext:GetAttributeDisplayName
	FText GetAttributeDescription(FFortAttributeInfo InAttribute, FGameplayTagContainer InRequiredTags); // Function /Script/FortniteUI.FortFrontEndContext:GetAttributeDescription
	bool GetAllTheaterData(TArray<FFortTheaterMapData> OutAllTheaterData) const; // Function /Script/FortniteUI.FortFrontEndContext:GetAllTheaterData
	bool GetActiveTileMissionDetails(FFortMissionDetails MissionDetails) const; // Function /Script/FortniteUI.FortFrontEndContext:GetActiveTileMissionDetails
	class AFortTheaterMapTile* GetActiveTile() const; // Function /Script/FortniteUI.FortFrontEndContext:GetActiveTile
	void GetAccountLevelUpRewards(TArray<FFortItemQuantityPair> Rewards, int32_t AccountLevel) const; // Function /Script/FortniteUI.FortFrontEndContext:GetAccountLevelUpRewards
	void ForceSetFeatureState(EFortFrontEndFeature Feature, EFortFrontEndFeatureState State); // Function /Script/FortniteUI.FortFrontEndContext:ForceSetFeatureState
	void CreateKeepMenu(class UNativeWidgetHost* InNativeWidgetHost, class UHomeBaseBuilding* Building) const; // Function /Script/FortniteUI.FortFrontEndContext:CreateKeepMenu
	void ClearSelectedTheater(); // Function /Script/FortniteUI.FortFrontEndContext:ClearSelectedTheater
	void ClearNativeWidget(class UNativeWidgetHost* InNativeWidgetHost); // Function /Script/FortniteUI.FortFrontEndContext:ClearNativeWidget
	void BindToFeatureStateAndInitialize(EFortFrontEndFeature Feature, struct FFortniteUI_FrontEndFeatureStateChangedListener__DelegateSignature Delegate); // Function /Script/FortniteUI.FortFrontEndContext:BindToFeatureStateAndInitialize
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGlobalUIContext
// 0x014C (0x0168)
class UFortGlobalUIContext : public UBlueprintContextBase
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
	struct FFortniteUI_OnKeybindsChangedDelegate__DelegateSignature                                      OnKeybindsChanged;                                 // 0x0020 (0x000C)
	struct FFortniteUI_OnTeamPowerChanged__DelegateSignature                                             OnTeamPowerChanged;                                // 0x002C (0x000C)
	struct FUMG_OnDragDropMulticast__DelegateSignature                                                   DragAndDropStartedDelegate;                        // 0x0038 (0x000C)
	struct FUMG_OnDragDropMulticast__DelegateSignature                                                   DragAndDropEndedDelegate;                          // 0x0044 (0x000C)
	struct FUFortGlobalUIContext_OnNetworkErrorDelegate__DelegateSignature                               OnNetworkError;                                    // 0x0050 (0x000C)
	struct FUFortGlobalUIContext_OnQueryFortBackendVersionDelegate__DelegateSignature                    OnQueryFortBackendVersionComplete;                 // 0x005C (0x000C)
	uint8_t                                                                                              UnknownData_68[0x18];                              // 0x0068 (0x0018) MISSED OFFSET
	TMap<FName, class UFortUIMessageManager*>                                                            MessageManagersByName;                             // 0x0080 (0x003C)
	FFortUIFeatureStruct                                                                                 Features[3];                                       // 0x00BC (0x0030)
	uint8_t                                                                                              UnknownData_EC[0x78];                              // 0x00EC (0x0078) MISSED OFFSET
	bool                                                                                                 bIsUIVisible;                                      // 0x0164 (0x0001)
	uint8_t                                                                                              UnknownData_165[0x3];                              // 0x0165 (0x0003) MISSED OFFSET
public:
	void UnregisterToReceiveNotifications(); // Function /Script/FortniteUI.FortGlobalUIContext:UnregisterToReceiveNotifications
	void UnregisterScriptedAction(class UClass* ScriptedAction); // Function /Script/FortniteUI.FortGlobalUIContext:UnregisterScriptedAction
	void TakeScreenshot(struct FFortniteUI_ScreenshotCaptured__DelegateSignature Callback); // Function /Script/FortniteUI.FortGlobalUIContext:TakeScreenshot
	void ShowBang(EFortBangType Type); // Function /Script/FortniteUI.FortGlobalUIContext:ShowBang
	bool ShouldCloseMenuOnEscape() const; // Function /Script/FortniteUI.FortGlobalUIContext:ShouldCloseMenuOnEscape
	void SendUINavigationAnalytic(FString Destination, bool bUserInitiated); // Function /Script/FortniteUI.FortGlobalUIContext:SendUINavigationAnalytic
	void SendLeaveZoneAnalytic(); // Function /Script/FortniteUI.FortGlobalUIContext:SendLeaveZoneAnalytic
	void SendExperienceRatingAnalytic(FString RatingType, int32_t StarCount, FString GameSessionID, FString Comment); // Function /Script/FortniteUI.FortGlobalUIContext:SendExperienceRatingAnalytic
	void RemoveNotification(FFortDialogDescription NotificationDescription); // Function /Script/FortniteUI.FortGlobalUIContext:RemoveNotification
	void RegisterToReceiveNotifications(struct FFortniteGame_OnFortNotificationAvailable__DelegateSignature InOnNotifcationAvailable); // Function /Script/FortniteUI.FortGlobalUIContext:RegisterToReceiveNotifications
	void RegisterScriptedActions(TArray<class UClass*> ScriptedActions); // Function /Script/FortniteUI.FortGlobalUIContext:RegisterScriptedActions
	void RegisterScriptedAction(class UClass* ScriptedAction); // Function /Script/FortniteUI.FortGlobalUIContext:RegisterScriptedAction
	void QuitGame(); // Function /Script/FortniteUI.FortGlobalUIContext:QuitGame
	void QueryGameBackendVersion(); // Function /Script/FortniteUI.FortGlobalUIContext:QueryGameBackendVersion
	void ProcessNotificationResult(EFortDialogResult InResult, FFortDialogDescription NotificationDescription); // Function /Script/FortniteUI.FortGlobalUIContext:ProcessNotificationResult
	void OnQueryFortBackendVersionDelegate__DelegateSignature(FFortBackendVersion FortBackendVersion); // DelegateFunction /Script/FortniteUI.FortGlobalUIContext:OnQueryFortBackendVersionDelegate__DelegateSignature
	void OnNetworkErrorDelegate__DelegateSignature(FText NetworkErrorMessage); // DelegateFunction /Script/FortniteUI.FortGlobalUIContext:OnNetworkErrorDelegate__DelegateSignature
	void Logout(); // Function /Script/FortniteUI.FortGlobalUIContext:Logout
	bool IsUIVisible() const; // Function /Script/FortniteUI.FortGlobalUIContext:IsUIVisible
	bool IsInZone() const; // Function /Script/FortniteUI.FortGlobalUIContext:IsInZone
	bool IsInOutpostZone() const; // Function /Script/FortniteUI.FortGlobalUIContext:IsInOutpostZone
	bool IsHUDVisible(); // Function /Script/FortniteUI.FortGlobalUIContext:IsHUDVisible
	bool IsBluGloEnabled(); // Function /Script/FortniteUI.FortGlobalUIContext:IsBluGloEnabled
	void HideBang(EFortBangType Type); // Function /Script/FortniteUI.FortGlobalUIContext:HideBang
	FString GetWatermark(); // Function /Script/FortniteUI.FortGlobalUIContext:GetWatermark
	void GetTeamPower(int32_t TeamPower, int32_t PersonalPower) const; // Function /Script/FortniteUI.FortGlobalUIContext:GetTeamPower
	class UFortQuestManager* GetQuestManager() const; // Function /Script/FortniteUI.FortGlobalUIContext:GetQuestManager
	bool GetNextNotification(FFortDialogDescription NotifcationDescription); // Function /Script/FortniteUI.FortGlobalUIContext:GetNextNotification
	class UFortUIMessageManager* GetMessageManager(FName ManagerName, bool bCreatedNew); // Function /Script/FortniteUI.FortGlobalUIContext:GetMessageManager
	FGameSummaryInfo GetLastGameSummaryInfo() const; // Function /Script/FortniteUI.FortGlobalUIContext:GetLastGameSummaryInfo
	FText GetKeyTextForAction(FName Action) const; // Function /Script/FortniteUI.FortGlobalUIContext:GetKeyTextForAction
	FKey GetKeyForAction(FName Action) const; // Function /Script/FortniteUI.FortGlobalUIContext:GetKeyForAction
	FFortBackendVersion GetGameBackendVersion(); // Function /Script/FortniteUI.FortGlobalUIContext:GetGameBackendVersion
	EFortUIFeatureState GetFeatureState(EFortUIFeature Feature) const; // Function /Script/FortniteUI.FortGlobalUIContext:GetFeatureState
	FString GetBackendName(); // Function /Script/FortniteUI.FortGlobalUIContext:GetBackendName
	EFortInputPreset GetActiveKeybindSet() const; // Function /Script/FortniteUI.FortGlobalUIContext:GetActiveKeybindSet
	void DisplayStateContent(bool bDisplay); // Function /Script/FortniteUI.FortGlobalUIContext:DisplayStateContent
	void ClearSelectionGroup(FName SelectionGroup); // Function /Script/FortniteUI.FortGlobalUIContext:ClearSelectionGroup
	void ClearLastGameSummaryInfo() const; // Function /Script/FortniteUI.FortGlobalUIContext:ClearLastGameSummaryInfo
	void CheckNetworkError(); // Function /Script/FortniteUI.FortGlobalUIContext:CheckNetworkError
	static void CheckFlag(FString FlagName, EFlagStatus OutStatus); // Function /Script/FortniteUI.FortGlobalUIContext:CheckFlag
	void BindToFeatureStateAndInitialize(EFortUIFeature Feature, struct FFortniteUI_UIFeatureStateChangedListener__DelegateSignature Delegate); // Function /Script/FortniteUI.FortGlobalUIContext:BindToFeatureStateAndInitialize
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGridPickerTile
// 0x0008 (0x024C)
class UFortGridPickerTile : public UFortUserWidget
{
public:
	class UObject*                                                                                       Data;                                              // 0x0244 (0x0004)
	class UFortGridWidgetBase*                                                                           Owner;                                             // 0x0248 (0x0004)
public:
	void SetData(class UObject* InData); // Function /Script/FortniteUI.FortGridPickerTile:SetData
	void OnMouseLeave(); // Function /Script/FortniteUI.FortGridPickerTile:OnMouseLeave
	void OnMouseEnter(); // Function /Script/FortniteUI.FortGridPickerTile:OnMouseEnter
	void OnClicked(); // Function /Script/FortniteUI.FortGridPickerTile:OnClicked
	void ForwardClicked(); // Function /Script/FortniteUI.FortGridPickerTile:ForwardClicked
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGridWidgetBase
// 0x010C (0x01EC)
class UFortGridWidgetBase : public UContentWidget
{
public:
	class UClass*                                                                                        ClearWidgetType;                                   // 0x00E0 (0x0004)
	float                                                                                                TileWidth;                                         // 0x00E4 (0x0004)
	float                                                                                                TileHeight;                                        // 0x00E8 (0x0004)
	int32_t                                                                                              TilesAcross;                                       // 0x00EC (0x0004)
	int32_t                                                                                              TilesDown;                                         // 0x00F0 (0x0004)
	bool                                                                                                 bShrinkToFit;                                      // 0x00F4 (0x0001)
	uint8_t                                                                                              UnknownData_F5[0x3];                               // 0x00F5 (0x0003) MISSED OFFSET
	float                                                                                                PeekOverflowTilePercentage;                        // 0x00F8 (0x0004)
	FMargin                                                                                              TilePadding;                                       // 0x00FC (0x0010)
	FSlateBrush                                                                                          GridBackground;                                    // 0x010C (0x0074)
	FMargin                                                                                              GridBackgroundPadding;                             // 0x0180 (0x0010)
	TArray<class UObject*>                                                                               DataProvider;                                      // 0x0190 (0x000C)
	struct FFortniteUI_GridPickerTileEvent__DelegateSignature                                            OnTileGenerated;                                   // 0x019C (0x000C)
	struct FFortniteUI_GridPickerTileEvent__DelegateSignature                                            OnTileClicked;                                     // 0x01A8 (0x000C)
	struct FFortniteUI_GridPickerTileEvent__DelegateSignature                                            OnMouseEnterTile;                                  // 0x01B4 (0x000C)
	struct FFortniteUI_GridPickerTileEvent__DelegateSignature                                            OnMouseLeaveTile;                                  // 0x01C0 (0x000C)
	class UClass*                                                                                        TileWidgetType;                                    // 0x01CC (0x0004)
	EGridSortKind                                                                                        SortKind;                                          // 0x01D0 (0x0001)
	bool                                                                                                 bReversed;                                         // 0x01D1 (0x0001)
	uint8_t                                                                                              UnknownData_1D2[0x2];                              // 0x01D2 (0x0002) MISSED OFFSET
	struct FFortniteUI_GetSortKeyFor__DelegateSignature                                                  GetSortKeyFor;                                     // 0x01D4 (0x0010)
	uint8_t                                                                                              UnknownData_1E4[0x8];                              // 0x01E4 (0x0008) MISSED OFFSET
public:
	void SetTileWidth(float Width); // Function /Script/FortniteUI.FortGridWidgetBase:SetTileWidth
	void SetTilesDown(int32_t Down); // Function /Script/FortniteUI.FortGridWidgetBase:SetTilesDown
	void SetTilesAcross(int32_t Across); // Function /Script/FortniteUI.FortGridWidgetBase:SetTilesAcross
	void SetTilePadding(FMargin Padding); // Function /Script/FortniteUI.FortGridWidgetBase:SetTilePadding
	void SetTileHeight(float Height); // Function /Script/FortniteUI.FortGridWidgetBase:SetTileHeight
	void SetPeekOverflowTilePercentage(float Percent); // Function /Script/FortniteUI.FortGridWidgetBase:SetPeekOverflowTilePercentage
	void SetDataProvider(TArray<class UObject*> Data); // Function /Script/FortniteUI.FortGridWidgetBase:SetDataProvider
	void SetClearWidgetType(class UClass* InClearWidgetType); // Function /Script/FortniteUI.FortGridWidgetBase:SetClearWidgetType
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGridPickerGrid
// 0x0000 (0x0244)
class UFortGridPickerGrid : public UFortUserWidget
{
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGridPickerButton
// 0x0030 (0x021C)
class UFortGridPickerButton : public UFortGridWidgetBase
{
public:
	EMenuPlacement                                                                                       GridPlacement;                                     // 0x01EC (0x0001)
	uint8_t                                                                                              UnknownData_1ED[0x3];                              // 0x01ED (0x0003) MISSED OFFSET
	class UFortGridPickerGrid*                                                                           GridWidget;                                        // 0x01F0 (0x0004)
	bool                                                                                                 bCloseOnTileClicked;                               // 0x01F4 (0x0001)
	uint8_t                                                                                              UnknownData_1F5[0x3];                              // 0x01F5 (0x0003) MISSED OFFSET
	struct FUFortGridPickerButton_CreateGridWidget__DelegateSignature                                    GridWidgetDelegate;                                // 0x01F8 (0x0010)
	struct FUFortGridPickerButton_OnIsGridPickerOpenChanged__DelegateSignature                           OnGridPickerOpenChanged;                           // 0x0208 (0x000C)
	uint8_t                                                                                              UnknownData_214[0x8];                              // 0x0214 (0x0008) MISSED OFFSET
public:
	void SetIsOpen(bool ShouldBeOpen); // Function /Script/FortniteUI.FortGridPickerButton:SetIsOpen
	void OnIsGridPickerOpenChanged__DelegateSignature(bool IsOpen); // DelegateFunction /Script/FortniteUI.FortGridPickerButton:OnIsGridPickerOpenChanged__DelegateSignature
	void OnButtonClicked(); // Function /Script/FortniteUI.FortGridPickerButton:OnButtonClicked
	class UFortGridPickerGrid* CreateGridWidget__DelegateSignature(); // DelegateFunction /Script/FortniteUI.FortGridPickerButton:CreateGridWidget__DelegateSignature
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortGridWidget
// 0x0008 (0x01F4)
class UFortGridWidget : public UFortGridWidgetBase
{
public:
	uint8_t                                                                                              UnknownData_1EC[0x8];                              // 0x01EC (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortHeroManagementContext
// 0x00FC (0x0118)
class UFortHeroManagementContext : public UBlueprintContextBase
{
public:
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnPlayerDataUpdated;                               // 0x001C (0x000C)
	struct FFortniteUI_McpSaveRequestResponse__DelegateSignature                                         OnMcpHeroDeleteResponse;                           // 0x0028 (0x000C)
	struct FFortniteUI_McpSaveRequestResponse__DelegateSignature                                         OnMcpHeroCreateResponse;                           // 0x0034 (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnAvailableHeroesChanged;                          // 0x0040 (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnCurrentHeroChanged;                              // 0x004C (0x000C)
	struct FFortniteUI_McpSaveRequestResponse__DelegateSignature                                         OnMcpAbilityChangeRequestResponse;                 // 0x0058 (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnMcpAbilityChangeRequestSent;                     // 0x0064 (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnAbilitySelectionRolledBack;                      // 0x0070 (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnAvailableAbilityPointsChanged;                   // 0x007C (0x000C)
	struct FFortniteUI_PlayerDataChangedDelegate__DelegateSignature                                      OnHeroStatsChanged;                                // 0x0088 (0x000C)
	class UFortHero*                                                                                     CurrentHero;                                       // 0x0094 (0x0004)
	TArray<class UFortHeroType*>                                                                         AllHeroTypes;                                      // 0x0098 (0x000C)
	uint8_t                                                                                              UnknownData_A4[0x4];                               // 0x00A4 (0x0004) MISSED OFFSET
	class UFortHero*                                                                                     HeroBeingDeleted;                                  // 0x00A8 (0x0004)
	uint8_t                                                                                              UnknownData_AC[0x6C];                              // 0x00AC (0x006C) MISSED OFFSET
public:
	void SetShowingStatsScreen(bool bIsShowingStats); // Function /Script/FortniteUI.FortHeroManagementContext:SetShowingStatsScreen
	bool SetHeroNameFromID(FString HeroId, FString NewName); // Function /Script/FortniteUI.FortHeroManagementContext:SetHeroNameFromID
	bool SetHeroName(FString NewName); // Function /Script/FortniteUI.FortHeroManagementContext:SetHeroName
	bool SetCurrentHero(FString HeroId); // Function /Script/FortniteUI.FortHeroManagementContext:SetCurrentHero
	bool RequestSetTraitDepthFromID(FString HeroId, int32_t TraitIdx, int32_t Depth); // Function /Script/FortniteUI.FortHeroManagementContext:RequestSetTraitDepthFromID
	bool RequestSetTraitDepth(int32_t TraitIdx, int32_t Depth); // Function /Script/FortniteUI.FortHeroManagementContext:RequestSetTraitDepth
	bool RequestDeleteHero(FString HeroId); // Function /Script/FortniteUI.FortHeroManagementContext:RequestDeleteHero
	bool RequestCreateHero(class UFortHeroType* HeroType, FString Name, EFortCustomGender Gender); // Function /Script/FortniteUI.FortHeroManagementContext:RequestCreateHero
	bool RedeemPrevAbilityFromID(FString HeroId, int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:RedeemPrevAbilityFromID
	bool RedeemPrevAbility(int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:RedeemPrevAbility
	void RedeemAllAbilitiesFromID(FString HeroId); // Function /Script/FortniteUI.FortHeroManagementContext:RedeemAllAbilitiesFromID
	bool RedeemAllAbilities(); // Function /Script/FortniteUI.FortHeroManagementContext:RedeemAllAbilities
	bool PurchaseNextAbilityFromID(FString HeroId, int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:PurchaseNextAbilityFromID
	bool PurchaseNextAbility(int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:PurchaseNextAbility
	int32_t NumHeroSlots() const; // Function /Script/FortniteUI.FortHeroManagementContext:NumHeroSlots
	bool IsSkillTreeUnlockedFromID(FString HeroId) const; // Function /Script/FortniteUI.FortHeroManagementContext:IsSkillTreeUnlockedFromID
	bool IsSkillTreeUnlocked() const; // Function /Script/FortniteUI.FortHeroManagementContext:IsSkillTreeUnlocked
	bool IsShowingStatsScreen() const; // Function /Script/FortniteUI.FortHeroManagementContext:IsShowingStatsScreen
	bool IsDeleteHeroEnabled() const; // Function /Script/FortniteUI.FortHeroManagementContext:IsDeleteHeroEnabled
	bool IsCreateHeroEnabled() const; // Function /Script/FortniteUI.FortHeroManagementContext:IsCreateHeroEnabled
	class UFortTrait* GetTraitFromID(FString HeroId, int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetTraitFromID
	int32_t GetTraitDepthFromID(FString HeroId, int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetTraitDepthFromID
	bool GetTraitDepth(int32_t TraitIdx, int32_t Depth) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetTraitDepth
	class UFortTrait* GetTrait(int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetTrait
	int32_t GetNumUnspentAbilityPointsFromID(FString HeroId) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetNumUnspentAbilityPointsFromID
	bool GetNumUnspentAbilityPoints(int32_t NumAbilityPoints) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetNumUnspentAbilityPoints
	int32_t GetNumHeroTraits() const; // Function /Script/FortniteUI.FortHeroManagementContext:GetNumHeroTraits
	int32_t GetNextAbilityCostFromID(FString HeroId, int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetNextAbilityCostFromID
	int32_t GetNextAbilityCost(int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetNextAbilityCost
	int32_t GetMaxNameLength() const; // Function /Script/FortniteUI.FortHeroManagementContext:GetMaxNameLength
	FHeroUIData GetHeroDataFromID(FString HeroId); // Function /Script/FortniteUI.FortHeroManagementContext:GetHeroDataFromID
	bool GetHeroData(FHeroUIData HeroData); // Function /Script/FortniteUI.FortHeroManagementContext:GetHeroData
	TArray<FEmptyHeroSlot> GetEmptyHeroSlots(); // Function /Script/FortniteUI.FortHeroManagementContext:GetEmptyHeroSlots
	void GetDisplayStats(TArray<FFortGameplayEffectModifierDescription> Stats); // Function /Script/FortniteUI.FortHeroManagementContext:GetDisplayStats
	bool GetCurrentHeroID(FString HeroId); // Function /Script/FortniteUI.FortHeroManagementContext:GetCurrentHeroID
	TArray<class UFortAbilityKit*> GetCoreAbilitiesFromID(FString HeroId) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetCoreAbilitiesFromID
	TArray<class UFortAbilityKit*> GetCoreAbilities() const; // Function /Script/FortniteUI.FortHeroManagementContext:GetCoreAbilities
	bool GetAttributeValuesArrayFromID(FString HeroId, TArray<FGameplayAttribute> Attributes, TArray<float> Values) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAttributeValuesArrayFromID
	bool GetAttributeValuesArray(TArray<FGameplayAttribute> Attributes, TArray<float> Values) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAttributeValuesArray
	float GetAttributeValueFromID(FString HeroId, FGameplayAttribute Attribute) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAttributeValueFromID
	float GetAttributeValue(FGameplayAttribute Attribute) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAttributeValue
	TArray<FString> GetAllHeroIDs() const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAllHeroIDs
	int32_t GetAbilityCostFromID(FString HeroId, int32_t TraitIdx, int32_t TraitDepth) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAbilityCostFromID
	int32_t GetAbilityCost(int32_t TraitIdx, int32_t TraitDepth) const; // Function /Script/FortniteUI.FortHeroManagementContext:GetAbilityCost
	void GenerateRandomHeroName(class UDataTable* NameTable, FString Name) const; // Function /Script/FortniteUI.FortHeroManagementContext:GenerateRandomHeroName
	ENameStatus CheckHeroNameValidity(FString Name) const; // Function /Script/FortniteUI.FortHeroManagementContext:CheckHeroNameValidity
	bool CanRedeemAllAbilities() const; // Function /Script/FortniteUI.FortHeroManagementContext:CanRedeemAllAbilities
	bool CanModifyTraitDepthFromID(FString HeroId, int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:CanModifyTraitDepthFromID
	bool CanModifyTraitDepth(int32_t TraitIdx) const; // Function /Script/FortniteUI.FortHeroManagementContext:CanModifyTraitDepth
	bool CanAffordNextAbilityFromID(FString HeroId, int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:CanAffordNextAbilityFromID
	bool CanAffordNextAbility(int32_t TraitIdx); // Function /Script/FortniteUI.FortHeroManagementContext:CanAffordNextAbility
	bool CanAffordAbilityFromID(FString HeroId, int32_t TraitIdx, int32_t TraitDepth); // Function /Script/FortniteUI.FortHeroManagementContext:CanAffordAbilityFromID
	bool CanAffordAbility(int32_t TraitIdx, int32_t TraitDepth); // Function /Script/FortniteUI.FortHeroManagementContext:CanAffordAbility
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteUI.FortHUDContext
// 0x01E0 (0x01FC)
