#pragma once
#include "FN_Basic.h"

#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_parameters.h"
#include "FN_AIModule_enums.h"
#include "FN_AIModule_structs.h"
#include "FN_AIModule_classes.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayAbilities_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTags_classes.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"
#include "FN_Lobby_structs.h"
#include "FN_Lobby_classes.h"
#include "FN_McpProfileSys_structs.h"
#include "FN_McpProfileSys_classes.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"
#include "FN_OnlineSubsystemUtils_classes.h"
#include "FN_Party_enums.h"
#include "FN_Party_structs.h"
#include "FN_Party_classes.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortniteGame
*/

// Class /Script/FortniteGame.BuildingLevelGameplayEffectInfo
// 0x0054 (0x0070)
class UBuildingLevelGameplayEffectInfo : public UObject
{
public:
	FText                                                                                                NumericDescription;                                // 0x001C (0x000C)
	FFortAttributeInfo                                                                                   AttributeInfo;                                     // 0x0028 (0x0024)
	FGameplayTagContainer                                                                                RequiredTags;                                      // 0x004C (0x0018)
	FText                                                                                                RequiredTagsDescription;                           // 0x0064 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AccumulatedGameplayEffectInfo
// 0x0080 (0x009C)
class UAccumulatedGameplayEffectInfo : public UObject
{
public:
	FGameplayEffectInfo                                                                                  AccumulatedEffect;                                 // 0x001C (0x0024)
	int32_t                                                                                              NextUpgradeRating;                                 // 0x0040 (0x0004)
	int32_t                                                                                              AccumulatedEffectCount;                            // 0x0044 (0x0004)
	FFortAttributeInfo                                                                                   AttributeInfo;                                     // 0x0048 (0x0024)
	TArray<FGameplayEffectInfo>                                                                          AllEffects;                                        // 0x006C (0x000C)
	FGameplayTagContainer                                                                                RequiredTags;                                      // 0x0078 (0x0018)
	FText                                                                                                RequiredTagsDescription;                           // 0x0090 (0x000C)
public:
	FGameplayEffectInfo GetRelativeEffectAtRating(int32_t NewRating) const; // Function /Script/FortniteGame.AccumulatedGameplayEffectInfo:GetRelativeEffectAtRating
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotSlot
// 0x0084 (0x00A0)
class UAIHotSpotSlot : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
	FTransform                                                                                           LocalTransform;                                    // 0x0020 (0x0030)
	float                                                                                                Height;                                            // 0x0050 (0x0004)
	float                                                                                                Radius;                                            // 0x0054 (0x0004)
	int32_t                                                                                              UserId;                                            // 0x0058 (0x0004)
	uint8_t                                                                                              bStartEnabled : 1;                                 // 0x005C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bHasCachedAgentData : 1;                           // 0x005C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bHasOverlappingSlots : 1;                          // 0x005C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bIsBlockingOthers : 1;                             // 0x005C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bIsEnabled : 1;                                    // 0x005C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              UnknownData_5D[0x3];                               // 0x005D (0x0003) MISSED OFFSET
	class AAIController*                                                                                 Owner;                                             // 0x0060 (0x0004)
	int32_t                                                                                              SlotIndex;                                         // 0x0064 (0x0004)
	EAIHotSpotSlot                                                                                       SlotState;                                         // 0x0068 (0x0001)
	uint8_t                                                                                              UnknownData_69[0x37];                              // 0x0069 (0x0037) MISSED OFFSET
public:
	void SetSlotState(EAIHotSpotSlot NewState); // Function /Script/FortniteGame.AIHotSpotSlot:SetSlotState
	void SetSlotOwnerAndState(class AAIController* NewOwner, EAIHotSpotSlot NewState); // Function /Script/FortniteGame.AIHotSpotSlot:SetSlotOwnerAndState
	void SetSlotEnabled(bool bNewEnabled); // Function /Script/FortniteGame.AIHotSpotSlot:SetSlotEnabled
	void OnStateChanged(class AAIController* SlotOwner, EAIHotSpotSlot NewState); // Function /Script/FortniteGame.AIHotSpotSlot:OnStateChanged
	bool IsEnabled() const; // Function /Script/FortniteGame.AIHotSpotSlot:IsEnabled
	bool IsAIAllowed(class AAIController* AI) const; // Function /Script/FortniteGame.AIHotSpotSlot:IsAIAllowed
	bool HasUserId() const; // Function /Script/FortniteGame.AIHotSpotSlot:HasUserId
	int32_t GetSlotUserId() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotUserId
	EAIHotSpotSlot GetSlotState() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotState
	FRotator GetSlotRotation() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotRotation
	float GetSlotRadius() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotRadius
	class AAIController* GetSlotOwner() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotOwner
	FVector GetSlotLocation() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotLocation
	int32_t GetSlotIndex() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotIndex
	float GetSlotHeight() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotHeight
	FBox GetSlotBounds() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetSlotBounds
	class AAIHotSpot* GetHotSpot() const; // Function /Script/FortniteGame.AIHotSpotSlot:GetHotSpot
	void ClearSlot(); // Function /Script/FortniteGame.AIHotSpotSlot:ClearSlot
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpot
// 0x00D8 (0x0318)
class AAIHotSpot : public AActor
{
public:
	TArray<class UAIHotSpotSlot*>                                                                        UserSlots;                                         // 0x0240 (0x000C)
	class UAIHotSpotSlotGenerator*                                                                       SlotGenerator;                                     // 0x024C (0x0004)
	TArray<class UAIHotSpotSlot*>                                                                        Slots;                                             // 0x0250 (0x000C)
	class AActor*                                                                                        FocusActor;                                        // 0x025C (0x0004)
	class UClass*                                                                                        FilterClass;                                       // 0x0260 (0x0004)
	FVector                                                                                              CustomNavmeshSearchExtent;                         // 0x0264 (0x000C)
	uint8_t                                                                                              bStartEnabled : 1;                                 // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bAllowSlotlessAssignment : 1;                      // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bAllowClaimingMultipleSlots : 1;                   // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bTrackOverlappingSlots : 1;                        // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bProjectSlotsOnNavmesh : 1;                        // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bCustomNavmeshSearchExtent : 1;                    // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              bIsEnabled : 1;                                    // 0x0270 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x40]
	uint8_t                                                                                              UnknownData_271[0x3];                              // 0x0271 (0x0003) MISSED OFFSET
	TArray<class AAIController*>                                                                         NoSlotAssignees;                                   // 0x0274 (0x000C)
	uint8_t                                                                                              UnknownData_280[0x94];                             // 0x0280 (0x0094) MISSED OFFSET
	class UBillboardComponent*                                                                           SpriteComponent;                                   // 0x0314 (0x0004)
public:
	void SetEnabled(bool bEnabled); // Function /Script/FortniteGame.AIHotSpot:SetEnabled
	int32_t RemoveGroupFromHotspot(TArray<class AAIController*> GroupOfAI); // Function /Script/FortniteGame.AIHotSpot:RemoveGroupFromHotspot
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList); // Function /Script/FortniteGame.AIHotSpot:RemoveFromHotspot
	void OnSlotOccupied(class AAIController* AI, int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotOccupied
	void OnSlotFreed(class AAIController* AI, int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotFreed
	void OnSlotEnabled(int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotEnabled
	void OnSlotDisabled(int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotDisabled
	void OnSlotClaimed(class AAIController* AI, int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotClaimed
	void OnSlotBlocked(class AAIController* AI, int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnSlotBlocked
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot); // Function /Script/FortniteGame.AIHotSpot:OnRemovedSlotlessBehavior
	void OnRemovedBehavior(class AAIController* AI, int32_t INDEX, int32_t UserId, EAIHotSpotSlot PrevState, bool bWasOnWaitingList); // Function /Script/FortniteGame.AIHotSpot:OnRemovedBehavior
	void OnMoveToSlotFinished(class AAIController* AI, int32_t INDEX, int32_t UserId, bool bResult); // Function /Script/FortniteGame.AIHotSpot:OnMoveToSlotFinished
	void OnHotSpotEnabled(); // Function /Script/FortniteGame.AIHotSpot:OnHotSpotEnabled
	void OnHotSpotDisabled(); // Function /Script/FortniteGame.AIHotSpot:OnHotSpotDisabled
	bool OnAssignedSlotlessBehavior(class AAIController* AI); // Function /Script/FortniteGame.AIHotSpot:OnAssignedSlotlessBehavior
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32_t INDEX, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OnAssignedOccupiedBehavior
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32_t INDEX, int32_t UserId, bool bWasOnWaitingList); // Function /Script/FortniteGame.AIHotSpot:OnAssignedClaimedBehavior
	bool OccupySlotByUserId(int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:OccupySlotByUserId
	bool OccupySlotByOwner(class AAIController* AIOwner); // Function /Script/FortniteGame.AIHotSpot:OccupySlotByOwner
	bool OccupySlotByIndex(int32_t INDEX); // Function /Script/FortniteGame.AIHotSpot:OccupySlotByIndex
	bool IsSlotlessAssignmentAllowed() const; // Function /Script/FortniteGame.AIHotSpot:IsSlotlessAssignmentAllowed
	bool IsEnabled() const; // Function /Script/FortniteGame.AIHotSpot:IsEnabled
	bool IsAIAllowed(class AAIController* AI) const; // Function /Script/FortniteGame.AIHotSpot:IsAIAllowed
	bool HasEnabledSlots() const; // Function /Script/FortniteGame.AIHotSpot:HasEnabledSlots
	bool HasAssignedAI(class AAIController* AI, EAIHotSpotAssignmentFilter Filter) const; // Function /Script/FortniteGame.AIHotSpot:HasAssignedAI
	int32_t GetSlotUserIdByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotUserIdByOwner
	int32_t GetSlotUserIdByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotUserIdByIndex
	EAIHotSpotSlot GetSlotStateByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotStateByUserId
	EAIHotSpotSlot GetSlotStateByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotStateByOwner
	EAIHotSpotSlot GetSlotStateByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotStateByIndex
	FRotator GetSlotRotationByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotRotationByUserId
	FRotator GetSlotRotationByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotRotationByOwner
	FRotator GetSlotRotationByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotRotationByIndex
	class AAIController* GetSlotOwnerByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotOwnerByUserId
	class AAIController* GetSlotOwnerByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotOwnerByIndex
	FVector GetSlotLocationByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotLocationByUserId
	FVector GetSlotLocationByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotLocationByOwner
	FVector GetSlotLocationByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotLocationByIndex
	int32_t GetSlotIndexByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotIndexByUserId
	int32_t GetSlotIndexByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotIndexByOwner
	int32_t GetSlotCount(EAIHotSpotSlotFilter Filter) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotCount
	class UAIHotSpotSlot* GetSlotByUserId(int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotByUserId
	class UAIHotSpotSlot* GetSlotByOwner(class AAIController* AIOwner) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotByOwner
	class UAIHotSpotSlot* GetSlotByIndex(int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:GetSlotByIndex
	int32_t GetAssignedAICount(EAIHotSpotAssignmentFilter Filter) const; // Function /Script/FortniteGame.AIHotSpot:GetAssignedAICount
	TArray<class AAIController*> GetAssignedAI(EAIHotSpotAssignmentFilter Filter) const; // Function /Script/FortniteGame.AIHotSpot:GetAssignedAI
	TArray<int32_t> FindBestSlotIndices(TArray<class AAIController*> AI) const; // Function /Script/FortniteGame.AIHotSpot:FindBestSlotIndices
	int32_t FindBestSlotIndex(class AAIController* AI) const; // Function /Script/FortniteGame.AIHotSpot:FindBestSlotIndex
	bool CanUseSlotByUserId(class AAIController* AI, int32_t UserId) const; // Function /Script/FortniteGame.AIHotSpot:CanUseSlotByUserId
	bool CanUseSlotByIndex(class AAIController* AI, int32_t INDEX) const; // Function /Script/FortniteGame.AIHotSpot:CanUseSlotByIndex
	bool AssignToSlotByUserId(class AAIController* AI, int32_t UserId); // Function /Script/FortniteGame.AIHotSpot:AssignToSlotByUserId
	bool AssignToSlotByIndex(class AAIController* AI, int32_t INDEX); // Function /Script/FortniteGame.AIHotSpot:AssignToSlotByIndex
	bool AssignToHotspot(class AAIController* AI); // Function /Script/FortniteGame.AIHotSpot:AssignToHotspot
	int32_t AssignGroupToHotspot(TArray<class AAIController*> GroupOfAI); // Function /Script/FortniteGame.AIHotSpot:AssignGroupToHotspot
	bool AssignFromWaitingList(); // Function /Script/FortniteGame.AIHotSpot:AssignFromWaitingList
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpot
// 0x000C (0x0324)
class AFortAIHotSpot : public AAIHotSpot
{
public:
	uint8_t                                                                                              UnknownData_318[0xC];                              // 0x0318 (0x000C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpot_Building
// 0x0024 (0x0348)
class AFortAIHotSpot_Building : public AFortAIHotSpot
{
public:
	EFortHotSpotDirection                                                                                DirectionType;                                     // 0x0324 (0x0001)
	uint8_t                                                                                              UnknownData_325[0x23];                             // 0x0325 (0x0023) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpot_FakeBuilding
// 0x0000 (0x0324)
class AFortAIHotSpot_FakeBuilding : public AFortAIHotSpot
{
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotConfig
// 0x0014 (0x0030)
class UAIHotSpotConfig : public UDataAsset
{
public:
	TArray<FAIHotSpotSlotConfig>                                                                         Slots;                                             // 0x001C (0x000C)
	uint8_t                                                                                              bDetectUnreachableSlots : 1;                       // 0x0028 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	class UAIHotSpotSlotGenerator*                                                                       SlotGenerator;                                     // 0x002C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotManagerProxy
// 0x0040 (0x005C)
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	uint8_t                                                                                              UnknownData_1C[0x40];                              // 0x001C (0x0040) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.BuildingActorHotSpotConfig
// 0x00AC (0x00C8)
class UBuildingActorHotSpotConfig : public UDataAsset
{
public:
	FBuildingActorHotSpotDirection                                                                       HotSpotPerDirection[6];                            // 0x001C (0x0090)
	FBuildingActorHotSpotDirection                                                                       FallBackConfig;                                    // 0x00AC (0x0018)
	uint8_t                                                                                              bHasDirectionalSetup : 1;                          // 0x00C4 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_C5[0x3];                               // 0x00C5 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpotManager
// 0x0090 (0x00EC)
class UFortAIHotSpotManager : public UAIHotSpotManagerProxy
{
public:
	TAssetPtr<UBuildingActorHotSpotConfig>                                                               FallbackHotspotConfig;                             // 0x005C (0x0018)
	uint8_t                                                                                              UnknownData_74[0x78];                              // 0x0074 (0x0078) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotRenderingComponent
// 0x0000 (0x0430)
class UAIHotSpotRenderingComponent : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpotSlot
// 0x0010 (0x00B0)
class UFortAIHotSpotSlot : public UAIHotSpotSlot
{
public:
	EFortHotSpotSlot                                                                                     SlotType;                                          // 0x00A0 (0x0001)
	uint8_t                                                                                              UnknownData_A1[0xF];                               // 0x00A1 (0x000F) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotSlotGenerator
// 0x0000 (0x001C)
class UAIHotSpotSlotGenerator : public UObject
{
public:
	class AAIHotSpot* GetHotSpot() const; // Function /Script/FortniteGame.AIHotSpotSlotGenerator:GetHotSpot
	void GenerateSlots(); // Function /Script/FortniteGame.AIHotSpotSlotGenerator:GenerateSlots
	class UAIHotSpotSlot* AddSlot(FVector RelativeLocation, FRotator RelativeRotation, class UClass* CustomSlotClass, bool bEnabled) const; // Function /Script/FortniteGame.AIHotSpotSlotGenerator:AddSlot
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
// 0x0040 (0x005C)
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	class UClass*                                                                                        SlotClass;                                         // 0x001C (0x0004)
	FVector                                                                                              MaxExtent;                                         // 0x0020 (0x000C)
	float                                                                                                ExpandBy;                                          // 0x002C (0x0004)
	float                                                                                                OffsetFromEdge;                                    // 0x0030 (0x0004)
	float                                                                                                Spacing;                                           // 0x0034 (0x0004)
	uint8_t                                                                                              bLimitMaxExtent : 1;                               // 0x0038 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_39[0x3];                               // 0x0039 (0x0003) MISSED OFFSET
	EBoundingBoxSlotDirectionCalculation                                                                 SlotDirectionCalculation;                          // 0x003C (0x0001)
	uint8_t                                                                                              UnknownData_3D[0x1F];                              // 0x003D (0x001F) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpotSlotGenerator_OnBoundingBox
// 0x0008 (0x0064)
class UFortAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator_OnBoundingBox
{
public:
	float                                                                                                DistanceForRangedSlots;                            // 0x005C (0x0004)
	float                                                                                                DistanceForHugeSlots;                              // 0x0060 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAIHotSpotSlotGenerator_FromConfig
// 0x0014 (0x0030)
class UFortAIHotSpotSlotGenerator_FromConfig : public UAIHotSpotSlotGenerator
{
public:
	class UAIHotSpotConfig*                                                                              BuildingConfig;                                    // 0x001C (0x0004)
	FVector                                                                                              Offset;                                            // 0x0020 (0x000C)
	uint8_t                                                                                              bMirrorX : 1;                                      // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bMirrorY : 1;                                      // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.BlueprintContextBase
// 0x0000 (0x001C)
class UBlueprintContextBase : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortSessionHelper
// 0x00C0 (0x00DC)
class UFortSessionHelper : public UObject
{
public:
	class UClass*                                                                                        BeaconClientClass;                                 // 0x001C (0x0004)
	class AFortPartyBeaconClient*                                                                        PartyBeaconClient;                                 // 0x0020 (0x0004)
	uint8_t                                                                                              UnknownData_24[0x94];                              // 0x0024 (0x0094) MISSED OFFSET
	FName                                                                                                CurrentSessionName;                                // 0x00B8 (0x0008)
	EPartyReservationResult                                                                              LastBeaconResponse;                                // 0x00C0 (0x0001)
	EFortSessionHelperJoinState                                                                          CurrentJoinState;                                  // 0x00C1 (0x0001)
	EFortSessionHelperJoinResult                                                                         CurrentJoinResult;                                 // 0x00C2 (0x0001)
	uint8_t                                                                                              UnknownData_C3[0x19];                              // 0x00C3 (0x0019) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortSearchPass
// 0x00B4 (0x00D0)
class UFortSearchPass : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x28];                              // 0x001C (0x0028) MISSED OFFSET
	class UFortSessionHelper*                                                                            SessionHelper;                                     // 0x0044 (0x0004)
	uint8_t                                                                                              UnknownData_48[0x8];                               // 0x0048 (0x0008) MISSED OFFSET
	FFortSearchPassParams                                                                                CurrentSearchParams;                               // 0x0050 (0x001C)
	FFortSearchPassState                                                                                 CurrentSearchPassState;                            // 0x006C (0x001C)
	uint8_t                                                                                              UnknownData_88[0x48];                              // 0x0088 (0x0048) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortMatchmakingPolicy
// 0x008C (0x00A8)
class UFortMatchmakingPolicy : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x10];                              // 0x001C (0x0010) MISSED OFFSET
	bool                                                                                                 bMatchmakingInProgress;                            // 0x002C (0x0001)
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
	FName                                                                                                SessionName;                                       // 0x0030 (0x0008)
	FMatchmakingParams                                                                                   CurrentParams;                                     // 0x0038 (0x0064)
	class UFortSearchPass*                                                                               MMPass;                                            // 0x009C (0x0004)
	uint8_t                                                                                              UnknownData_A0[0x8];                               // 0x00A0 (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortMatchmakingCommon
// 0x000C (0x00B4)
class UFortMatchmakingCommon : public UFortMatchmakingPolicy
{
public:
	uint8_t                                                                                              UnknownData_A8[0xC];                               // 0x00A8 (0x000C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortMatchmakingPvE
// 0x0000 (0x00B4)
class UFortMatchmakingPvE : public UFortMatchmakingCommon
{
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortMatchmakingContext
// 0x00C4 (0x00E0)
class UFortMatchmakingContext : public UBlueprintContextBase
{
public:
	struct FFortniteGame_OnMatchmakingStartedDelegate__DelegateSignature                                 OnMatchmakingStarted;                              // 0x001C (0x000C)
	struct FFortniteGame_OnMatchmakingCompletedDelegate__DelegateSignature                               OnMatchmakingComplete;                             // 0x0028 (0x000C)
	struct FFortniteGame_OnMatchmakingStateChangeDelegate__DelegateSignature                             OnMatchmakingStateChange;                          // 0x0034 (0x000C)
	struct FFortniteGame_OnLobbyConnectionStartedDelegate__DelegateSignature                             OnLobbyConnectionAttemptStarted;                   // 0x0040 (0x000C)
	struct FFortniteGame_OnLobbyConnectionAttemptFailedDelegate__DelegateSignature                       OnLobbyConnectionAttemptFailed;                    // 0x004C (0x000C)
	struct FFortniteGame_OnLobbyWaitingForPlayersDelegate__DelegateSignature                             OnLobbyWaitingForPlayers;                          // 0x0058 (0x000C)
	struct FFortniteGame_OnLobbyWaitingForPlayersTimeUpdateDelegate__DelegateSignature                   OnLobbyWaitingForPlayersTimeUpdate;                // 0x0064 (0x000C)
	struct FFortniteGame_OnLobbyStartedDelegate__DelegateSignature                                       OnLobbyStarted;                                    // 0x0070 (0x000C)
	struct FFortniteGame_OnLobbyDisconnected__DelegateSignature                                          OnLobbyDisconnected;                               // 0x007C (0x000C)
	struct FFortniteGame_OnLobbyTimeUpdatedDelegate__DelegateSignature                                   OnLobbyTimeUpdated;                                // 0x0088 (0x000C)
	struct FFortniteGame_OnLobbyTimeExpiredDelegate__DelegateSignature                                   OnLobbyTimeExpired;                                // 0x0094 (0x000C)
	struct FFortniteGame_OnReadyUpStatusChangedDelegate__DelegateSignature                               OnLocalReadyUpStatusChange;                        // 0x00A0 (0x000C)
	struct FFortniteGame_OnBasicErrorDelegate__DelegateSignature                                         OnBasicError;                                      // 0x00AC (0x000C)
	struct FFortniteGame_OnWorldRecordLoadedChangedDelegate__DelegateSignature                           OnWorldRecordLoadedChanged;                        // 0x00B8 (0x000C)
	uint8_t                                                                                              UnknownData_C4[0xC];                               // 0x00C4 (0x000C) MISSED OFFSET
	class UFortMatchmakingPvE*                                                                           StandaloneZoneMatchmaking;                         // 0x00D0 (0x0004)
	struct FFortniteGame_OnOutpostDiscoveryFailure__DelegateSignature                                    OnOutpostDiscoveryFailure;                         // 0x00D4 (0x000C)
public:
	void StartOnboardingMission(); // Function /Script/FortniteGame.FortMatchmakingContext:StartOnboardingMission
	void StartMatchmaking(); // Function /Script/FortniteGame.FortMatchmakingContext:StartMatchmaking
	void StartCriticalMission(int32_t MinMissionPower, int32_t MaxMissionPower); // Function /Script/FortniteGame.FortMatchmakingContext:StartCriticalMission
	void ReadyUp(); // Function /Script/FortniteGame.FortMatchmakingContext:ReadyUp
	void JoinFromLobby(); // Function /Script/FortniteGame.FortMatchmakingContext:JoinFromLobby
	bool IsWorldRecordLoaded(); // Function /Script/FortniteGame.FortMatchmakingContext:IsWorldRecordLoaded
	bool IsOutpostPermitted() const; // Function /Script/FortniteGame.FortMatchmakingContext:IsOutpostPermitted
	bool IsInLobby() const; // Function /Script/FortniteGame.FortMatchmakingContext:IsInLobby
	bool IsConnectedToGame(); // Function /Script/FortniteGame.FortMatchmakingContext:IsConnectedToGame
	float GetLobbyWaitForPlayersTimeRemaining(); // Function /Script/FortniteGame.FortMatchmakingContext:GetLobbyWaitForPlayersTimeRemaining
	bool EnterOutpost(); // Function /Script/FortniteGame.FortMatchmakingContext:EnterOutpost
	void DisconnectFromLobby(); // Function /Script/FortniteGame.FortMatchmakingContext:DisconnectFromLobby
	void CancelMatchmaking(); // Function /Script/FortniteGame.FortMatchmakingContext:CancelMatchmaking
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAbilitySet
// 0x001C (0x0038)
class UFortAbilitySet : public UDataAsset
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
	TArray<class UClass*>                                                                                GameplayAbilities;                                 // 0x0020 (0x000C)
	TArray<FGameplayEffectApplicationInfo>                                                               PassiveGameplayEffects;                            // 0x002C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortTooltipInterface
// 0x0000 (0x001C)
class UFortTooltipInterface : public UInterface
{
public:
	class UClass* GetTooltip() const; // Function /Script/FortniteGame.FortTooltipInterface:GetTooltip
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortTooltipContext
// 0x0008 (0x0024)
class UFortTooltipContext : public UObject
{
public:
	class UAbilitySystemComponent*                                                                       SourceAbilitySystem;                               // 0x001C (0x0004)
	class UAbilitySystemComponent*                                                                       DestAbilitySystem;                                 // 0x0020 (0x0004)
public:
	static class UFortTooltipContext* SpawnTooltipContext(); // Function /Script/FortniteGame.FortTooltipContext:SpawnTooltipContext
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortTooltipMap
// 0x0048 (0x0064)
class UFortTooltipMap : public UDataAsset
{
public:
	uint8_t                                                                                              UnknownData_1C[0x3C];                              // 0x001C (0x003C) MISSED OFFSET
	TArray<FFortTooltipMapEntry>                                                                         Mapping;                                           // 0x0058 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortTooltipManager
// 0x003C (0x0058)
class UFortTooltipManager : public UObject
{
public:
	TMap<class UClass*, class UFortTooltip*>                                                             Tooltips;                                          // 0x001C (0x003C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortItemDefinition
// 0x03FC (0x0418)
class UFortItemDefinition : public UDataAsset
{
public:
	uint8_t                                                                                              UnknownData_1C[0x8];                               // 0x001C (0x0008) MISSED OFFSET
	struct FFortniteGame_FortOnItemDefinitionCountChangedDelegate__DelegateSignature                     OnItemCountChanged;                                // 0x0024 (0x000C)
	EFortItemType                                                                                        ItemType;                                          // 0x0030 (0x0001)
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
	int32_t                                                                                              MinLevel;                                          // 0x0034 (0x0004)
	int32_t                                                                                              MaxLevel;                                          // 0x0038 (0x0004)
	FText                                                                                                DisplayName;                                       // 0x003C (0x000C)
	FText                                                                                                Description;                                       // 0x0048 (0x000C)
	FText                                                                                                DisplayNamePrefix;                                 // 0x0054 (0x000C)
	FText                                                                                                SearchTags;                                        // 0x0060 (0x000C)
	FGameplayTagContainer                                                                                GameplayTags;                                      // 0x006C (0x0018)
	TAssetPtr<UFortAttributeTemplate>                                                                    AttributeTemplate;                                 // 0x0084 (0x0018)
	EFortInventoryFilter                                                                                 FilterOverride;                                    // 0x009C (0x0001)
	uint8_t                                                                                              UnknownData_9D[0x3];                               // 0x009D (0x0003) MISSED OFFSET
	FSlateBrush                                                                                          IconBrush;                                         // 0x00A0 (0x0074)
	FFortMultiSizeBrush                                                                                  MultiSizeIconBrush;                                // 0x0114 (0x02B8)
	uint8_t                                                                                              bIsAccountItem : 1;                                // 0x03CC (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bNeverPersisted : 1;                               // 0x03CC (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_3CD[0x3];                              // 0x03CD (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                SecondaryCategoryOverrideTags;                     // 0x03D0 (0x0018)
	FGameplayTagContainer                                                                                TertiaryCategoryOverrideTags;                      // 0x03E8 (0x0018)
	uint8_t                                                                                              bAllowMultipleStacks : 1;                          // 0x0400 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_401[0x3];                              // 0x0401 (0x0003) MISSED OFFSET
	int32_t                                                                                              MaxStackSize;                                      // 0x0404 (0x0004)
	bool                                                                                                 bPrivateTemplate;                                  // 0x0408 (0x0001)
	EFortTemplateAccess                                                                                  Access;                                            // 0x0409 (0x0001)
	bool                                                                                                 bCalculateRarityFromQualityAndTier;                // 0x040A (0x0001)
	EFortQuality                                                                                         Quality;                                           // 0x040B (0x0001)
	EFortItemTier                                                                                        Tier;                                              // 0x040C (0x0001)
	uint8_t                                                                                              UnknownData_40D[0x3];                              // 0x040D (0x0003) MISSED OFFSET
	class UClass*                                                                                        Tooltip;                                           // 0x0410 (0x0004)
	EFortRarity                                                                                          Rarity;                                            // 0x0414 (0x0001)
	uint8_t                                                                                              UnknownData_415[0x3];                              // 0x0415 (0x0003) MISSED OFFSET
public:
	class UClass* GetTooltip() const; // Function /Script/FortniteGame.FortItemDefinition:GetTooltip
	FText GetSingleLineDescription() const; // Function /Script/FortniteGame.FortItemDefinition:GetSingleLineDescription
	void GetIconBrush(FSlateBrush IconBrush, EFortBrushSize BrushSize) const; // Function /Script/FortniteGame.FortItemDefinition:GetIconBrush
	FText GetDisplayName(bool bBaseName) const; // Function /Script/FortniteGame.FortItemDefinition:GetDisplayName
	TArray<FText> GetDescription() const; // Function /Script/FortniteGame.FortItemDefinition:GetDescription
	class UFortItem* CreateTemporaryItemInstanceBP() const; // Function /Script/FortniteGame.FortItemDefinition:CreateTemporaryItemInstanceBP
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAccountItemDefinition
// 0x0018 (0x0430)
class UFortAccountItemDefinition : public UFortItemDefinition
{
public:
	FCurveTableRowHandle                                                                                 LevelToXpHandle;                                   // 0x0418 (0x000C)
	FCurveTableRowHandle                                                                                 LevelToSacrificeXpHandle;                          // 0x0424 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortWorkerType
// 0x0314 (0x0744)
class UFortWorkerType : public UFortAccountItemDefinition
{
public:
	class UGameplayEffect*                                                                               ManagerEffect;                                     // 0x0430 (0x0004)
	class UFortWorldItemDefinition*                                                                      WorkerWorldItem;                                   // 0x0434 (0x0004)
	bool                                                                                                 bIsManager;                                        // 0x0438 (0x0001)
	uint8_t                                                                                              UnknownData_439[0x3];                              // 0x0439 (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                BuildingSynergyTag;                                // 0x043C (0x0018)
	FGameplayTagContainer                                                                                FixedPersonalityTag;                               // 0x0454 (0x0018)
	FGameplayTagContainer                                                                                FixedSetBonusTag;                                  // 0x046C (0x0018)
	int32_t                                                                                              MatchingPersonalityBonus;                          // 0x0484 (0x0004)
	int32_t                                                                                              MismatchingPersonalityPenalty;                     // 0x0488 (0x0004)
	FSlateBrush                                                                                          CardIconBrush[3];                                  // 0x048C (0x015C)
	FSlateBrush                                                                                          AvatarIconBrush[3];                                // 0x05E8 (0x015C)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortHeroType
// 0x0118 (0x085C)
class UFortHeroType : public UFortWorkerType
{
public:
	TArray<FString>                                                                                      Outfits_Naked;                                     // 0x0744 (0x000C)
	TArray<FString>                                                                                      Outfits_Male;                                      // 0x0750 (0x000C)
	TArray<FString>                                                                                      Outfits_Female;                                    // 0x075C (0x000C)
	class UAnimMontage*                                                                                  IdleAnimation_Male;                                // 0x0768 (0x0004)
	class UAnimMontage*                                                                                  IdleAnimation_Female;                              // 0x076C (0x0004)
	class UFortTrait*                                                                                    PrimaryTrait;                                      // 0x0770 (0x0004)
	class UFortTrait*                                                                                    SecondaryTraits[4];                                // 0x0774 (0x0010)
	class UFortHeroSpecialization*                                                                       DefaultSpecialization;                             // 0x0784 (0x0004)
	TArray<FHeroAbilityKit>                                                                              AbilityKits;                                       // 0x0788 (0x000C)
	TArray<FGameplayEffectApplicationInfo>                                                               CombinedStatGEs;                                   // 0x0794 (0x000C)
	class UClass*                                                                                        CombinedStatSourceGE;                              // 0x07A0 (0x0004)
	TArray<FHeroItem>                                                                                    HeroItems;                                         // 0x07A4 (0x000C)
	FGameplayTagContainer                                                                                RequiredGPTags;                                    // 0x07B0 (0x0018)
	class UFortFeedbackBank*                                                                             MaleOverrideFeedback;                              // 0x07C8 (0x0004)
	class UFortFeedbackBank*                                                                             FemaleOverrideFeedback;                            // 0x07CC (0x0004)
	TAssetPtr<UClass>                                                                                    OverridePawnClass;                                 // 0x07D0 (0x0018)
	FSlateBrush                                                                                          IconBrushSmall;                                    // 0x07E8 (0x0074)
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortTrait
// 0x0044 (0x045C)
class UFortTrait : public UFortItemDefinition
{
public:
	FFortAbilityKitSlot                                                                                  AbilityKitSlots[5];                                // 0x0418 (0x003C)
	FName                                                                                                TraitCostEntryName;                                // 0x0454 (0x0008)
public:
	TArray<FFortAbilityKitSlot> GetAbilityKitSlots(); // Function /Script/FortniteGame.FortTrait:GetAbilityKitSlots
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortAbilityKit
// 0x0144 (0x017C)
class UFortAbilityKit : public UFortAbilitySet
{
public:
	uint8_t                                                                                              UnknownData_38[0x4];                               // 0x0038 (0x0004) MISSED OFFSET
	FText                                                                                                DisplayName;                                       // 0x003C (0x000C)
	TArray<FText>                                                                                        Description;                                       // 0x0048 (0x000C)
	FText                                                                                                TooltipDescription;                                // 0x0054 (0x000C)
	FSlateBrush                                                                                          IconBrush;                                         // 0x0060 (0x0074)
	FSlateBrush                                                                                          PrimaryTraitIconBrushOverride;                     // 0x00D4 (0x0074)
	TArray<class UFortGadgetItemDefinition*>                                                             Gadgets;                                           // 0x0148 (0x000C)
	TArray<FAbilityKitItem>                                                                              Items;                                             // 0x0154 (0x000C)
	TArray<class UFortSchematicItemDefinition*>                                                          AddedSchematics;                                   // 0x0160 (0x000C)
	TArray<class UFortSchematicItemDefinition*>                                                          RemovedSchematics;                                 // 0x016C (0x000C)
	class UClass*                                                                                        Tooltip;                                           // 0x0178 (0x0004)
public:
	TArray<FText> GetDescription() const; // Function /Script/FortniteGame.FortAbilityKit:GetDescription
public:
	static class UClass* StaticClass();
};

// Class /Script/FortniteGame.FortItem
// 0x0024 (0x0040)
class UFortItem : public UObject
{
public:
	struct FFortniteGame_FortOnItemChangedDelegate__DelegateSignature                                    OnItemChanged;                                     // 0x001C (0x000C)
	struct FFortniteGame_FortOnItemDestroyedDelegate__DelegateSignature                                  OnItemDestroyed;                                   // 0x0028 (0x000C)
	uint8_t                                                                                              UnknownData_34[0x8];                               // 0x0034 (0x0008) MISSED OFFSET
	bool                                                                                                 bLoadedFromSave;                                   // 0x003C (0x0001)
	uint8_t                                                                                              UnknownData_3D[0x3];                               // 0x003D (0x0003) MISSED OFFSET
public:
	bool IsSlotted() const; // Function /Script/FortniteGame.FortItem:IsSlotted
	bool IsSchematic() const; // Function /Script/FortniteGame.FortItem:IsSchematic
	bool IsInStorageVault() const; // Function /Script/FortniteGame.FortItem:IsInStorageVault
	bool IsInBackpackOverflow() const; // Function /Script/FortniteGame.FortItem:IsInBackpackOverflow
	bool IsEquipped() const; // Function /Script/FortniteGame.FortItem:IsEquipped
	bool IsEquipable(class AFortPlayerController* EquippingPC) const; // Function /Script/FortniteGame.FortItem:IsEquipable
	bool IsAlterationSlotActive(int32_t SlotIndex) const; // Function /Script/FortniteGame.FortItem:IsAlterationSlotActive
	bool IsActivatable(class AFortPlayerController* FortPC) const; // Function /Script/FortniteGame.FortItem:IsActivatable
	bool HasDurability() const; // Function /Script/FortniteGame.FortItem:HasDurability
	int32_t GetUpgradeCost() const; // Function /Script/FortniteGame.FortItem:GetUpgradeCost
	EFortItemType GetType() const; // Function /Script/FortniteGame.FortItem:GetType
	EFortItemTier GetTier() const; // Function /Script/FortniteGame.FortItem:GetTier
	bool GetTertiaryCategory(FText ItemCategoryText, FSlateBrush ItemCategoryBrush, EFortBrushSize BrushSize) const; // Function /Script/FortniteGame.FortItem:GetTertiaryCategory
	bool GetSecondaryCategory(FText ItemCategoryText, FSlateBrush ItemCategoryBrush, EFortBrushSize BrushSize) const; // Function /Script/FortniteGame.FortItem:GetSecondaryCategory
	FText GetSearchTags() const; // Function /Script/FortniteGame.FortItem:GetSearchTags
	EFortItemType GetSchematicResultType() const; // Function /Script/FortniteGame.FortItem:GetSchematicResultType
	class UFortItemDefinition* GetSchematicCraftingResultBP() const; // Function /Script/FortniteGame.FortItem:GetSchematicCraftingResultBP
	int32_t GetRemainingAmmo() const; // Function /Script/FortniteGame.FortItem:GetRemainingAmmo
	int32_t GetRecycleValue() const; // Function /Script/FortniteGame.FortItem:GetRecycleValue
	FLinearColor GetRarityTextShadowColor() const; // Function /Script/FortniteGame.FortItem:GetRarityTextShadowColor
	FLinearColor GetRaritySecondaryColor() const; // Function /Script/FortniteGame.FortItem:GetRaritySecondaryColor
	FLinearColor GetRarityColor() const; // Function /Script/FortniteGame.FortItem:GetRarityColor
	EFortRarity GetRarity() const; // Function /Script/FortniteGame.FortItem:GetRarity
	bool GetPrimaryCategory(FText ItemCategoryText) const; // Function /Script/FortniteGame.FortItem:GetPrimaryCategory
	int32_t GetNumInStack() const; // Function /Script/FortniteGame.FortItem:GetNumInStack
	float GetNormalizedDurability() const; // Function /Script/FortniteGame.FortItem:GetNormalizedDurability
	int32_t GetMaxLevel() const; // Function /Script/FortniteGame.FortItem:GetMaxLevel
	int32_t GetLoadedAmmo() const; // Function /Script/FortniteGame.FortItem:GetLoadedAmmo
	int32_t GetLevel() const; // Function /Script/FortniteGame.FortItem:GetLevel
	FGuid GetItemGuid() const; // Function /Script/FortniteGame.FortItem:GetItemGuid
	class UFortItemDefinition* GetItemDefinitionBP() const; // Function /Script/FortniteGame.FortItem:GetItemDefinitionBP
	void GetIconBrush(FSlateBrush IconBrush, EFortBrushSize BrushSize) const; // Function /Script/FortniteGame.FortItem:GetIconBrush
	EFortInventoryFilter GetFilterCategory() const; // Function /Script/FortniteGame.FortItem:GetFilterCategory
	float GetDurability() const; // Function /Script/FortniteGame.FortItem:GetDurability
	FText GetDisplayName() const; // Function /Script/FortniteGame.FortItem:GetDisplayName
	FText GetDescription() const; // Function /Script/FortniteGame.FortItem:GetDescription
	float GetCoolDownTimeRemaining(class AFortPlayerController* FortPC, float CooldownDuration) const; // Function /Script/FortniteGame.FortItem:GetCoolDownTimeRemaining
