#pragma once
#include "FN_Basic.h"

#include "FN_FortnitePartyBackdrop_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortnitePartyBackdrop
*/

// BlueprintGeneratedClass /Game/Maps/FrontEnd/FortnitePartyBackdrop.FortnitePartyBackdrop_C
// 0x0014 (0x0260)
class AFortnitePartyBackdrop_C : public AFortLevelScriptActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x024C (0x0004)
	float                                                                                                Timeline_0_Lightning_0C9F728D43ED8DB5A25AE8A40FE8D04D; // 0x0250 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_0C9F728D43ED8DB5A25AE8A40FE8D04D; // 0x0254 (0x0001)
	uint8_t                                                                                              UnknownData_255[0x3];                              // 0x0255 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0258 (0x0004)
	class APointLight*                                                                                   PointLight6_11_ExecuteUbergraph_FortnitePartyBackdrop_RefProperty; // 0x025C (0x0004)
public:
	void Timeline_0__FinishedFunc(); // Function /Game/Maps/FrontEnd/FortnitePartyBackdrop.FortnitePartyBackdrop_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Maps/FrontEnd/FortnitePartyBackdrop.FortnitePartyBackdrop_C:Timeline_0__UpdateFunc
	void ExecuteUbergraph_FortnitePartyBackdrop(int32_t EntryPoint); // Function /Game/Maps/FrontEnd/FortnitePartyBackdrop.FortnitePartyBackdrop_C:ExecuteUbergraph_FortnitePartyBackdrop
public:
	static class UClass* StaticClass();
};

