#pragma once
#include "FN_Basic.h"

#include "FN_FortniteUI_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FriendsAndChat_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: FortniteUI
*/

// ScriptStruct /Script/FortniteUI.FortBackendVersion
// 0x0070 (0x0070)
struct FFortBackendVersion
{
	bool                                                                                                 bIsValid;                                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FString                                                                                              App;                                               // 0x0004 (0x000C)
	FString                                                                                              ModuleName;                                        // 0x0010 (0x000C)
	FString                                                                                              Branch;                                            // 0x001C (0x000C)
	FString                                                                                              BuildDate;                                         // 0x0028 (0x000C)
	FString                                                                                              ServerDate;                                        // 0x0034 (0x000C)
	FString                                                                                              Build;                                             // 0x0040 (0x000C)
	FString                                                                                              Changelist;                                        // 0x004C (0x000C)
	FString                                                                                              OverridePropertiesVersion;                         // 0x0058 (0x000C)
	FString                                                                                              Version;                                           // 0x0064 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortDialogDescription
// 0x0050 (0x0050)
struct FFortDialogDescription
{
	FText                                                                                                MessageHeader;                                     // 0x0000 (0x000C)
	FText                                                                                                MessageBody;                                       // 0x000C (0x000C)
	FText                                                                                                AcceptButtonText;                                  // 0x0018 (0x000C)
	FText                                                                                                IgnoreButtonText;                                  // 0x0024 (0x000C)
	FText                                                                                                DismissButtonText;                                 // 0x0030 (0x000C)
	float                                                                                                DisplayTime;                                       // 0x003C (0x0004)
	class UFortUserWidget*                                                                               AdditionalContent;                                 // 0x0040 (0x0004)
	EFortDialogFeedbackType                                                                              FeedBackType;                                      // 0x0044 (0x0001)
	uint8_t                                                                                              UnknownData_45[0xB];                               // 0x0045 (0x000B) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortUIFeatureStruct
// 0x0010 (0x0010)
struct FFortUIFeatureStruct
{
	EFortUIFeatureState                                                                                  CurrentState;                                      // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	struct FFortniteUI_UIFeatureStateChangedDelegate__DelegateSignature                                  ChangeDelegate;                                    // 0x0004 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortFocusedBuildingInfo
// 0x0040 (0x0040)
struct FFortFocusedBuildingInfo
{
	bool                                                                                                 bIsInteractable;                                   // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FVector                                                                                              IndicatorRelativeLocation;                         // 0x0004 (0x000C)
	EFortBuildingHealthDisplayRule                                                                       HealthDisplayRule;                                 // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	float                                                                                                MaxHealth;                                         // 0x0014 (0x0004)
	bool                                                                                                 bIsTrapAttached;                                   // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET
	float                                                                                                AttachedTrapMaxDurability;                         // 0x001C (0x0004)
	int32_t                                                                                              CurrentLevel;                                      // 0x0020 (0x0004)
	EFortBuildingInteraction                                                                             InteractionType;                                   // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
	int32_t                                                                                              InteractionCost;                                   // 0x0028 (0x0004)
	int32_t                                                                                              UpgradeBonus;                                      // 0x002C (0x0004)
	EFortResourceType                                                                                    BuildingMaterial;                                  // 0x0030 (0x0001)
	bool                                                                                                 bIsHostile;                                        // 0x0031 (0x0001)
	uint8_t                                                                                              UnknownData_32[0x2];                               // 0x0032 (0x0002) MISSED OFFSET
	FText                                                                                                ContextualText;                                    // 0x0034 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortStateStyle
// 0x02D8 (0x02D8)
struct FFortStateStyle
{
	FFortMultiSizeBrush                                                                                  Brush;                                             // 0x0000 (0x02B8)
	FLinearColor                                                                                         PrimaryColor;                                      // 0x02B8 (0x0010)
	FLinearColor                                                                                         SecondaryColor;                                    // 0x02C8 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortErrorInfo
// 0x002C (0x002C)
struct FFortErrorInfo
{
	FText                                                                                                Operation;                                         // 0x0000 (0x000C)
	FText                                                                                                ErrorMessage;                                      // 0x000C (0x000C)
	FString                                                                                              ErrorCode;                                         // 0x0018 (0x000C)
	uint8_t                                                                                              UnknownData_24[0x8];                               // 0x0024 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.GridSortKey
// 0x0010 (0x0010)
struct FGridSortKey
{
	float                                                                                                Number;                                            // 0x0000 (0x0004)
	FString                                                                                              String;                                            // 0x0004 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortFrontEndFeatureStruct
// 0x0010 (0x0010)
struct FFortFrontEndFeatureStruct
{
	EFortFrontEndFeatureState                                                                            CurrentState;                                      // 0x0000 (0x0001)
	EFortFrontEndFeatureState                                                                            ForcedState;                                       // 0x0001 (0x0001)
	uint8_t                                                                                              UnknownData_2[0x2];                                // 0x0002 (0x0002) MISSED OFFSET
	struct FFortniteUI_FrontEndFeatureStateChangedDelegate__DelegateSignature                            ChangeDelegate;                                    // 0x0004 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortMissionRewardInfo
// 0x0084 (0x0084)
struct FFortMissionRewardInfo
{
	FSlateBrush                                                                                          Icon;                                              // 0x0000 (0x0074)
	FText                                                                                                DisplayName;                                       // 0x0074 (0x000C)
	class UFortItem*                                                                                     Item;                                              // 0x0080 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortMissionDetails
// 0x0090 (0x0090)
struct FFortMissionDetails
{
	EFortTheaterMapTileType                                                                              TileType;                                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FText                                                                                                TheaterDisplayName;                                // 0x0004 (0x000C)
	FText                                                                                                MissionName;                                       // 0x0010 (0x000C)
	FText                                                                                                MissionDescription;                                // 0x001C (0x000C)
	class UFortMissionGenerator*                                                                         MissionDefinition;                                 // 0x0028 (0x0004)
	FText                                                                                                ZoneName;                                          // 0x002C (0x000C)
	FText                                                                                                ZoneDescription;                                   // 0x0038 (0x000C)
	FText                                                                                                RegionThemeName;                                   // 0x0044 (0x000C)
	TAssetPtr<USlateBrushAsset>                                                                          RegionThemeIcon;                                   // 0x0050 (0x0018)
	FText                                                                                                DifficultyName;                                    // 0x0068 (0x000C)
	TArray<FFortMissionRewardInfo>                                                                       MissionRewards;                                    // 0x0074 (0x000C)
	FTimespan                                                                                            AvailableTime;                                     // 0x0080 (0x0008)
	int32_t                                                                                              RequiredBaseRating;                                // 0x0088 (0x0004)
	int32_t                                                                                              RecommendedBaseRating;                             // 0x008C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.AttributeRequirement
// 0x0014 (0x0014)
struct FAttributeRequirement
{
	FText                                                                                                Name;                                              // 0x0000 (0x000C)
	int32_t                                                                                              Level;                                             // 0x000C (0x0004)
	bool                                                                                                 bRequirementsMet;                                  // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.BuildingRequirements
// 0x0024 (0x0024)
struct FBuildingRequirements
{
	int32_t                                                                                              RequiredAccountLevel;                              // 0x0000 (0x0004)
	int32_t                                                                                              CurrentAccountLevel;                               // 0x0004 (0x0004)
	TArray<FAttributeRequirement>                                                                        AttributeRequirements;                             // 0x0008 (0x000C)
	int32_t                                                                                              RequiredPower;                                     // 0x0014 (0x0004)
	int32_t                                                                                              CurrentPower;                                      // 0x0018 (0x0004)
	int32_t                                                                                              RequiredManufacturing;                             // 0x001C (0x0004)
	int32_t                                                                                              CurrentManufacturing;                              // 0x0020 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.HeroStat
// 0x0014 (0x0014)
struct FHeroStat
{
	FText                                                                                                DisplayName;                                       // 0x0000 (0x000C)
	float                                                                                                Value;                                             // 0x000C (0x0004)
	bool                                                                                                 bIsCategory;                                       // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.EmptyHeroSlot
// 0x000C (0x000C)
struct FEmptyHeroSlot
{
	class UFortHeroType*                                                                                 Type;                                              // 0x0000 (0x0004)
	int32_t                                                                                              NumAvailable;                                      // 0x0004 (0x0004)
	bool                                                                                                 bHasMale;                                          // 0x0008 (0x0001)
	bool                                                                                                 bHasFemale;                                        // 0x0009 (0x0001)
	uint8_t                                                                                              UnknownData_A[0x2];                                // 0x000A (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.HeroUIData
// 0x0018 (0x0018)
struct FHeroUIData
{
	class UFortHero*                                                                                     Hero;                                              // 0x0000 (0x0004)
	bool                                                                                                 bIsSelected;                                       // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	int32_t                                                                                              XPRequirementForCurrentLevel;                      // 0x0008 (0x0004)
	int32_t                                                                                              XPRequirementForNextLevel;                         // 0x000C (0x0004)
	int32_t                                                                                              RequiredXPToLevelUp;                               // 0x0010 (0x0004)
	bool                                                                                                 bIsMaxHeroLevel;                                   // 0x0014 (0x0001)
	uint8_t                                                                                              UnknownData_15[0x3];                               // 0x0015 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortKillerVisualInfo
// 0x0080 (0x0080)
struct FFortKillerVisualInfo
{
	FSlateBrush                                                                                          KillerBrush;                                       // 0x0000 (0x0074)
	FText                                                                                                KillerName;                                        // 0x0074 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortItemListFilter
// 0x0010 (0x0010)
struct FFortItemListFilter
{
	FString                                                                                              SearchText;                                        // 0x0000 (0x000C)
	EFortInventoryFilter                                                                                 FilterType;                                        // 0x000C (0x0001)
	bool                                                                                                 bInStorageVault;                                   // 0x000D (0x0001)
	uint8_t                                                                                              UnknownData_E[0x2];                                // 0x000E (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortModalContainerSizeEntry
// 0x001C (0x001C)
struct FFortModalContainerSizeEntry
{
	float                                                                                                AbsoluteWidth;                                     // 0x0000 (0x0004)
	float                                                                                                TopPercent;                                        // 0x0004 (0x0004)
	float                                                                                                MiddlePercent;                                     // 0x0008 (0x0004)
	float                                                                                                BottomPercent;                                     // 0x000C (0x0004)
	float                                                                                                VerticalPadding;                                   // 0x0010 (0x0004)
	float                                                                                                HorizontalPadding;                                 // 0x0014 (0x0004)
	float                                                                                                ContentPadding;                                    // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.OpenedCardPack
// 0x0008 (0x0008)
struct FOpenedCardPack
{
	class UFortCardPackItemDefinition*                                                                   CardPackDefinition;                                // 0x0000 (0x0004)
	int32_t                                                                                              DisplayLevel;                                      // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.Card
// 0x000C (0x000C)
struct FCard
{
	int32_t                                                                                              QuantityReceived;                                  // 0x0000 (0x0004)
	class UFortItem*                                                                                     Item;                                              // 0x0004 (0x0004)
	EPauseType                                                                                           PauseType;                                         // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.CardPackOffer
// 0x003C (0x003C)
struct FCardPackOffer
{
	FText                                                                                                Title;                                             // 0x0000 (0x000C)
	FText                                                                                                Description;                                       // 0x000C (0x000C)
	int32_t                                                                                              MtxPrice;                                          // 0x0018 (0x0004)
	int32_t                                                                                              QuantityRemaining;                                 // 0x001C (0x0004)
	bool                                                                                                 bTimedOffer;                                       // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	FFortCatalogMeta                                                                                     OfferMetaData;                                     // 0x0024 (0x0010)
	uint8_t                                                                                              UnknownData_34[0x8];                               // 0x0034 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultPropertyInfo
// 0x0028 (0x0028)
struct FVaultPropertyInfo
{
	FText                                                                                                DisplayName;                                       // 0x0000 (0x000C)
	FText                                                                                                ValueText;                                         // 0x000C (0x000C)
	bool                                                                                                 bPendingChange;                                    // 0x0018 (0x0001)
	bool                                                                                                 bIsPositiveChange;                                 // 0x0019 (0x0001)
	uint8_t                                                                                              UnknownData_1A[0x2];                               // 0x001A (0x0002) MISSED OFFSET
	FText                                                                                                ChangedValueText;                                  // 0x001C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultIngredientInfo
// 0x0090 (0x0090)
struct FVaultIngredientInfo
{
	int32_t                                                                                              Count;                                             // 0x0000 (0x0004)
	FText                                                                                                DisplayName;                                       // 0x0004 (0x000C)
	FText                                                                                                Description;                                       // 0x0010 (0x000C)
	FSlateBrush                                                                                          Image;                                             // 0x001C (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultButtonInfo
// 0x0090 (0x0090)
struct FVaultButtonInfo
{
	EVaultCommandType                                                                                    CommandType;                                       // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FText                                                                                                CommandText;                                       // 0x0004 (0x000C)
	bool                                                                                                 bHasCost;                                          // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	int32_t                                                                                              Cost;                                              // 0x0014 (0x0004)
	FSlateBrush                                                                                          ResourceIcon;                                      // 0x0018 (0x0074)
	bool                                                                                                 bEnabled;                                          // 0x008C (0x0001)
	uint8_t                                                                                              UnknownData_8D[0x3];                               // 0x008D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultDetailsInfo
// 0x0620 (0x0620)
struct FVaultDetailsInfo
{
	bool                                                                                                 bIsValid;                                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FSlateColor                                                                                          RarityColor;                                       // 0x0004 (0x001C)
	FSlateColor                                                                                          RaritySecondaryColor;                              // 0x0020 (0x001C)
	FText                                                                                                MainHeader;                                        // 0x003C (0x000C)
	FText                                                                                                SubHeader1;                                        // 0x0048 (0x000C)
	FText                                                                                                SubHeader2;                                        // 0x0054 (0x000C)
	int32_t                                                                                              Level;                                             // 0x0060 (0x0004)
	int32_t                                                                                              MaxLevel;                                          // 0x0064 (0x0004)
	FText                                                                                                SubInfoText1;                                      // 0x0068 (0x000C)
	FFortMultiSizeBrush                                                                                  SubInfoImage1;                                     // 0x0074 (0x02B8)
	FText                                                                                                SubInfoText2;                                      // 0x032C (0x000C)
	FFortMultiSizeBrush                                                                                  SubInfoImage2;                                     // 0x0338 (0x02B8)
	FText                                                                                                Description;                                       // 0x05F0 (0x000C)
	TArray<FVaultPropertyInfo>                                                                           Properties;                                        // 0x05FC (0x000C)
	TArray<FVaultIngredientInfo>                                                                         Ingredients;                                       // 0x0608 (0x000C)
	TArray<FVaultButtonInfo>                                                                             Buttons;                                           // 0x0614 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultAlterationInfo
// 0x0008 (0x0008)
struct FVaultAlterationInfo
{
	EFortAlteration                                                                                      SlotType;                                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	class UFortAlterationItemDefinition*                                                                 SlottedAlteration;                                 // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.VaultContentDetails
// 0x0010 (0x0010)
struct FVaultContentDetails
{
	FString                                                                                              SearchText;                                        // 0x0000 (0x000C)
	EVaultContentSortType                                                                                SortType;                                          // 0x000C (0x0001)
	EFortInventoryFilter                                                                                 SubType;                                           // 0x000D (0x0001)
	uint8_t                                                                                              UnknownData_E[0x2];                                // 0x000E (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/FortniteUI.FortHeroNamesData
// 0x0023 (0x0024)
struct FFortHeroNamesData : public FTableRowBase
{
	FString                                                                                              FirstName;                                         // 0x0000 (0x000C)
	FString                                                                                              NickName;                                          // 0x000C (0x000C)
	FString                                                                                              LastName;                                          // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

