#pragma once
#include "FN_Basic.h"

#include "FN_GA_ReflectDamage_WithSource_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_ReflectDamage_WithSource
*/

// BlueprintGeneratedClass /Game/Abilities/GA_ReflectDamage_WithSource.GA_ReflectDamage_WithSource_C
// 0x0024 (0x0700)
class UGA_ReflectDamage_WithSource_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayTag                                                                                         ReflectedTag;                                      // 0x06E0 (0x0008)
	class UClass*                                                                                        DamageGE;                                          // 0x06E8 (0x0004)
	class UAbilitySystemComponent*                                                                       OriginalDamageInstigator;                          // 0x06EC (0x0004)
	class UAbilitySystemComponent*                                                                       OriginalDamageTarget;                              // 0x06F0 (0x0004)
	class ABuildingGameplayActor*                                                                        Base;                                              // 0x06F4 (0x0004)
	FGameplayTag                                                                                         RequestReflectionTag;                              // 0x06F8 (0x0008)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/GA_ReflectDamage_WithSource.GA_ReflectDamage_WithSource_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_ReflectDamage_WithSource(int32_t EntryPoint); // Function /Game/Abilities/GA_ReflectDamage_WithSource.GA_ReflectDamage_WithSource_C:ExecuteUbergraph_GA_ReflectDamage_WithSource
public:
	static class UClass* StaticClass();
};

