#pragma once
#include "FN_Basic.h"

#include "FN_GAB_FlingerRanged_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAB_AIBaseRanged_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_FlingerRanged
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C
// 0x0020 (0x070C)
class UGAB_FlingerRanged_C : public UGAB_AIBaseRanged_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06EC (0x0004)
	class UParticleSystemComponent*                                                                      ThrowFX;                                           // 0x06F0 (0x0004)
	class UParticleSystem*                                                                               ThrowFXTemplate;                                   // 0x06F4 (0x0004)
	class USkeletalMeshComponent*                                                                        FlingerMesh;                                       // 0x06F8 (0x0004)
	FGameplayTag                                                                                         GC_NPCRangedGrab;                                  // 0x06FC (0x0008)
	FGameplayTag                                                                                         GC_NPCRangedThrow;                                 // 0x0704 (0x0008)
public:
	void K2_ActivateAbility(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C:K2_ActivateAbility
	void SpawnFX(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C:SpawnFX
	void StopFX(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C:StopFX
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C:K2_OnEndAbility
	void ExecuteUbergraph_GAB_FlingerRanged(int32_t EntryPoint); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerRanged.GAB_FlingerRanged_C:ExecuteUbergraph_GAB_FlingerRanged
public:
	static class UClass* StaticClass();
};

