#pragma once
#include "FN_Basic.h"

#include "FN_GA_SupplyDrop_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_SupplyDrop
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/GA_SupplyDrop.GA_SupplyDrop_C
// 0x00CC (0x07A8)
class UGA_SupplyDrop_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class AFortPlayerPawn*                                                                               Fort_Player_Pawn;                                  // 0x06E0 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x06E4 (0x0008)
	FGameplayTag                                                                                         EventActivation;                                   // 0x06EC (0x0008)
	FFortAbilityTargetSelection                                                                          T_Explosion;                                       // 0x06F4 (0x004C)
	class USoundBase*                                                                                    ActivationSound;                                   // 0x0740 (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x0744 (0x0058)
	int32_t                                                                                              AbilityMultiplier;                                 // 0x079C (0x0004)
	FGameplayAttribute                                                                                   ExplorersGuildBuilding3;                           // 0x07A0 (0x0004)
	int32_t                                                                                              PowerLevel;                                        // 0x07A4 (0x0004)
public:
	void GetAttributeValue(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/GA_SupplyDrop.GA_SupplyDrop_C:GetAttributeValue
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/GA_SupplyDrop.GA_SupplyDrop_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_SupplyDrop(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/SupplyDrop/GA_SupplyDrop.GA_SupplyDrop_C:ExecuteUbergraph_GA_SupplyDrop
public:
	static class UClass* StaticClass();
};

