#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_AntiMaterialCharge_parameters.h"
#include "FN_E_AntiMaterialCharge_State_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_GAT_OutlanderActiveAbility_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_AntiMaterialCharge
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C
// 0x00E4 (0x0824)
class UGA_Outlander_AntiMaterialCharge_C : public UGAT_OutlanderActiveAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x074C (0x0008)
	FFortFeedbackHandle                                                                                  AntiMaterialDialogFeedback;                        // 0x0754 (0x0010)
	FGameplayTag                                                                                         EC_TargetBuildings;                                // 0x0764 (0x0008)
	FGameplayTag                                                                                         EC_TargetPawns;                                    // 0x076C (0x0008)
	class UAnimMontage*                                                                                  M_AntiMaterialCharge;                              // 0x0774 (0x0004)
	float                                                                                                MinTravelTime;                                     // 0x0778 (0x0004)
	float                                                                                                MaxTravelTime;                                     // 0x077C (0x0004)
	FGameplayAttribute                                                                                   OutlanderSubBuilding1;                             // 0x0780 (0x0004)
	float                                                                                                UpgradeDistance;                                   // 0x0784 (0x0004)
	float                                                                                                MinChargeUpTime;                                   // 0x0788 (0x0004)
	class UParticleSystemComponent*                                                                      P_DustKickup_Active;                               // 0x078C (0x0004)
	float                                                                                                MaxChargeUpTime;                                   // 0x0790 (0x0004)
	float                                                                                                ChargeUpTimeout;                                   // 0x0794 (0x0004)
	float                                                                                                ChargeUpStartTime;                                 // 0x0798 (0x0004)
	float                                                                                                ChargeFraction;                                    // 0x079C (0x0004)
	class UAudioComponent*                                                                               ChargeUpAudioComp;                                 // 0x07A0 (0x0004)
	class USoundBase*                                                                                    ChargeUpSoundCue;                                  // 0x07A4 (0x0004)
	float                                                                                                ChargeUpAnimDuration;                              // 0x07A8 (0x0004)
	FGameplayTagContainer                                                                                TC_ChargedFist;                                    // 0x07AC (0x0018)
	FGameplayTagContainer                                                                                TC_TravelTime;                                     // 0x07C4 (0x0018)
	E_AntiMaterialCharge_State                                                                           AntiMaterialChargeState;                           // 0x07DC (0x0001)
	uint8_t                                                                                              UnknownData_7DD[0x3];                              // 0x07DD (0x0003) MISSED OFFSET
	float                                                                                                FollowThruTimeout;                                 // 0x07E0 (0x0004)
	bool                                                                                                 KeyReleased;                                       // 0x07E4 (0x0001)
	uint8_t                                                                                              UnknownData_7E5[0x3];                              // 0x07E5 (0x0003) MISSED OFFSET
	float                                                                                                PitchInputScale;                                   // 0x07E8 (0x0004)
	float                                                                                                YawInputScale;                                     // 0x07EC (0x0004)
	TArray<FFortCharacterPartMontageInfo>                                                                CharacterPartMontages;                             // 0x07F0 (0x000C)
	float                                                                                                ChargePawnDamageMax;                               // 0x07FC (0x0004)
	float                                                                                                ChargeBuildingDamageMax;                           // 0x0800 (0x0004)
	bool                                                                                                 WasCharged;                                        // 0x0804 (0x0001)
	uint8_t                                                                                              UnknownData_805[0x3];                              // 0x0805 (0x0003) MISSED OFFSET
	class UClass*                                                                                        GE_OutlanderChargeDamageBoost;                     // 0x0808 (0x0004)
	FGameplayTagContainer                                                                                ImpactCueTags;                                     // 0x080C (0x0018)
public:
	void AddChargeDamage(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:AddChargeDamage
	void ToggleSteeringReduction(bool EnableSteeringReduction); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:ToggleSteeringReduction
	void SetVariables(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:SetVariables
	void CheckOverlappingActors(class AActor* Actor, bool ShouldContinue); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:CheckOverlappingActors
	void Cancelled_FE8A18834C65F680DC37488D7FC06BC5(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Cancelled_FE8A18834C65F680DC37488D7FC06BC5
	void Targeted_FE8A18834C65F680DC37488D7FC06BC5(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Targeted_FE8A18834C65F680DC37488D7FC06BC5
	void Cancelled_63C876A84981C19273666E9674DB57B0(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Cancelled_63C876A84981C19273666E9674DB57B0
	void Targeted_63C876A84981C19273666E9674DB57B0(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Targeted_63C876A84981C19273666E9674DB57B0
	void Completed_46A106FC46EA4689B0713182261BE9A8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Completed_46A106FC46EA4689B0713182261BE9A8
	void Cancelled_46A106FC46EA4689B0713182261BE9A8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Cancelled_46A106FC46EA4689B0713182261BE9A8
	void Triggered_46A106FC46EA4689B0713182261BE9A8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Triggered_46A106FC46EA4689B0713182261BE9A8
	void Completed_29EA705847CDF7F1457FB4B125B9704F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Completed_29EA705847CDF7F1457FB4B125B9704F
	void Cancelled_29EA705847CDF7F1457FB4B125B9704F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Cancelled_29EA705847CDF7F1457FB4B125B9704F
	void Triggered_29EA705847CDF7F1457FB4B125B9704F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Triggered_29EA705847CDF7F1457FB4B125B9704F
	void Completed_BC1210B54390EF35DEFD88AE8F47FDE8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Completed_BC1210B54390EF35DEFD88AE8F47FDE8
	void Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Cancelled_BC1210B54390EF35DEFD88AE8F47FDE8
	void Triggered_BC1210B54390EF35DEFD88AE8F47FDE8(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:Triggered_BC1210B54390EF35DEFD88AE8F47FDE8
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:K2_ActivateAbility
	void OverlapEvent(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:OverlapEvent
	void K2_OnEndAbility(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:K2_OnEndAbility
	void OnAbilityInputReleased(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:OnAbilityInputReleased
	void ChargeUpState(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:ChargeUpState
	void PunchMovementState(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:PunchMovementState
	void FollowThruState(); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:FollowThruState
	void ExecuteUbergraph_GA_Outlander_AntiMaterialCharge(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/AntiMaterialCharge/GA_Outlander_AntiMaterialCharge.GA_Outlander_AntiMaterialCharge_C:ExecuteUbergraph_GA_Outlander_AntiMaterialCharge
public:
	static class UClass* StaticClass();
};

