#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_GoinCommando_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoActiveAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_GoinCommando
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Gadgets/GoinCommando/GA_Commando_GoinCommando.GA_Commando_GoinCommando_C
// 0x0060 (0x07A0)
class UGA_Commando_GoinCommando_C : public UGAT_CommandoActiveAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	class UAnimMontage*                                                                                  M_Activation;                                      // 0x074C (0x0004)
	FGameplayTag                                                                                         Event_Complete;                                    // 0x0750 (0x0008)
	float                                                                                                AbilityDuration;                                   // 0x0758 (0x0004)
	class UFortWeaponItemDefinition*                                                                     WeaponDef;                                         // 0x075C (0x0004)
	FGameplayTagContainer                                                                                TC_AintDoneYet;                                    // 0x0760 (0x0018)
	float                                                                                                UpgradeDuration;                                   // 0x0778 (0x0004)
	FGameplayTagContainer                                                                                TC_BoomStick;                                      // 0x077C (0x0018)
	class UClass*                                                                                        GE_GoinCommandoSnare;                              // 0x0794 (0x0004)
	class UClass*                                                                                        GE_GoinCommandoActive;                             // 0x0798 (0x0004)
	class UClass*                                                                                        GE_TempDealEnergyDamage;                           // 0x079C (0x0004)
public:
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/GA_Commando_GoinCommando.GA_Commando_GoinCommando_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Commando_GoinCommando(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Gadgets/GoinCommando/GA_Commando_GoinCommando.GA_Commando_GoinCommando_C:ExecuteUbergraph_GA_Commando_GoinCommando
public:
	static class UClass* StaticClass();
};

