#pragma once
#include "FN_Basic.h"

#include "FN_GameSubCatalog_enums.h"
#include "FN_JsonUtilities_structs.h"
#include "FN_McpProfileSys_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GameSubCatalog
*/

// ScriptStruct /Script/GameSubCatalog.CatalogPurchaseNotification
// 0x0024 (0x0024)
struct FCatalogPurchaseNotification
{
	FMcpLootResult                                                                                       LootResult;                                        // 0x0000 (0x0024)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogItemPrice
// 0x0014 (0x0014)
struct FCatalogItemPrice
{
	EStoreCurrencyType                                                                                   CurrencyType;                                      // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FString                                                                                              CurrencySubType;                                   // 0x0004 (0x000C)
	int32_t                                                                                              BasePrice;                                         // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.ServicePrice
// 0x0020 (0x0020)
struct FServicePrice
{
	FString                                                                                              ServiceName;                                       // 0x0000 (0x000C)
	FCatalogItemPrice                                                                                    Price;                                             // 0x000C (0x0014)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogKeyValue
// 0x0018 (0x0018)
struct FCatalogKeyValue
{
	FString                                                                                              Key;                                               // 0x0000 (0x000C)
	FString                                                                                              Value;                                             // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogMetaAssetInfo
// 0x0014 (0x0014)
struct FCatalogMetaAssetInfo
{
	FString                                                                                              StructName;                                        // 0x0000 (0x000C)
	FJsonObjectWrapper                                                                                   Payload;                                           // 0x000C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogOffer
// 0x00FC (0x00FC)
struct FCatalogOffer
{
	FString                                                                                              OfferId;                                           // 0x0000 (0x000C)
	TArray<FCatalogKeyValue>                                                                             MetaInfo;                                          // 0x000C (0x000C)
	TArray<FCatalogItemPrice>                                                                            Prices;                                            // 0x0018 (0x000C)
	int32_t                                                                                              DailyLimit;                                        // 0x0024 (0x0004)
	bool                                                                                                 SinglePurchaseOnly;                                // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	TArray<FString>                                                                                      Categories;                                        // 0x002C (0x000C)
	FString                                                                                              CatalogGroup;                                      // 0x0038 (0x000C)
	int32_t                                                                                              CatalogGroupPriority;                              // 0x0044 (0x0004)
	int32_t                                                                                              SortPriority;                                      // 0x0048 (0x0004)
	FText                                                                                                Title;                                             // 0x004C (0x000C)
	FText                                                                                                Description;                                       // 0x0058 (0x000C)
	FString                                                                                              AppStoreId[8];                                     // 0x0064 (0x0060)
	FCatalogMetaAssetInfo                                                                                MetaAssetInfo;                                     // 0x00C4 (0x0014)
	FString                                                                                              DisplayAssetPath;                                  // 0x00D8 (0x000C)
	FString                                                                                              FulfillmentId;                                     // 0x00E4 (0x000C)
	TArray<FString>                                                                                      RequiredFulfillmentIds;                            // 0x00F0 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.Storefront
// 0x0018 (0x0018)
struct FStorefront
{
	FString                                                                                              Name;                                              // 0x0000 (0x000C)
	TArray<FCatalogOffer>                                                                                CatalogEntries;                                    // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogDownload
// 0x001C (0x001C)
struct FCatalogDownload
{
	int32_t                                                                                              RefreshIntervalHrs;                                // 0x0000 (0x0004)
	TArray<FServicePrice>                                                                                ServicePricing;                                    // 0x0004 (0x000C)
	TArray<FStorefront>                                                                                  Storefronts;                                       // 0x0010 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogPurchaseInfo
// 0x0024 (0x0024)
struct FCatalogPurchaseInfo
{
	FString                                                                                              OfferId;                                           // 0x0000 (0x000C)
	int32_t                                                                                              PurchaseQuantity;                                  // 0x000C (0x0004)
	EStoreCurrencyType                                                                                   Currency;                                          // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	FString                                                                                              CurrencySubType;                                   // 0x0014 (0x000C)
	int32_t                                                                                              ExpectedPrice;                                     // 0x0020 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameSubCatalog.CatalogReceiptInfo
// 0x0028 (0x0028)
struct FCatalogReceiptInfo
{
	EAppStore                                                                                            AppStore;                                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FString                                                                                              AppStoreId;                                        // 0x0004 (0x000C)
	FString                                                                                              ReceiptId;                                         // 0x0010 (0x000C)
	FString                                                                                              ReceiptInfo;                                       // 0x001C (0x000C)

	static class UScriptStruct* StaticStruct();
};

