#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_LuckyBreak_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_LuckyBreak
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/Perserverence/GA_Commando_LuckyBreak.GA_Commando_LuckyBreak_C
// 0x0018 (0x0758)
class UGA_Commando_LuckyBreak_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         Event_Activation;                                  // 0x0744 (0x0008)
	class UClass*                                                                                        GE_LuckyBreak;                                     // 0x074C (0x0004)
	FGameplayTag                                                                                         Event_Complete;                                    // 0x0750 (0x0008)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_Commando_LuckyBreak.GA_Commando_LuckyBreak_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_Commando_LuckyBreak.GA_Commando_LuckyBreak_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Commando_LuckyBreak(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_Commando_LuckyBreak.GA_Commando_LuckyBreak_C:ExecuteUbergraph_GA_Commando_LuckyBreak
public:
	static class UClass* StaticClass();
};

