#pragma once
#include "FN_Basic.h"

#include "FN_GA_Generic_BotTurret_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_GAT_GenericActiveAbility_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Generic_BotTurret
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C
// 0x00EC (0x082C)
class UGA_Generic_BotTurret_C : public UGAT_GenericActiveAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivate;                                     // 0x0744 (0x0008)
	FGameplayTag                                                                                         EventDeactivate;                                   // 0x074C (0x0008)
	FFortGameplayAbilityMontageInfo                                                                      Montage_Info;                                      // 0x0754 (0x0044)
	class UClass*                                                                                        BGA_BotTurret;                                     // 0x0798 (0x0004)
	class UClass*                                                                                        EnergyDamage;                                      // 0x079C (0x0004)
	float                                                                                                TurretDuration;                                    // 0x07A0 (0x0004)
	FVector                                                                                              SpawnTurretLoc;                                    // 0x07A4 (0x000C)
	FRotator                                                                                             SpawnTurretRot;                                    // 0x07B0 (0x000C)
	class AActor*                                                                                        ActiveTurret;                                      // 0x07BC (0x0004)
	bool                                                                                                 ShouldBounce;                                      // 0x07C0 (0x0001)
	uint8_t                                                                                              UnknownData_7C1[0x3];                              // 0x07C1 (0x0003) MISSED OFFSET
	FGameplayAttribute                                                                                   DroneSubBuilding3;                                 // 0x07C4 (0x0004)
	class ABuildingGameplayActor*                                                                        Bot_Reference;                                     // 0x07C8 (0x0004)
	float                                                                                                Turret_Duration_Lv1;                               // 0x07CC (0x0004)
	float                                                                                                Turret_Duration_Lv2;                               // 0x07D0 (0x0004)
	float                                                                                                Turret_Duration_Lv3;                               // 0x07D4 (0x0004)
	float                                                                                                Turret_Duration_Lv4;                               // 0x07D8 (0x0004)
	float                                                                                                Turret_Duration_Lv5;                               // 0x07DC (0x0004)
	float                                                                                                FireRate;                                          // 0x07E0 (0x0004)
	float                                                                                                Fire_Rate_Lv1;                                     // 0x07E4 (0x0004)
	float                                                                                                Fire_Rate_Lv2;                                     // 0x07E8 (0x0004)
	float                                                                                                Fire_Rate_Lv3;                                     // 0x07EC (0x0004)
	float                                                                                                Fire_Rate_Lv4;                                     // 0x07F0 (0x0004)
	float                                                                                                Fire_Rate_Lv5;                                     // 0x07F4 (0x0004)
	float                                                                                                Range;                                             // 0x07F8 (0x0004)
	float                                                                                                Range_Lv1;                                         // 0x07FC (0x0004)
	float                                                                                                Range_Lv2;                                         // 0x0800 (0x0004)
	float                                                                                                Range_Lv3;                                         // 0x0804 (0x0004)
	float                                                                                                Range_Lv4;                                         // 0x0808 (0x0004)
	float                                                                                                Range_Lv5;                                         // 0x080C (0x0004)
	float                                                                                                WarmUpDelay;                                       // 0x0810 (0x0004)
	float                                                                                                WarmUpDelay_Lv1;                                   // 0x0814 (0x0004)
	float                                                                                                WarmUpDelay_Lv2;                                   // 0x0818 (0x0004)
	float                                                                                                WarmUpDelay_Lv3;                                   // 0x081C (0x0004)
	float                                                                                                WarmUpDelay_Lv4;                                   // 0x0820 (0x0004)
	float                                                                                                WarmUpDelay_Lv5;                                   // 0x0824 (0x0004)
	class UClass*                                                                                        GE_BGABuff;                                        // 0x0828 (0x0004)
public:
	void ApplyStatScaling(class AB_BGA_BotTurret_C* BotReference); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:ApplyStatScaling
	void SetLevelUpgrades(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:SetLevelUpgrades
	void SetUpBot(class AFortPlayerPawn* PlayerPawn, FVector SpawnLocation, FRotator SpawnRotation, class UClass* BGATurret); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:SetUpBot
	void Completed_3A74E5BE4F4D85991B8887A89A2350CB(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:Completed_3A74E5BE4F4D85991B8887A89A2350CB
	void Cancelled_3A74E5BE4F4D85991B8887A89A2350CB(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:Cancelled_3A74E5BE4F4D85991B8887A89A2350CB
	void Triggered_3A74E5BE4F4D85991B8887A89A2350CB(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:Triggered_3A74E5BE4F4D85991B8887A89A2350CB
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Generic_BotTurret(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Bot_Turret/GA_Generic_BotTurret.GA_Generic_BotTurret_C:ExecuteUbergraph_GA_Generic_BotTurret
public:
	static class UClass* StaticClass();
};

