#pragma once
#include "FN_Basic.h"

#include "FN_GAB_GenericDeath_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_GenericDeath
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C
// 0x00B4 (0x0790)
class UGAB_GenericDeath_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class UAnimMontage*                                                                                  DeathMontage;                                      // 0x06E0 (0x0004)
	FName                                                                                                DeathMontageSectionName;                           // 0x06E4 (0x0008)
	FVector                                                                                              DeathHitDirection;                                 // 0x06EC (0x000C)
	FHitResult                                                                                           DeathHitResult;                                    // 0x06F8 (0x0080)
	FGameplayTagContainer                                                                                DamageTags;                                        // 0x0778 (0x0018)
public:
	void InitializeDeathHitDirection(FGameplayEventData EventHitData); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:InitializeDeathHitDirection
	void OnCancelled_CD8A514040DDA2A4EF94DD913E1B01E4(); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:OnCancelled_CD8A514040DDA2A4EF94DD913E1B01E4
	void OnInterrupted_CD8A514040DDA2A4EF94DD913E1B01E4(); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:OnInterrupted_CD8A514040DDA2A4EF94DD913E1B01E4
	void OnComplete_CD8A514040DDA2A4EF94DD913E1B01E4(); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:OnComplete_CD8A514040DDA2A4EF94DD913E1B01E4
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:K2_ActivateAbilityFromEvent
	void PickDeathMontageSection(); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:PickDeathMontageSection
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:K2_OnEndAbility
	void ExecuteUbergraph_GAB_GenericDeath(int32_t EntryPoint); // Function /Game/Abilities/NPC/Generic/GAB_GenericDeath.GAB_GenericDeath_C:ExecuteUbergraph_GAB_GenericDeath
public:
	static class UClass* StaticClass();
};

