#pragma once
#include "FN_Basic.h"

#include "FN_GameplayTasks_enums.h"
#include "FN_GameplayTasks_structs.h"
#include "FN_GameplayTasks_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GameplayTasks
*/

// Class /Script/GameplayTasks.GameplayTasksComponent
// 0x0044 (0x00D0)
class UGameplayTasksComponent : public UActorComponent
{
public:
	uint8_t                                                                                              UnknownData_8C[0x4];                               // 0x008C (0x0004) MISSED OFFSET
	TArray<class UGameplayTask*>                                                                         SimulatedTasks;                                    // 0x0090 (0x000C)
	TArray<class UGameplayTask*>                                                                         TaskPriorityQueue;                                 // 0x009C (0x000C)
	uint8_t                                                                                              UnknownData_A8[0xC];                               // 0x00A8 (0x000C) MISSED OFFSET
	TArray<class UGameplayTask*>                                                                         TickingTasks;                                      // 0x00B4 (0x000C)
	uint8_t                                                                                              UnknownData_C0[0x4];                               // 0x00C0 (0x0004) MISSED OFFSET
	struct FGameplayTasks_OnClaimedResourcesChangeSignature__DelegateSignature                           OnClaimedResourcesChange;                          // 0x00C4 (0x000C)
public:
	void OnRep_SimulatedTasks(); // Function /Script/GameplayTasks.GameplayTasksComponent:OnRep_SimulatedTasks
	static EGameplayTaskRunResult K2_RunGameplayTask(TScriptInterface<class UGameplayTaskOwnerInterface> TaskOwner, class UGameplayTask* Task, uint8_t Priority, TArray<class UClass*> AdditionalRequiredResources, TArray<class UClass*> AdditionalClaimedResources); // Function /Script/GameplayTasks.GameplayTasksComponent:K2_RunGameplayTask
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTasks.GameplayTask
// 0x0028 (0x0044)
class UGameplayTask : public UObject
{
public:
	FName                                                                                                InstanceName;                                      // 0x001C (0x0008)
	uint8_t                                                                                              UnknownData_24[0x20];                              // 0x0024 (0x0020) MISSED OFFSET
public:
	void ReadyForActivation(); // Function /Script/GameplayTasks.GameplayTask:ReadyForActivation
	void GenericGameplayTaskDelegate__DelegateSignature(); // DelegateFunction /Script/GameplayTasks.GameplayTask:GenericGameplayTaskDelegate__DelegateSignature
	void EndTask(); // Function /Script/GameplayTasks.GameplayTask:EndTask
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTasks.GameplayTaskOwnerInterface
// 0x0000 (0x001C)
class UGameplayTaskOwnerInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTasks.GameplayTask_SpawnActor
// 0x0034 (0x0078)
class UGameplayTask_SpawnActor : public UGameplayTask
{
public:
	struct FGameplayTasks_GameplayTaskSpawnActorDelegate__DelegateSignature                              Success;                                           // 0x0044 (0x000C)
	struct FGameplayTasks_GameplayTaskSpawnActorDelegate__DelegateSignature                              DidNotSpawn;                                       // 0x0050 (0x000C)
	uint8_t                                                                                              UnknownData_5C[0x18];                              // 0x005C (0x0018) MISSED OFFSET
	class UClass*                                                                                        ClassToSpawn;                                      // 0x0074 (0x0004)
public:
	static class UGameplayTask_SpawnActor* SpawnActor(TScriptInterface<class UGameplayTaskOwnerInterface> TaskOwner, FVector SpawnLocation, FRotator SpawnRotation, class UClass* Class, bool bSpawnOnlyOnAuthority); // Function /Script/GameplayTasks.GameplayTask_SpawnActor:SpawnActor
	void FinishSpawningActor(class UObject* WorldContextObject, class AActor* SpawnedActor); // Function /Script/GameplayTasks.GameplayTask_SpawnActor:FinishSpawningActor
	bool BeginSpawningActor(class UObject* WorldContextObject, class AActor* SpawnedActor); // Function /Script/GameplayTasks.GameplayTask_SpawnActor:BeginSpawningActor
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTasks.GameplayTask_WaitDelay
// 0x0014 (0x0058)
class UGameplayTask_WaitDelay : public UGameplayTask
{
public:
	struct FUGameplayTask_WaitDelay_TaskDelayDelegate__DelegateSignature                                 OnFinish;                                          // 0x0044 (0x000C)
	uint8_t                                                                                              UnknownData_50[0x8];                               // 0x0050 (0x0008) MISSED OFFSET
public:
	static class UGameplayTask_WaitDelay* TaskWaitDelay(TScriptInterface<class UGameplayTaskOwnerInterface> TaskOwner, float Time); // Function /Script/GameplayTasks.GameplayTask_WaitDelay:TaskWaitDelay
	void TaskDelayDelegate__DelegateSignature(); // DelegateFunction /Script/GameplayTasks.GameplayTask_WaitDelay:TaskDelayDelegate__DelegateSignature
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTasks.GameplayTaskResource
// 0x000C (0x0028)
class UGameplayTaskResource : public UObject
{
public:
	int32_t                                                                                              ManualResourceID;                                  // 0x001C (0x0004)
	int8_t                                                                                               AutoResourceID;                                    // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bManuallySetID : 1;                                // 0x0024 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

