#pragma once
#include "FN_Basic.h"

#include "FN_GadgetSelectButton_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GadgetSelectButton
*/

// WidgetBlueprintGeneratedClass /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C
// 0x0039 (0x01F1)
class UGadgetSelectButton_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class USizeBox*                                                                                      Box;                                               // 0x01BC (0x0004)
	class UWidgetSwitcher*                                                                               Content_Switcher;                                  // 0x01C0 (0x0004)
	class UImage*                                                                                        EmptySlot;                                         // 0x01C4 (0x0004)
	class UItem_C*                                                                                       Item;                                              // 0x01C8 (0x0004)
	class UImage*                                                                                        Locked;                                            // 0x01CC (0x0004)
	class UFortGridPickerButton*                                                                         Picker;                                            // 0x01D0 (0x0004)
	struct FUGadgetSelectButton_C_GadgetSelected__DelegateSignature                                      GadgetSelected;                                    // 0x01D4 (0x000C)
	class UFortWorldItem*                                                                                Gadget;                                            // 0x01E0 (0x0004)
	TArray<class UFortWorldItem*>                                                                        AvailableGadgets;                                  // 0x01E4 (0x000C)
	bool                                                                                                 Constructed;                                       // 0x01F0 (0x0001)
public:
	FEventReply On_EmptySlot_MouseButtonDown_0(FGeometry MyGeometry, FPointerEvent MouseEvent); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:On_EmptySlot_MouseButtonDown_0
	FEventReply On_Locked_MouseButtonDown_0(FGeometry MyGeometry, FPointerEvent MouseEvent); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:On_Locked_MouseButtonDown_0
	class UWidget* Get_EmptySlot_ToolTipWidget_0(); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:Get_EmptySlot_ToolTipWidget_0
	class UWidget* Get_Locked_ToolTipWidget_0(); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:Get_Locked_ToolTipWidget_0
	void InternalInit(); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:InternalInit
	void Init(class UFortWorldItem* Gadget, TArray<class UFortWorldItem*> AvailableGadgets); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:Init
	void Construct(); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:Construct
	void BndEvt__Picker_K2Node_ComponentBoundEvent_30_GridPickerTileEvent__DelegateSignature(class UObject* Data, class UFortGridPickerTile* Tile); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:BndEvt__Picker_K2Node_ComponentBoundEvent_30_GridPickerTileEvent__DelegateSignature
	void BndEvt__Item_K2Node_ComponentBoundEvent_56_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:BndEvt__Item_K2Node_ComponentBoundEvent_56_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_GadgetSelectButton(int32_t EntryPoint); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:ExecuteUbergraph_GadgetSelectButton
	void GadgetSelected__DelegateSignature(class UFortWorldItem* Gadget); // Function /Game/UI/HeroSelect/GadgetSelectButton.GadgetSelectButton_C:GadgetSelected__DelegateSignature
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/HeroSelect/GadgetSelectButton.PLACEHOLDER-CLASS__Item_C_154
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__Item_C_154
{
public:
	static class UClass* StaticClass();
};

