#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_FragGrenade_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_FragGrenade
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C
// 0x01A4 (0x0880)
class UGA_Commando_FragGrenade_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Commando_C*                                                                        Commando_Pawn;                                     // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0744 (0x0008)
	class UClass*                                                                                        Prj_Grenade;                                       // 0x074C (0x0004)
	float                                                                                                GrenadeSpeed;                                      // 0x0750 (0x0004)
	float                                                                                                Gravity;                                           // 0x0754 (0x0004)
	class USoundBase*                                                                                    GrenadeSound;                                      // 0x0758 (0x0004)
	class UClass*                                                                                        GE_GrenadeDamage;                                  // 0x075C (0x0004)
	FGameplayTagContainer                                                                                TC_ClusterBombs;                                   // 0x0760 (0x0018)
	int32_t                                                                                              MaxClusterGrenades;                                // 0x0778 (0x0004)
	class UClass*                                                                                        Prj_Cluster;                                       // 0x077C (0x0004)
	float                                                                                                ClusterSpeedMax;                                   // 0x0780 (0x0004)
	FGameplayTagContainer                                                                                TC_BiggerIsBetter;                                 // 0x0784 (0x0018)
	FGameplayTag                                                                                         EC_DefaultExplosion;                               // 0x079C (0x0008)
	FGameplayTag                                                                                         EC_IncreasedRadius;                                // 0x07A4 (0x0008)
	FFortGameplayEffectContainerSpec                                                                     EC_ReturnedEffect;                                 // 0x07AC (0x0064)
	float                                                                                                ExplosionRadius;                                   // 0x0810 (0x0004)
	FGameplayTagContainer                                                                                TC_PerfectEngineering;                             // 0x0814 (0x0018)
	FGameplayTag                                                                                         EventApplyDebilitatingShots;                       // 0x082C (0x0008)
	float                                                                                                Verticle_Throw;                                    // 0x0834 (0x0004)
	float                                                                                                ClusterMinPitch;                                   // 0x0838 (0x0004)
	float                                                                                                ClusterMaxPitch;                                   // 0x083C (0x0004)
	FGameplayTag                                                                                         EC_ClusterExplosion;                               // 0x0840 (0x0008)
	float                                                                                                ClusterSpeedMin;                                   // 0x0848 (0x0004)
	FFortFeedbackHandle                                                                                  GrenadeDialogFeedback;                             // 0x084C (0x0010)
	FGameplayTagContainer                                                                                TC_KeepOut;                                        // 0x085C (0x0018)
	FGameplayTag                                                                                         EC_BurningGround;                                  // 0x0874 (0x0008)
	class UClass*                                                                                        AOE_KeepOut;                                       // 0x087C (0x0004)
public:
	void KeepOut(FProjectileEventData Projectile_Data); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:KeepOut
	void PerfectEngineering(FProjectileEventData Projectile_Data); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:PerfectEngineering
	void ActivateClusterBombs(FProjectileEventData Projectile_Data); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:ActivateClusterBombs
	void ThrowGrenade(class UAbilitySystemComponent* AbilitySystemComponent, class UClass* Base_Grenade, FVector Spawn_Location, FRotator Spawn_Rotation, float Projectile_Speed, float Projectile_Gravity, FFortGameplayEffectContainerSpec Explosion_Gameplay_Spec); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:ThrowGrenade
	void Destroyed_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Destroyed_A0715E3447A5D46682E46A89960E35AA
	void Exploded_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Exploded_A0715E3447A5D46682E46A89960E35AA
	void Stopped_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Stopped_A0715E3447A5D46682E46A89960E35AA
	void Bounced_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Bounced_A0715E3447A5D46682E46A89960E35AA
	void Touched_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Touched_A0715E3447A5D46682E46A89960E35AA
	void Created_A0715E3447A5D46682E46A89960E35AA(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Created_A0715E3447A5D46682E46A89960E35AA
	void Completed_DE7AD8FA464F26E37AC20281DAD7839E(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Completed_DE7AD8FA464F26E37AC20281DAD7839E
	void Cancelled_DE7AD8FA464F26E37AC20281DAD7839E(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Cancelled_DE7AD8FA464F26E37AC20281DAD7839E
	void Triggered_DE7AD8FA464F26E37AC20281DAD7839E(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:Triggered_DE7AD8FA464F26E37AC20281DAD7839E
	void OnFinish_978FA3324D06E995EB838282AB600A46(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:OnFinish_978FA3324D06E995EB838282AB600A46
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Commando_FragGrenade(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Gadgets/FragGrenade/GA_Commando_FragGrenade.GA_Commando_FragGrenade_C:ExecuteUbergraph_GA_Commando_FragGrenade
public:
	static class UClass* StaticClass();
};

