#pragma once
#include "FN_Basic.h"

#include "FN_GA_Generic_SlowField_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Generic_SlowField
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C
// 0x0114 (0x07F0)
class UGA_Generic_SlowField_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   Event_Data;                                        // 0x06E0 (0x0058)
	class AFortPlayerPawn*                                                                               Fort_Player_Pawn;                                  // 0x0738 (0x0004)
	FGameplayTag                                                                                         Event_Activate;                                    // 0x073C (0x0008)
	FFortGameplayAbilityMontageInfo                                                                      Montage;                                           // 0x0744 (0x0044)
	class UClass*                                                                                        SlowFieldClass;                                    // 0x0788 (0x0004)
	float                                                                                                InitialSpeed;                                      // 0x078C (0x0004)
	float                                                                                                Radius;                                            // 0x0790 (0x0004)
	class USoundBase*                                                                                    ThrowSound;                                        // 0x0794 (0x0004)
	FGameplayTag                                                                                         Event_Complete;                                    // 0x0798 (0x0008)
	FGameplayAttribute                                                                                   MartialArtsAcademySubBuilding3;                    // 0x07A0 (0x0004)
	float                                                                                                Radius_Lv1;                                        // 0x07A4 (0x0004)
	float                                                                                                Radius_Lv2;                                        // 0x07A8 (0x0004)
	float                                                                                                Radius_Lv3;                                        // 0x07AC (0x0004)
	float                                                                                                Radius_Lv4;                                        // 0x07B0 (0x0004)
	float                                                                                                Radius_Lv5;                                        // 0x07B4 (0x0004)
	float                                                                                                Height;                                            // 0x07B8 (0x0004)
	float                                                                                                DefaultHeight;                                     // 0x07BC (0x0004)
	float                                                                                                Duration;                                          // 0x07C0 (0x0004)
	float                                                                                                Duration_Lv1;                                      // 0x07C4 (0x0004)
	float                                                                                                Duration_Lv2;                                      // 0x07C8 (0x0004)
	float                                                                                                Duration_Lv3;                                      // 0x07CC (0x0004)
	float                                                                                                Duration_Lv4;                                      // 0x07D0 (0x0004)
	float                                                                                                Duration_Lv5;                                      // 0x07D4 (0x0004)
	float                                                                                                Activation_Time;                                   // 0x07D8 (0x0004)
	float                                                                                                ActivationTime_Lv1;                                // 0x07DC (0x0004)
	float                                                                                                ActivationTime_Lv2;                                // 0x07E0 (0x0004)
	float                                                                                                ActivationTime_Lv3;                                // 0x07E4 (0x0004)
	float                                                                                                ActivationTime_Lv4;                                // 0x07E8 (0x0004)
	float                                                                                                ActivationTime_Lv5;                                // 0x07EC (0x0004)
public:
	void SetVariable_Upgrades(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:SetVariable_Upgrades
	void SpawnSlowField(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:SpawnSlowField
	void Completed_A2F5E033421F17DEA0CEC299A791A6C9(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:Completed_A2F5E033421F17DEA0CEC299A791A6C9
	void Cancelled_A2F5E033421F17DEA0CEC299A791A6C9(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:Cancelled_A2F5E033421F17DEA0CEC299A791A6C9
	void Triggered_A2F5E033421F17DEA0CEC299A791A6C9(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:Triggered_A2F5E033421F17DEA0CEC299A791A6C9
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Generic_SlowField(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/SlowField/GA_Generic_SlowField.GA_Generic_SlowField_C:ExecuteUbergraph_GA_Generic_SlowField
public:
	static class UClass* StaticClass();
};

