#pragma once
#include "FN_Basic.h"

#include "FN_GCN_TakerMarkedForDeath_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GCN_TakerMarkedForDeath
*/

// BlueprintGeneratedClass /Game/Abilities/NPC/Taker/GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C
// 0x0031 (0x02DD)
class AGCN_TakerMarkedForDeath_C : public AFortGameplayCueNotify_Looping
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x02AC (0x0004)
	class UParticleSystemComponent*                                                                      OverHeadEffect;                                    // 0x02B0 (0x0004)
	class UFortMiniMapComponent*                                                                         MiniMapCrosshair;                                  // 0x02B4 (0x0004)
	class UFortMiniMapComponent*                                                                         MiniMapIconBackground;                             // 0x02B8 (0x0004)
	FFortFeedbackHandle                                                                                  TakerFeedbackEvent;                                // 0x02BC (0x0010)
	float                                                                                                TakerFeedbackRepeatDelay;                          // 0x02CC (0x0004)
	float                                                                                                TakerFeedbackInitialDelay;                         // 0x02D0 (0x0004)
	FGameplayTag                                                                                         TC_GameplayStatusStun;                             // 0x02D4 (0x0008)
	bool                                                                                                 PlayerIsStunned;                                   // 0x02DC (0x0001)
public:
	void UserConstructionScript(); // Function /Game/Abilities/NPC/Taker/GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/NPC/Taker/GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C:ReceiveBeginPlay
	void SoulSuckCheck(); // Function /Game/Abilities/NPC/Taker/GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C:SoulSuckCheck
	void ExecuteUbergraph_GCN_TakerMarkedForDeath(int32_t EntryPoint); // Function /Game/Abilities/NPC/Taker/GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C:ExecuteUbergraph_GCN_TakerMarkedForDeath
public:
	static class UClass* StaticClass();
};

