#pragma once
#include "FN_Basic.h"

#include "FN_GA_Teleporter_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Teleporter
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C
// 0x0058 (0x0734)
class UGA_Teleporter_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class UClass*                                                                                        TeleporterClass;                                   // 0x06E0 (0x0004)
	class AFortPlayerPawn*                                                                               PlayerPawn;                                        // 0x06E4 (0x0004)
	class AFortAbilityDecoTool*                                                                          DecoTool;                                          // 0x06E8 (0x0004)
	FGameplayAttribute                                                                                   BuildingAttribute;                                 // 0x06EC (0x0004)
	TArray<float>                                                                                        UpgradeMaxRange;                                   // 0x06F0 (0x000C)
	TArray<float>                                                                                        UpgradeRechargeDecay;                              // 0x06FC (0x000C)
	TArray<FLinearColor>                                                                                 PlayerColors;                                      // 0x0708 (0x000C)
	FAbilityToolSpawnParameters                                                                          SpawnParameters;                                   // 0x0714 (0x0020)
public:
	void GetSecondTeleporterSpawnLoc(class AActor* FirstTeleporter, FTransform SpawnTransform); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C:GetSecondTeleporterSpawnLoc
	void InitPortalAndSpawnTargetTeleporter(class AB_Teleporter_C* NewTeleporter); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C:InitPortalAndSpawnTargetTeleporter
	void DestroyExistingPortalsForPlayer(class AController* Controller); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C:DestroyExistingPortalsForPlayer
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Teleporter(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Teleporter/GA_Teleporter.GA_Teleporter_C:ExecuteUbergraph_GA_Teleporter
public:
	static class UClass* StaticClass();
};

