#pragma once
#include "FN_Basic.h"

#include "FN_GA_Generic_ProximityMines_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Generic_ProximityMines
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C
// 0x0160 (0x083C)
class UGA_Generic_ProximityMines_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class AFortPlayerPawn*                                                                               PlayerPawn;                                        // 0x06E0 (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E4 (0x0058)
	float                                                                                                Prj_Speed;                                         // 0x073C (0x0004)
	float                                                                                                Prj_Gravity;                                       // 0x0740 (0x0004)
	float                                                                                                VerticleThrow;                                     // 0x0744 (0x0004)
	FFortGameplayAbilityMontageInfo                                                                      ThrowMontage;                                      // 0x0748 (0x0044)
	FGameplayTag                                                                                         EventActivation;                                   // 0x078C (0x0008)
	class UClass*                                                                                        ProxyMine_BGA;                                     // 0x0794 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0798 (0x0008)
	class UAnimMontage*                                                                                  M_ThrowMine;                                       // 0x07A0 (0x0004)
	FGameplayTag                                                                                         TargetAOE;                                         // 0x07A4 (0x0008)
	FGameplayAttribute                                                                                   GadgetWorkshopSubBuilding3;                        // 0x07AC (0x0004)
	int32_t                                                                                              ExplosionLevel;                                    // 0x07B0 (0x0004)
	class UClass*                                                                                        Bonus_Damage;                                      // 0x07B4 (0x0004)
	float                                                                                                DamageMultiplier;                                  // 0x07B8 (0x0004)
	float                                                                                                Damage_Multiplier_base;                            // 0x07BC (0x0004)
	float                                                                                                DamageMultiplier_Lv1;                              // 0x07C0 (0x0004)
	float                                                                                                DamageMultiplier2;                                 // 0x07C4 (0x0004)
	float                                                                                                DamageMultiplier_Lv2;                              // 0x07C8 (0x0004)
	float                                                                                                DamageMultiplier_Lv3;                              // 0x07CC (0x0004)
	float                                                                                                DamageMultiplier_Lv4;                              // 0x07D0 (0x0004)
	float                                                                                                DamageMultiplier_Lv5;                              // 0x07D4 (0x0004)
	int32_t                                                                                              RangeBase;                                         // 0x07D8 (0x0004)
	int32_t                                                                                              Range_Lv1;                                         // 0x07DC (0x0004)
	int32_t                                                                                              Range_Lv2;                                         // 0x07E0 (0x0004)
	int32_t                                                                                              Range_Lv3;                                         // 0x07E4 (0x0004)
	int32_t                                                                                              Range_Lv4;                                         // 0x07E8 (0x0004)
	int32_t                                                                                              Range_Lv5;                                         // 0x07EC (0x0004)
	float                                                                                                Activation_Radius;                                 // 0x07F0 (0x0004)
	float                                                                                                Activation_Radius_Lv1;                             // 0x07F4 (0x0004)
	float                                                                                                Activation_Radius_Lv2;                             // 0x07F8 (0x0004)
	float                                                                                                Activation_Radius_Lv3;                             // 0x07FC (0x0004)
	float                                                                                                Activation_Radius_Lv4;                             // 0x0800 (0x0004)
	float                                                                                                Activation_Radius_Lv5;                             // 0x0804 (0x0004)
	float                                                                                                Activation_Delay;                                  // 0x0808 (0x0004)
	float                                                                                                Activation_Delay_Lv1;                              // 0x080C (0x0004)
	float                                                                                                Activation_Delay_Lv2;                              // 0x0810 (0x0004)
	float                                                                                                Activation_Delay_Lv3;                              // 0x0814 (0x0004)
	float                                                                                                Activation_Delay_Lv4;                              // 0x0818 (0x0004)
	float                                                                                                Activation_Delay_Lv5;                              // 0x081C (0x0004)
	FFortFeedbackHandle                                                                                  ProximityMineFeedback;                             // 0x0820 (0x0010)
	float                                                                                                LocalDamageBoost;                                  // 0x0830 (0x0004)
	class UClass*                                                                                        GE_BGA_Buff;                                       // 0x0834 (0x0004)
	class AB_BGA_ProximityMine_C*                                                                        Ref_To_Mine;                                       // 0x0838 (0x0004)
public:
	void Set_Level_Upgrades(); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:Set_Level_Upgrades
	void OnCancelled_3526FD6A4CBC2AA7699541A0CD0D006C(); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:OnCancelled_3526FD6A4CBC2AA7699541A0CD0D006C
	void OnInterrupted_3526FD6A4CBC2AA7699541A0CD0D006C(); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:OnInterrupted_3526FD6A4CBC2AA7699541A0CD0D006C
	void OnComplete_3526FD6A4CBC2AA7699541A0CD0D006C(); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:OnComplete_3526FD6A4CBC2AA7699541A0CD0D006C
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Generic_ProximityMines(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Proximity_Mines/GA_Generic_ProximityMines.GA_Generic_ProximityMines_C:ExecuteUbergraph_GA_Generic_ProximityMines
public:
	static class UClass* StaticClass();
};

