#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_GravitySphere_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_GravitySphere
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C
// 0x015C (0x0838)
class UGA_Outlander_GravitySphere_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Outlander_C*                                                                       Outlander_Pawn;                                    // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	class UClass*                                                                                        Prj_MatterCollector;                               // 0x0744 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0748 (0x0008)
	FFortGameplayEffectContainerSpec                                                                     Spec_Damage;                                       // 0x0750 (0x0064)
	FGameplayTag                                                                                         EC_BaseTargetting;                                 // 0x07B4 (0x0008)
	FGameplayTag                                                                                         EC_BaseDamage;                                     // 0x07BC (0x0008)
	class UClass*                                                                                        GE_MatterCollectorDamage;                          // 0x07C4 (0x0004)
	float                                                                                                ProjectileSpeed;                                   // 0x07C8 (0x0004)
	float                                                                                                ProjectileGravity;                                 // 0x07CC (0x0004)
	FGameplayTagContainer                                                                                TC_HowInTheWorld;                                  // 0x07D0 (0x0018)
	class UClass*                                                                                        GE_HowInTheWorld;                                  // 0x07E8 (0x0004)
	class UClass*                                                                                        GE_DefaultDamage;                                  // 0x07EC (0x0004)
	bool                                                                                                 Stopped;                                           // 0x07F0 (0x0001)
	uint8_t                                                                                              UnknownData_7F1[0x3];                              // 0x07F1 (0x0003) MISSED OFFSET
	FFortFeedbackHandle                                                                                  MatterCollectDialogFeedback;                       // 0x07F4 (0x0010)
	FGameplayTag                                                                                         EC_FriendlyTargets;                                // 0x0804 (0x0008)
	FVector                                                                                              Impact_Location;                                   // 0x080C (0x000C)
	FGameplayTag                                                                                         EC_EnemyTargets;                                   // 0x0818 (0x0008)
	FGameplayTagContainer                                                                                TC_HeavyStuff;                                     // 0x0820 (0x0018)
public:
	FTransform GetCustomAbilitySourceTransform() const; // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:GetCustomAbilitySourceTransform
	void DamageTargets(FProjectileEventData ProjectileEventData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:DamageTargets
	void SetupCollector(class UClass* MatterCollector, FVector SpawnLocation, FRotator ProjectileRotation, float MatterSpeed, float MatterGravity, FFortGameplayEffectContainerSpec TargetSpec); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:SetupCollector
	void Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Destroyed_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Exploded_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Stopped_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Bounced_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Touched_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Touched_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Created_E1B7FD7947617E82F2B80E9DEA42A6E8(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Created_E1B7FD7947617E82F2B80E9DEA42A6E8
	void Completed_A8F6F5F8468ED284B63ADFA133F95943(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Completed_A8F6F5F8468ED284B63ADFA133F95943
	void Cancelled_A8F6F5F8468ED284B63ADFA133F95943(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Cancelled_A8F6F5F8468ED284B63ADFA133F95943
	void Triggered_A8F6F5F8468ED284B63ADFA133F95943(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:Triggered_A8F6F5F8468ED284B63ADFA133F95943
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Outlander_GravitySphere(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/GravitySphere/GA_Outlander_GravitySphere.GA_Outlander_GravitySphere_C:ExecuteUbergraph_GA_Outlander_GravitySphere
public:
	static class UClass* StaticClass();
};

