#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_InTheZone_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_InTheZone
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZone.GA_Outlander_InTheZone_C
// 0x009C (0x0778)
class UGA_Outlander_InTheZone_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Outlander_C*                                                                       OutlanderPawn;                                     // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	int32_t                                                                                              HitCount;                                          // 0x0744 (0x0004)
	int32_t                                                                                              HitThreshold;                                      // 0x0748 (0x0004)
	FGameplayTag                                                                                         EventEnterTheZone;                                 // 0x074C (0x0008)
	class UClass*                                                                                        GE_InTheZoneHit;                                   // 0x0754 (0x0004)
	FGameplayTag                                                                                         EventActivateKeenEyes;                             // 0x0758 (0x0008)
	FGameplayTagContainer                                                                                TC_InTheZone;                                      // 0x0760 (0x0018)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZone.GA_Outlander_InTheZone_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Outlander_InTheZone(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZone.GA_Outlander_InTheZone_C:ExecuteUbergraph_GA_Outlander_InTheZone
public:
	static class UClass* StaticClass();
};

