#pragma once
#include "FN_Basic.h"

#include "FN_GA_Ninja_PoisonedBlade_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Ninja_PoisonedBlade
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Traits/Blademastery/GA_Ninja_PoisonedBlade.GA_Ninja_PoisonedBlade_C
// 0x00FC (0x07D8)
class UGA_Ninja_PoisonedBlade_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   PayloadData;                                       // 0x06E0 (0x0058)
	class UClass*                                                                                        GE_PoisonedBladeDOT;                               // 0x0738 (0x0004)
	FGameplayTagContainer                                                                                TC_EdgedDamage;                                    // 0x073C (0x0018)
	FGameplayTagContainer                                                                                TC_IsWeapon;                                       // 0x0754 (0x0018)
	FGameplayEventData                                                                                   EventData;                                         // 0x076C (0x0058)
	class APlayerPawn_Ninja_C*                                                                           NinjaPawn;                                         // 0x07C4 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x07C8 (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x07D0 (0x0008)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload); // Function /Game/Abilities/Player/Ninja/Traits/Blademastery/GA_Ninja_PoisonedBlade.GA_Ninja_PoisonedBlade_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Ninja/Traits/Blademastery/GA_Ninja_PoisonedBlade.GA_Ninja_PoisonedBlade_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Ninja_PoisonedBlade(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Traits/Blademastery/GA_Ninja_PoisonedBlade.GA_Ninja_PoisonedBlade_C:ExecuteUbergraph_GA_Ninja_PoisonedBlade
public:
	static class UClass* StaticClass();
};

