#pragma once
#include "FN_Basic.h"

#include "FN_GA_Ninja_ThrowingStars_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Ninja_ThrowingStars
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C
// 0x0204 (0x08E0)
class UGA_Ninja_ThrowingStars_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class UAnimMontage*                                                                                  AN_ThrowStars;                                     // 0x06E0 (0x0004)
	class UClass*                                                                                        Prj_ThrowingStar;                                  // 0x06E4 (0x0004)
	class AFortPawn*                                                                                     Ref_Instigator;                                    // 0x06E8 (0x0004)
	FVector                                                                                              TransformOffsetA1;                                 // 0x06EC (0x000C)
	FVector                                                                                              TransformOffsetB1;                                 // 0x06F8 (0x000C)
	float                                                                                                NegHorizontalSpread1;                              // 0x0704 (0x0004)
	float                                                                                                PosHorizontalSpread1;                              // 0x0708 (0x0004)
	FVector                                                                                              StartLocation;                                     // 0x070C (0x000C)
	float                                                                                                InitialSpeed;                                      // 0x0718 (0x0004)
	float                                                                                                ThrowingStarGravity;                               // 0x071C (0x0004)
	FRotator                                                                                             StartRotation;                                     // 0x0720 (0x000C)
	FVector                                                                                              TransformOffsetC1;                                 // 0x072C (0x000C)
	float                                                                                                NegHorizontalSpread2;                              // 0x0738 (0x0004)
	FVector                                                                                              TransformOffsetD1;                                 // 0x073C (0x000C)
	float                                                                                                PosHorizontalSpread2;                              // 0x0748 (0x0004)
	FVector                                                                                              TransformOffsetE1;                                 // 0x074C (0x000C)
	float                                                                                                NegHorizontalSpread3;                              // 0x0758 (0x0004)
	FVector                                                                                              TransformOffsetF1;                                 // 0x075C (0x000C)
	float                                                                                                PosHorizontalSpread3;                              // 0x0768 (0x0004)
	FGameplayTagContainer                                                                                TC_StarsUpgrade1;                                  // 0x076C (0x0018)
	FGameplayTagContainer                                                                                TC_StarsUpgrade2;                                  // 0x0784 (0x0018)
	FGameplayTag                                                                                         EventComplete;                                     // 0x079C (0x0008)
	FGameplayTag                                                                                         EventActivation;                                   // 0x07A4 (0x0008)
	FFortAbilityTargetSelection                                                                          T_Explosion;                                       // 0x07AC (0x004C)
	class USoundBase*                                                                                    ActivationSound;                                   // 0x07F8 (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x07FC (0x0058)
	FGameplayAttribute                                                                                   Att_TargetDummiesLevel;                            // 0x0854 (0x0004)
	class AActor*                                                                                        HomingTarget;                                      // 0x0858 (0x0004)
	bool                                                                                                 ShouldHome;                                        // 0x085C (0x0001)
	bool                                                                                                 Cascade;                                           // 0x085D (0x0001)
	uint8_t                                                                                              UnknownData_85E[0x2];                              // 0x085E (0x0002) MISSED OFFSET
	FGameplayTag                                                                                         EC_StarDamage;                                     // 0x0860 (0x0008)
	FGameplayTagContainer                                                                                TC_NinjaTraining2;                                 // 0x0868 (0x0018)
	FGameplayTag                                                                                         EC_AfflictionStar;                                 // 0x0880 (0x0008)
	FGameplayTagContainer                                                                                TC_RainOfDeath;                                    // 0x0888 (0x0018)
	bool                                                                                                 RainOfDeath;                                       // 0x08A0 (0x0001)
	uint8_t                                                                                              UnknownData_8A1[0x3];                              // 0x08A1 (0x0003) MISSED OFFSET
	int32_t                                                                                              ThrowNumber;                                       // 0x08A4 (0x0004)
	bool                                                                                                 IsAuthority;                                       // 0x08A8 (0x0001)
	uint8_t                                                                                              UnknownData_8A9[0x3];                              // 0x08A9 (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_Extra2Stars;                                    // 0x08AC (0x0018)
	bool                                                                                                 ThrowLeftStar;                                     // 0x08C4 (0x0001)
	bool                                                                                                 ThrowRightStar;                                    // 0x08C5 (0x0001)
	uint8_t                                                                                              UnknownData_8C6[0x2];                              // 0x08C6 (0x0002) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_Cascade;                                        // 0x08C8 (0x0018)
public:
	void SetupVariables(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:SetupVariables
	void ThrowCascade(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:ThrowCascade
	void ThrowAdditionalStars(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:ThrowAdditionalStars
	void Throw_Lv3_Stars(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Throw Lv3 Stars
	void Thow_Lv2_Stars(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Thow Lv2 Stars
	void ThrowBasicStars(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:ThrowBasicStars
	void SpawnThrowingStar(FVector Transform_Offset, float Horizontal_Spread, class AActor* Homing_Target); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:SpawnThrowingStar
	void Cancelled_F7576E764ABBFFFBF1A6BE95A742E0A6(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Cancelled_F7576E764ABBFFFBF1A6BE95A742E0A6
	void Targeted_F7576E764ABBFFFBF1A6BE95A742E0A6(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Targeted_F7576E764ABBFFFBF1A6BE95A742E0A6
	void Completed_6FEC3EAA4C7675A1295702BBAE17678C(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Completed_6FEC3EAA4C7675A1295702BBAE17678C
	void Cancelled_6FEC3EAA4C7675A1295702BBAE17678C(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Cancelled_6FEC3EAA4C7675A1295702BBAE17678C
	void Triggered_6FEC3EAA4C7675A1295702BBAE17678C(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:Triggered_6FEC3EAA4C7675A1295702BBAE17678C
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Ninja_ThrowingStars(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Gadgets/ThrowingStars/GA_Ninja_ThrowingStars.GA_Ninja_ThrowingStars_C:ExecuteUbergraph_GA_Ninja_ThrowingStars
public:
	static class UClass* StaticClass();
};

