#pragma once
#include "FN_Basic.h"

#include "FN_GameplayAbilities_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTasks_enums.h"
#include "FN_GameplayTasks_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GameplayAbilities
*/

// ScriptStruct /Script/GameplayAbilities.GameplayAttribute
// 0x0004 (0x0004)
struct FGameplayAttribute
{
	class UProperty*                                                                                     Attribute;                                         // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectModifiedAttribute
// 0x0008 (0x0008)
struct FGameplayEffectModifiedAttribute
{
	FGameplayAttribute                                                                                   Attribute;                                         // 0x0000 (0x0004)
	float                                                                                                TotalMagnitude;                                    // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectAttributeCaptureDefinition
// 0x0008 (0x0008)
struct FGameplayEffectAttributeCaptureDefinition
{
	FGameplayAttribute                                                                                   AttributeToCapture;                                // 0x0000 (0x0004)
	EGameplayEffectAttributeCaptureSource                                                                AttributeSource;                                   // 0x0004 (0x0001)
	bool                                                                                                 bSnapshot;                                         // 0x0005 (0x0001)
	uint8_t                                                                                              UnknownData_6[0x2];                                // 0x0006 (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectAttributeCaptureSpec
// 0x0010 (0x0010)
struct FGameplayEffectAttributeCaptureSpec
{
	FGameplayEffectAttributeCaptureDefinition                                                            BackingDefinition;                                 // 0x0000 (0x0008)
	uint8_t                                                                                              UnknownData_8[0x8];                                // 0x0008 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectAttributeCaptureSpecContainer
// 0x001C (0x001C)
struct FGameplayEffectAttributeCaptureSpecContainer
{
	TArray<FGameplayEffectAttributeCaptureSpec>                                                          SourceAttributes;                                  // 0x0000 (0x000C)
	TArray<FGameplayEffectAttributeCaptureSpec>                                                          TargetAttributes;                                  // 0x000C (0x000C)
	bool                                                                                                 bHasNonSnapshottedAttributes;                      // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.TagContainerAggregator
// 0x0064 (0x0064)
struct FTagContainerAggregator
{
	FGameplayTagContainer                                                                                CapturedActorTags;                                 // 0x0000 (0x0018)
	FGameplayTagContainer                                                                                CapturedSpecTags;                                  // 0x0018 (0x0018)
	FGameplayTagContainer                                                                                ScopedTags;                                        // 0x0030 (0x0018)
	uint8_t                                                                                              UnknownData_48[0x1C];                              // 0x0048 (0x001C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ModifierSpec
// 0x0004 (0x0004)
struct FModifierSpec
{
	float                                                                                                EvaluatedMagnitude;                                // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ScalableFloat
// 0x0014 (0x0014)
struct FScalableFloat
{
	float                                                                                                Value;                                             // 0x0000 (0x0004)
	FCurveTableRowHandle                                                                                 Curve;                                             // 0x0004 (0x000C)
	uint8_t                                                                                              UnknownData_10[0x4];                               // 0x0010 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilitySpecHandle
// 0x0004 (0x0004)
struct FGameplayAbilitySpecHandle
{
	int32_t                                                                                              Handle;                                            // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilitySpecDef
// 0x002C (0x002C)
struct FGameplayAbilitySpecDef
{
	class UClass*                                                                                        Ability;                                           // 0x0000 (0x0004)
	int32_t                                                                                              Level;                                             // 0x0004 (0x0004)
	FScalableFloat                                                                                       LevelScalableFloat;                                // 0x0008 (0x0014)
	int32_t                                                                                              InputID;                                           // 0x001C (0x0004)
	EGameplayEffectGrantedAbilityRemovePolicy                                                            RemovalPolicy;                                     // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	class UObject*                                                                                       SourceObject;                                      // 0x0024 (0x0004)
	FGameplayAbilitySpecHandle                                                                           AssignedHandle;                                    // 0x0028 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectContextHandle
// 0x000C (0x000C)
struct FGameplayEffectContextHandle
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectSpec
// 0x01A8 (0x01A8)
struct FGameplayEffectSpec
{
	class UGameplayEffect*                                                                               Def;                                               // 0x0000 (0x0004)
	TArray<FGameplayEffectModifiedAttribute>                                                             ModifiedAttributes;                                // 0x0004 (0x000C)
	FGameplayEffectAttributeCaptureSpecContainer                                                         CapturedRelevantAttributes;                        // 0x0010 (0x001C)
	uint8_t                                                                                              UnknownData_2C[0xC];                               // 0x002C (0x000C) MISSED OFFSET
	float                                                                                                Duration;                                          // 0x0038 (0x0004)
	float                                                                                                Period;                                            // 0x003C (0x0004)
	float                                                                                                ChanceToApplyToTarget;                             // 0x0040 (0x0004)
	FTagContainerAggregator                                                                              CapturedSourceTags;                                // 0x0044 (0x0064)
	FTagContainerAggregator                                                                              CapturedTargetTags;                                // 0x00A8 (0x0064)
	FGameplayTagContainer                                                                                DynamicGrantedTags;                                // 0x010C (0x0018)
	FGameplayTagContainer                                                                                DynamicAssetTags;                                  // 0x0124 (0x0018)
	TArray<FModifierSpec>                                                                                Modifiers;                                         // 0x013C (0x000C)
	int32_t                                                                                              StackCount;                                        // 0x0148 (0x0004)
	uint8_t                                                                                              bCompletedSourceAttributeCapture : 1;              // 0x014C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bCompletedTargetAttributeCapture : 1;              // 0x014C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bDurationLocked : 1;                               // 0x014C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_14D[0x3];                              // 0x014D (0x0003) MISSED OFFSET
	TArray<FGameplayAbilitySpecDef>                                                                      GrantedAbilitySpecs;                               // 0x0150 (0x000C)
	uint8_t                                                                                              UnknownData_15C[0x3C];                             // 0x015C (0x003C) MISSED OFFSET
	FGameplayEffectContextHandle                                                                         EffectContext;                                     // 0x0198 (0x000C)
	float                                                                                                Level;                                             // 0x01A4 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.PredictionKey
// 0x000C (0x000C)
struct FPredictionKey
{
	int16_t                                                                                              Current;                                           // 0x0000 (0x0002)
	int16_t                                                                                              Base;                                              // 0x0002 (0x0002)
	class UPackageMap*                                                                                   PredictiveConnection;                              // 0x0004 (0x0004)
	bool                                                                                                 bIsStale;                                          // 0x0008 (0x0001)
	bool                                                                                                 bIsServerInitiated;                                // 0x0009 (0x0001)
	uint8_t                                                                                              UnknownData_A[0x2];                                // 0x000A (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayEffect
// 0x020C (0x0218)
struct FActiveGameplayEffect : public FFastArraySerializerItem
{
	uint8_t                                                                                              UnknownData_C[0x4];                                // 0x000C (0x0004) MISSED OFFSET
	FGameplayEffectSpec                                                                                  Spec;                                              // 0x0010 (0x01A8)
	FPredictionKey                                                                                       PredictionKey;                                     // 0x01B8 (0x000C)
	float                                                                                                StartServerWorldTime;                              // 0x01C4 (0x0004)
	float                                                                                                CachedStartServerWorldTime;                        // 0x01C8 (0x0004)
	float                                                                                                StartWorldTime;                                    // 0x01CC (0x0004)
	bool                                                                                                 bIsInhibited;                                      // 0x01D0 (0x0001)
	uint8_t                                                                                              UnknownData_1D1[0x47];                             // 0x01D1 (0x0047) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayEffectHandle
// 0x0004 (0x0004)
struct FActiveGameplayEffectHandle
{
	int32_t                                                                                              Handle;                                            // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectSpecHandle
// 0x000C (0x000C)
struct FGameplayEffectSpecHandle
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEventData
// 0x0058 (0x0058)
struct FGameplayEventData
{
	FGameplayTag                                                                                         EventTag;                                          // 0x0000 (0x0008)
	class AActor*                                                                                        Instigator;                                        // 0x0008 (0x0004)
	class AActor*                                                                                        Target;                                            // 0x000C (0x0004)
	class UObject*                                                                                       OptionalObject;                                    // 0x0010 (0x0004)
	class UObject*                                                                                       OptionalObject2;                                   // 0x0014 (0x0004)
	FGameplayEffectContextHandle                                                                         ContextHandle;                                     // 0x0018 (0x000C)
	FGameplayTagContainer                                                                                InstigatorTags;                                    // 0x0024 (0x0018)
	FGameplayTagContainer                                                                                TargetTags;                                        // 0x003C (0x0018)
	float                                                                                                EventMagnitude;                                    // 0x0054 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityActivationInfo
// 0x0010 (0x0010)
struct FGameplayAbilityActivationInfo
{
	EGameplayAbilityActivationMode                                                                       ActivationMode;                                    // 0x0000 (0x0001)
	uint8_t                                                                                              bCanBeEndedByOtherInstance : 1;                    // 0x0001 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_2[0x2];                                // 0x0002 (0x0002) MISSED OFFSET
	FPredictionKey                                                                                       PredictionKeyWhenActivated;                        // 0x0004 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectSpecForRPC
// 0x0050 (0x0050)
struct FGameplayEffectSpecForRPC
{
	class UGameplayEffect*                                                                               Def;                                               // 0x0000 (0x0004)
	TArray<FGameplayEffectModifiedAttribute>                                                             ModifiedAttributes;                                // 0x0004 (0x000C)
	FGameplayEffectContextHandle                                                                         EffectContext;                                     // 0x0010 (0x000C)
	FGameplayTagContainer                                                                                AggregatedSourceTags;                              // 0x001C (0x0018)
	FGameplayTagContainer                                                                                AggregatedTargetTags;                              // 0x0034 (0x0018)
	float                                                                                                Level;                                             // 0x004C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayCueParameters
// 0x0084 (0x0084)
struct FGameplayCueParameters
{
	float                                                                                                NormalizedMagnitude;                               // 0x0000 (0x0004)
	float                                                                                                RawMagnitude;                                      // 0x0004 (0x0004)
	FGameplayEffectContextHandle                                                                         EffectContext;                                     // 0x0008 (0x000C)
	FName                                                                                                MatchedTagName;                                    // 0x0014 (0x0008)
	FGameplayTag                                                                                         OriginalTag;                                       // 0x001C (0x0008)
	FGameplayTagContainer                                                                                AggregatedSourceTags;                              // 0x0024 (0x0018)
	FGameplayTagContainer                                                                                AggregatedTargetTags;                              // 0x003C (0x0018)
	FVector_NetQuantize10                                                                                Location;                                          // 0x0054 (0x000C)
	FVector_NetQuantizeNormal                                                                            Normal;                                            // 0x0060 (0x000C)
	TWeakObjectPtr<class AActor>                                                                         Instigator;                                        // 0x006C (0x0008)
	TWeakObjectPtr<class AActor>                                                                         EffectCauser;                                      // 0x0074 (0x0008)
	TWeakObjectPtr<class UObject>                                                                        SourceObject;                                      // 0x007C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetDataHandle
// 0x0014 (0x0014)
struct FGameplayAbilityTargetDataHandle
{
	uint8_t                                                                                              UnknownData_0[0x14];                               // 0x0000 (0x0014) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayCue
// 0x0018 (0x0024)
struct FActiveGameplayCue : public FFastArraySerializerItem
{
	FGameplayTag                                                                                         GameplayCueTag;                                    // 0x000C (0x0008)
	FPredictionKey                                                                                       PredictionKey;                                     // 0x0014 (0x000C)
	bool                                                                                                 bPredictivelyRemoved;                              // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayCueContainer
// 0x0010 (0x0090)
struct FActiveGameplayCueContainer : public FFastArraySerializer
{
	TArray<FActiveGameplayCue>                                                                           GameplayCues;                                      // 0x0080 (0x000C)
	class UAbilitySystemComponent*                                                                       Owner;                                             // 0x008C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayEffectsContainer
// 0x021C (0x029C)
struct FActiveGameplayEffectsContainer : public FFastArraySerializer
{
	uint8_t                                                                                              UnknownData_80[0x24];                              // 0x0080 (0x0024) MISSED OFFSET
	TArray<FActiveGameplayEffect>                                                                        GameplayEffects_Internal;                          // 0x00A4 (0x000C)
	uint8_t                                                                                              UnknownData_B0[0x1EC];                             // 0x00B0 (0x01EC) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityLocalAnimMontage
// 0x0018 (0x0018)
struct FGameplayAbilityLocalAnimMontage
{
	class UAnimMontage*                                                                                  AnimMontage;                                       // 0x0000 (0x0004)
	bool                                                                                                 PlayBit;                                           // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	FPredictionKey                                                                                       PredictionKey;                                     // 0x0008 (0x000C)
	class UGameplayAbility*                                                                              AnimatingAbility;                                  // 0x0014 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityRepAnimMontage
// 0x0020 (0x0020)
struct FGameplayAbilityRepAnimMontage
{
	class UAnimMontage*                                                                                  AnimMontage;                                       // 0x0000 (0x0004)
	float                                                                                                PlayRate;                                          // 0x0004 (0x0004)
	float                                                                                                Position;                                          // 0x0008 (0x0004)
	float                                                                                                BlendTime;                                         // 0x000C (0x0004)
	uint8_t                                                                                              NextSectionID;                                     // 0x0010 (0x0001)
	uint8_t                                                                                              IsStopped : 1;                                     // 0x0011 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              ForcePlayBit : 1;                                  // 0x0011 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_12[0x2];                               // 0x0012 (0x0002) MISSED OFFSET
	FPredictionKey                                                                                       PredictionKey;                                     // 0x0014 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilitySpec
// 0x0044 (0x0050)
struct FGameplayAbilitySpec : public FFastArraySerializerItem
{
	FGameplayAbilitySpecHandle                                                                           Handle;                                            // 0x000C (0x0004)
	class UGameplayAbility*                                                                              Ability;                                           // 0x0010 (0x0004)
	int32_t                                                                                              Level;                                             // 0x0014 (0x0004)
	int32_t                                                                                              InputID;                                           // 0x0018 (0x0004)
	class UObject*                                                                                       SourceObject;                                      // 0x001C (0x0004)
	uint8_t                                                                                              ActiveCount;                                       // 0x0020 (0x0001)
	uint8_t                                                                                              InputPressed : 1;                                  // 0x0021 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              RemoveAfterActivation : 1;                         // 0x0021 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              PendingRemove : 1;                                 // 0x0021 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_22[0x2];                               // 0x0022 (0x0002) MISSED OFFSET
	FGameplayAbilityActivationInfo                                                                       ActivationInfo;                                    // 0x0024 (0x0010)
	TArray<class UGameplayAbility*>                                                                      NonReplicatedInstances;                            // 0x0034 (0x000C)
	TArray<class UGameplayAbility*>                                                                      ReplicatedInstances;                               // 0x0040 (0x000C)
	FActiveGameplayEffectHandle                                                                          GameplayEffectHandle;                              // 0x004C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilitySpecContainer
// 0x0010 (0x0090)
struct FGameplayAbilitySpecContainer : public FFastArraySerializer
{
	TArray<FGameplayAbilitySpec>                                                                         Items;                                             // 0x0080 (0x000C)
	uint8_t                                                                                              UnknownData_8C[0x4];                               // 0x008C (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.AttributeDefaults
// 0x0008 (0x0008)
struct FAttributeDefaults
{
	class UClass*                                                                                        Attributes;                                        // 0x0000 (0x0004)
	class UDataTable*                                                                                    DefaultStartingTable;                              // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayTagRequirements
// 0x0030 (0x0030)
struct FGameplayTagRequirements
{
	FGameplayTagContainer                                                                                RequireTags;                                       // 0x0000 (0x0018)
	FGameplayTagContainer                                                                                IgnoreTags;                                        // 0x0018 (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectContext
// 0x0048 (0x0048)
struct FGameplayEffectContext
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	TWeakObjectPtr<class AActor>                                                                         Instigator;                                        // 0x0004 (0x0008)
	TWeakObjectPtr<class AActor>                                                                         EffectCauser;                                      // 0x000C (0x0008)
	TWeakObjectPtr<class UObject>                                                                        SourceObject;                                      // 0x0014 (0x0008)
	TWeakObjectPtr<class UAbilitySystemComponent>                                                        InstigatorAbilitySystemComponent;                  // 0x001C (0x0008)
	TArray<TWeakObjectPtr<class AActor>>                                                                 Actors;                                            // 0x0024 (0x000C)
	uint8_t                                                                                              UnknownData_30[0x8];                               // 0x0030 (0x0008) MISSED OFFSET
	FVector                                                                                              WorldOrigin;                                       // 0x0038 (0x000C)
	bool                                                                                                 bHasWorldOrigin;                                   // 0x0044 (0x0001)
	uint8_t                                                                                              UnknownData_45[0x3];                               // 0x0045 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.AttributeMetaData
// 0x001B (0x001C)
struct FAttributeMetaData : public FTableRowBase
{
	float                                                                                                BaseValue;                                         // 0x0000 (0x0004)
	float                                                                                                MinValue;                                          // 0x0004 (0x0004)
	float                                                                                                MaxValue;                                          // 0x0008 (0x0004)
	FString                                                                                              DerivedAttributeInfo;                              // 0x000C (0x000C)
	bool                                                                                                 bCanStack;                                         // 0x0018 (0x0001)
	uint8_t                                                                                              UnknownData_19[0x3];                               // 0x0019 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GlobalCurveDataOverride
// 0x000C (0x000C)
struct FGlobalCurveDataOverride
{
	uint8_t                                                                                              UnknownData_0[0xC];                                // 0x0000 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayModifierEvaluatedData
// 0x0014 (0x0014)
struct FGameplayModifierEvaluatedData
{
	FGameplayAttribute                                                                                   Attribute;                                         // 0x0000 (0x0004)
	EGameplayModOp                                                                                       ModifierOp;                                        // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	float                                                                                                Magnitude;                                         // 0x0008 (0x0004)
	FActiveGameplayEffectHandle                                                                          Handle;                                            // 0x000C (0x0004)
	bool                                                                                                 IsValid;                                           // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetData
// 0x0004 (0x0004)
struct FGameplayAbilityTargetData
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetData_SingleTargetHit
// 0x0080 (0x0084)
struct FGameplayAbilityTargetData_SingleTargetHit : public FGameplayAbilityTargetData
{
	FHitResult                                                                                           HitResult;                                         // 0x0004 (0x0080)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetingLocationInfo
// 0x0070 (0x0070)
struct FGameplayAbilityTargetingLocationInfo
{
	uint8_t                                                                                              UnknownData_0[0x10];                               // 0x0000 (0x0010) MISSED OFFSET
	EGameplayAbilityTargetingLocationType                                                                LocationType;                                      // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0xF];                               // 0x0011 (0x000F) MISSED OFFSET
	FTransform                                                                                           LiteralTransform;                                  // 0x0020 (0x0030)
	class AActor*                                                                                        SourceActor;                                       // 0x0050 (0x0004)
	class UMeshComponent*                                                                                SourceComponent;                                   // 0x0054 (0x0004)
	class UGameplayAbility*                                                                              SourceAbility;                                     // 0x0058 (0x0004)
	FName                                                                                                SourceSocketName;                                  // 0x005C (0x0008)
	uint8_t                                                                                              UnknownData_64[0xC];                               // 0x0064 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetData_ActorArray
// 0x008C (0x0090)
struct FGameplayAbilityTargetData_ActorArray : public FGameplayAbilityTargetData
{
	uint8_t                                                                                              UnknownData_4[0xC];                                // 0x0004 (0x000C) MISSED OFFSET
	FGameplayAbilityTargetingLocationInfo                                                                SourceLocation;                                    // 0x0010 (0x0070)
	TArray<TWeakObjectPtr<class AActor>>                                                                 TargetActorArray;                                  // 0x0080 (0x000C)
	uint8_t                                                                                              UnknownData_8C[0x4];                               // 0x008C (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityTargetData_LocationInfo
// 0x00EC (0x00F0)
struct FGameplayAbilityTargetData_LocationInfo : public FGameplayAbilityTargetData
{
	uint8_t                                                                                              UnknownData_4[0xC];                                // 0x0004 (0x000C) MISSED OFFSET
	FGameplayAbilityTargetingLocationInfo                                                                SourceLocation;                                    // 0x0010 (0x0070)
	FGameplayAbilityTargetingLocationInfo                                                                TargetLocation;                                    // 0x0080 (0x0070)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.ActiveGameplayEffectQuery
// 0x0030 (0x0030)
struct FActiveGameplayEffectQuery
{
	uint8_t                                                                                              UnknownData_0[0x30];                               // 0x0000 (0x0030) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectQuery
// 0x00CC (0x00CC)
struct FGameplayEffectQuery
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET
	struct FGameplayAbilities_ActiveGameplayEffectQueryCustomMatch_Dynamic__DelegateSignature            CustomMatchDelegate_BP;                            // 0x0008 (0x0010)
	FGameplayTagQuery                                                                                    OwningTagQuery;                                    // 0x0018 (0x0034)
	FGameplayTagQuery                                                                                    EffectTagQuery;                                    // 0x004C (0x0034)
	FGameplayTagQuery                                                                                    SourceTagQuery;                                    // 0x0080 (0x0034)
	FGameplayAttribute                                                                                   ModifyingAttribute;                                // 0x00B4 (0x0004)
	class UObject*                                                                                       EffectSource;                                      // 0x00B8 (0x0004)
	class UGameplayEffect*                                                                               EffectDefinition;                                  // 0x00BC (0x0004)
	uint8_t                                                                                              UnknownData_C0[0xC];                               // 0x00C0 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.InheritedTagContainer
// 0x0048 (0x0048)
struct FInheritedTagContainer
{
	FGameplayTagContainer                                                                                CombinedTags;                                      // 0x0000 (0x0018)
	FGameplayTagContainer                                                                                Added;                                             // 0x0018 (0x0018)
	FGameplayTagContainer                                                                                Removed;                                           // 0x0030 (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectCue
// 0x0024 (0x0024)
struct FGameplayEffectCue
{
	FGameplayAttribute                                                                                   MagnitudeAttribute;                                // 0x0000 (0x0004)
	float                                                                                                MinLevel;                                          // 0x0004 (0x0004)
	float                                                                                                MaxLevel;                                          // 0x0008 (0x0004)
	FGameplayTagContainer                                                                                GameplayCueTags;                                   // 0x000C (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.AttributeBasedFloat
// 0x0084 (0x0084)
struct FAttributeBasedFloat
{
	FScalableFloat                                                                                       Coefficient;                                       // 0x0000 (0x0014)
	FScalableFloat                                                                                       PreMultiplyAdditiveValue;                          // 0x0014 (0x0014)
	FScalableFloat                                                                                       PostMultiplyAdditiveValue;                         // 0x0028 (0x0014)
	FGameplayEffectAttributeCaptureDefinition                                                            BackingAttribute;                                  // 0x003C (0x0008)
	FCurveTableRowHandle                                                                                 AttributeCurve;                                    // 0x0044 (0x000C)
	EAttributeBasedFloatCalculationType                                                                  AttributeCalculationType;                          // 0x0050 (0x0001)
	uint8_t                                                                                              UnknownData_51[0x3];                               // 0x0051 (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                SourceTagFilter;                                   // 0x0054 (0x0018)
	FGameplayTagContainer                                                                                TargetTagFilter;                                   // 0x006C (0x0018)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.CustomCalculationBasedFloat
// 0x0040 (0x0040)
struct FCustomCalculationBasedFloat
{
	class UClass*                                                                                        CalculationClassMagnitude;                         // 0x0000 (0x0004)
	FScalableFloat                                                                                       Coefficient;                                       // 0x0004 (0x0014)
	FScalableFloat                                                                                       PreMultiplyAdditiveValue;                          // 0x0018 (0x0014)
	FScalableFloat                                                                                       PostMultiplyAdditiveValue;                         // 0x002C (0x0014)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.SetByCallerFloat
// 0x0008 (0x0008)
struct FSetByCallerFloat
{
	FName                                                                                                DataName;                                          // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectModifierMagnitude
// 0x00E4 (0x00E4)
struct FGameplayEffectModifierMagnitude
{
	EGameplayEffectMagnitudeCalculation                                                                  MagnitudeCalculationType;                          // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FScalableFloat                                                                                       ScalableFloatMagnitude;                            // 0x0004 (0x0014)
	FAttributeBasedFloat                                                                                 AttributeBasedMagnitude;                           // 0x0018 (0x0084)
	FCustomCalculationBasedFloat                                                                         CustomMagnitude;                                   // 0x009C (0x0040)
	FSetByCallerFloat                                                                                    SetByCallerMagnitude;                              // 0x00DC (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayModifierInfo
// 0x0160 (0x0160)
struct FGameplayModifierInfo
{
	FGameplayAttribute                                                                                   Attribute;                                         // 0x0000 (0x0004)
	EGameplayModOp                                                                                       ModifierOp;                                        // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	FScalableFloat                                                                                       Magnitude;                                         // 0x0008 (0x0014)
	FGameplayEffectModifierMagnitude                                                                     ModifierMagnitude;                                 // 0x001C (0x00E4)
	FGameplayTagRequirements                                                                             SourceTags;                                        // 0x0100 (0x0030)
	FGameplayTagRequirements                                                                             TargetTags;                                        // 0x0130 (0x0030)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectExecutionScopedModifierInfo
// 0x0150 (0x0150)
struct FGameplayEffectExecutionScopedModifierInfo
{
	FGameplayEffectAttributeCaptureDefinition                                                            CapturedAttribute;                                 // 0x0000 (0x0008)
	EGameplayModOp                                                                                       ModifierOp;                                        // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	FGameplayEffectModifierMagnitude                                                                     ModifierMagnitude;                                 // 0x000C (0x00E4)
	FGameplayTagRequirements                                                                             SourceTags;                                        // 0x00F0 (0x0030)
	FGameplayTagRequirements                                                                             TargetTags;                                        // 0x0120 (0x0030)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayEffectExecutionDefinition
// 0x0034 (0x0034)
struct FGameplayEffectExecutionDefinition
{
	class UClass*                                                                                        CalculationClass;                                  // 0x0000 (0x0004)
	FGameplayTagContainer                                                                                PassedInTags;                                      // 0x0004 (0x0018)
	TArray<FGameplayEffectExecutionScopedModifierInfo>                                                   CalculationModifiers;                              // 0x001C (0x000C)
	TArray<class UClass*>                                                                                ConditionalGameplayEffectClasses;                  // 0x0028 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.AbilityTaskDebugMessage
// 0x0010 (0x0010)
struct FAbilityTaskDebugMessage
{
	class UGameplayTask*                                                                                 FromTask;                                          // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0xC];                                // 0x0004 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilitySpecHandleAndPredictionKey
// 0x0008 (0x0008)
struct FGameplayAbilitySpecHandleAndPredictionKey
{
	FGameplayAbilitySpecHandle                                                                           AbilityHandle;                                     // 0x0000 (0x0004)
	int32_t                                                                                              PredictionKeyAtCreation;                           // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityActorInfo
// 0x0034 (0x0034)
struct FGameplayAbilityActorInfo
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	TWeakObjectPtr<class AActor>                                                                         OwnerActor;                                        // 0x0004 (0x0008)
	TWeakObjectPtr<class AActor>                                                                         AvatarActor;                                       // 0x000C (0x0008)
	TWeakObjectPtr<class APlayerController>                                                              PlayerController;                                  // 0x0014 (0x0008)
	TWeakObjectPtr<class UAbilitySystemComponent>                                                        AbilitySystemComponent;                            // 0x001C (0x0008)
	TWeakObjectPtr<class UAnimInstance>                                                                  AnimInstance;                                      // 0x0024 (0x0008)
	TWeakObjectPtr<class UMovementComponent>                                                             MovementComponent;                                 // 0x002C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayTargetDataFilterHandle
// 0x0008 (0x0008)
struct FGameplayTargetDataFilterHandle
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayTargetDataFilter
// 0x0014 (0x0014)
struct FGameplayTargetDataFilter
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	class AActor*                                                                                        SelfActor;                                         // 0x0004 (0x0004)
	ETargetDataFilterSelf                                                                                SelfFilter;                                        // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	class UClass*                                                                                        RequiredActorClass;                                // 0x000C (0x0004)
	bool                                                                                                 bReverseFilter;                                    // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.AbilityTriggerData
// 0x000C (0x000C)
struct FAbilityTriggerData
{
	FGameplayTag                                                                                         TriggerTag;                                        // 0x0000 (0x0008)
	EGameplayAbilityTriggerSource                                                                        TriggerSource;                                     // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayCueTag
// 0x0008 (0x0008)
struct FGameplayCueTag
{
	FGameplayTag                                                                                         GameplayCueTag;                                    // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayAbilityBindInfo
// 0x0008 (0x0008)
struct FGameplayAbilityBindInfo
{
	EGameplayAbilityInputBinds                                                                           Command;                                           // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	class UClass*                                                                                        GameplayAbilityClass;                              // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.WorldReticleParameters
// 0x000C (0x000C)
struct FWorldReticleParameters
{
	FVector                                                                                              AOEScale;                                          // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.PreallocationInfo
// 0x004C (0x004C)
struct FPreallocationInfo
{
	uint8_t                                                                                              UnknownData_0[0x3C];                               // 0x0000 (0x003C) MISSED OFFSET
	TArray<class AGameplayCueNotify_Actor*>                                                              ClassesNeedingPreallocation;                       // 0x003C (0x000C)
	class UWorld*                                                                                        OwningWorld;                                       // 0x0048 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/GameplayAbilities.GameplayCuePendingExecute
// 0x00F0 (0x00F0)
struct FGameplayCuePendingExecute
{
	FGameplayTag                                                                                         GameplayCueTag;                                    // 0x0000 (0x0008)
	FPredictionKey                                                                                       PredictionKey;                                     // 0x0008 (0x000C)
	EGameplayCuePayloadType                                                                              PayloadType;                                       // 0x0014 (0x0001)
	uint8_t                                                                                              UnknownData_15[0x3];                               // 0x0015 (0x0003) MISSED OFFSET
	class UAbilitySystemComponent*                                                                       OwningComponent;                                   // 0x0018 (0x0004)
	FGameplayEffectSpecForRPC                                                                            FromSpec;                                          // 0x001C (0x0050)
