#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_ReadyForAnything_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_ReadyForAnything
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Traits/Gravitas/GA_Outlander_ReadyForAnything.GA_Outlander_ReadyForAnything_C
// 0x0064 (0x0740)
class UGA_Outlander_ReadyForAnything_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   Event_Data;                                        // 0x06E0 (0x0058)
	class APlayerPawn_Outlander_C*                                                                       Outlander_Pawn;                                    // 0x0738 (0x0004)
	class UClass*                                                                                        GE_ReadyForAnything;                               // 0x073C (0x0004)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Outlander/Traits/Gravitas/GA_Outlander_ReadyForAnything.GA_Outlander_ReadyForAnything_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Outlander_ReadyForAnything(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Traits/Gravitas/GA_Outlander_ReadyForAnything.GA_Outlander_ReadyForAnything_C:ExecuteUbergraph_GA_Outlander_ReadyForAnything
public:
	static class UClass* StaticClass();
};

