#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_BASE_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_BASE
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C
// 0x00D8 (0x07B4)
class UGA_Constructor_BASE_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Constructor_C*                                                                     ConstructorPawn;                                   // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	class UAnimMontage*                                                                                  M_PlaceBase;                                       // 0x0744 (0x0004)
	class USoundBase*                                                                                    CuePlacement;                                      // 0x0748 (0x0004)
	class USoundBase*                                                                                    CueActivation;                                     // 0x074C (0x0004)
	class UClass*                                                                                        GE_FullyContained;                                 // 0x0750 (0x0004)
	FGameplayTagContainer                                                                                TC_FullyContained;                                 // 0x0754 (0x0018)
	class AFortAbilityDecoTool*                                                                          DecoTool;                                          // 0x076C (0x0004)
	FAbilityToolSpawnParameters                                                                          SpawnParameters;                                   // 0x0770 (0x0020)
	FGameplayTagContainer                                                                                TC_CardioFeedbackLoop;                             // 0x0790 (0x0018)
	class UClass*                                                                                        GE_CardioFeedbackLoop;                             // 0x07A8 (0x0004)
	float                                                                                                HealPerSecond;                                     // 0x07AC (0x0004)
	class UClass*                                                                                        GE_GrantDmgReflection;                             // 0x07B0 (0x0004)
public:
	void OnCancelled_448313A941E0C180B5FAED9820171140(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C:OnCancelled_448313A941E0C180B5FAED9820171140
	void OnInterrupted_448313A941E0C180B5FAED9820171140(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C:OnInterrupted_448313A941E0C180B5FAED9820171140
	void OnComplete_448313A941E0C180B5FAED9820171140(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C:OnComplete_448313A941E0C180B5FAED9820171140
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Constructor_BASE(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/BASE/GA_Constructor_BASE.GA_Constructor_BASE_C:ExecuteUbergraph_GA_Constructor_BASE
public:
	static class UClass* StaticClass();
};

