#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_ILoveToReload_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_ILoveToReload
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/Assault/GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C
// 0x0018 (0x0758)
class UGA_Commando_ILoveToReload_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         Event_Activation;                                  // 0x0744 (0x0008)
	class UClass*                                                                                        GE_LovetoReload;                                   // 0x074C (0x0004)
	FGameplayTag                                                                                         Event_Complete;                                    // 0x0750 (0x0008)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/Assault/GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Commando_ILoveToReload(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/Assault/GA_Commando_ILoveToReload.GA_Commando_ILoveToReload_C:ExecuteUbergraph_GA_Commando_ILoveToReload
public:
	static class UClass* StaticClass();
};

