#pragma once
#include "FN_Basic.h"

#include "FN_GA_WhereWeregoingWeNeedRoadsRemove_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_WhereWeregoingWeNeedRoadsRemove
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Traits/Observation/GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C
// 0x0080 (0x075C)
class UGA_WhereWeregoingWeNeedRoadsRemove_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Outlander_C*                                                                       OutlanderPawn;                                     // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x073C (0x0008)
	FGameplayTagContainer                                                                                TC_Roads;                                          // 0x0744 (0x0018)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Outlander/Traits/Observation/GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Traits/Observation/GA_WhereWeregoingWeNeedRoadsRemove.GA_WhereWeregoingWeNeedRoadsRemove_C:ExecuteUbergraph_GA_WhereWeregoingWeNeedRoadsRemove
public:
	static class UClass* StaticClass();
};

