#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_TriggeredFatigue_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_ConstructorTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_TriggeredFatigue
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Packages/GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C
// 0x0030 (0x0770)
class UGA_Constructor_TriggeredFatigue_C : public UGAT_ConstructorTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	bool                                                                                                 NewVar_0;                                          // 0x074C (0x0001)
	uint8_t                                                                                              UnknownData_74D[0x3];                              // 0x074D (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_PlasmaAbility;                                  // 0x0750 (0x0018)
	class UClass*                                                                                        GE_ConstructorFatigue;                             // 0x0768 (0x0004)
	class UClass*                                                                                        GE_ConstructorFatigueInstant;                      // 0x076C (0x0004)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Constructor/Packages/GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Constructor/Packages/GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Constructor_TriggeredFatigue(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Packages/GA_Constructor_TriggeredFatigue.GA_Constructor_TriggeredFatigue_C:ExecuteUbergraph_GA_Constructor_TriggeredFatigue
public:
	static class UClass* StaticClass();
};

