#pragma once
#include "FN_Basic.h"

#include "FN_GA_AirStrike_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_AirStrike
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C
// 0x0184 (0x0860)
class UGA_AirStrike_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class AFortPlayerPawn*                                                                               PlayerPawn;                                        // 0x06E0 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x06E4 (0x0008)
	FGameplayTag                                                                                         EventActivation;                                   // 0x06EC (0x0008)
	FGameplayEventData                                                                                   EventData;                                         // 0x06F4 (0x0058)
	int32_t                                                                                              AbilityMultiplier;                                 // 0x074C (0x0004)
	FVector                                                                                              BombInitLocation;                                  // 0x0750 (0x000C)
	FRotator                                                                                             Prj_Spawn_Direction;                               // 0x075C (0x000C)
	float                                                                                                Bomb_Delay;                                        // 0x0768 (0x0004)
	class UClass*                                                                                        Prj_Bomb;                                          // 0x076C (0x0004)
	FGameplayTag                                                                                         EC_Explode;                                        // 0x0770 (0x0008)
	FFortGameplayEffectContainerSpec                                                                     EC_Explode_Return;                                 // 0x0778 (0x0064)
	float                                                                                                Prj_Gravity;                                       // 0x07DC (0x0004)
	FTransform                                                                                           Bomb_Init_Transform;                               // 0x07E0 (0x0030)
	int32_t                                                                                              ForLoopCounter;                                    // 0x0810 (0x0004)
	TArray<FVector>                                                                                      Current_Unprocessed_Positions_Array;               // 0x0814 (0x000C)
	class AFortAbilityDecoTool*                                                                          DecoTool;                                          // 0x0820 (0x0004)
	float                                                                                                Explosion_Radius;                                  // 0x0824 (0x0004)
	float                                                                                                BombHeightOffset;                                  // 0x0828 (0x0004)
	uint8_t                                                                                              UnknownData_82C[0x4];                              // 0x082C (0x0004) MISSED OFFSET
	FTransform                                                                                           NewVar;                                            // 0x0830 (0x0030)
public:
	FTransform GetCustomAbilitySourceTransform() const; // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:GetCustomAbilitySourceTransform
	void GetAttributeValue(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:GetAttributeValue
	void OnFailed_FD8DF5D249A3F015BFB1F0A559B298F9(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:OnFailed_FD8DF5D249A3F015BFB1F0A559B298F9
	void OnCommitted_FD8DF5D249A3F015BFB1F0A559B298F9(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:OnCommitted_FD8DF5D249A3F015BFB1F0A559B298F9
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_AirStrike(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/AirStrike/GA_AirStrike.GA_AirStrike_C:ExecuteUbergraph_GA_AirStrike
public:
	static class UClass* StaticClass();
};

