#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_DebilitatingShots_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_DebilitatingShots
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C
// 0x00E0 (0x0820)
class UGA_Commando_DebilitatingShots_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         TC_IsGun;                                          // 0x0744 (0x0008)
	FGameplayTag                                                                                         EventActivation;                                   // 0x074C (0x0008)
	class UClass*                                                                                        GE_DebilitatingShots;                              // 0x0754 (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0758 (0x0008)
	FGameplayTag                                                                                         EventDirectTrigger;                                // 0x0760 (0x0008)
	int32_t                                                                                              StackCount;                                        // 0x0768 (0x0004)
	int32_t                                                                                              DefaultStackCount;                                 // 0x076C (0x0004)
	int32_t                                                                                              PerfectEngineeringStack;                           // 0x0770 (0x0004)
	FGameplayAbilityTargetDataHandle                                                                     TargetData;                                        // 0x0774 (0x0014)
	FGameplayTagContainer                                                                                TC_LingeringPain;                                  // 0x0788 (0x0018)
	FGameplayTagContainer                                                                                TC_HackStackBreaker;                               // 0x07A0 (0x0018)
	class UClass*                                                                                        GE_LingeringPain;                                  // 0x07B8 (0x0004)
	FGameplayTagContainer                                                                                TC_Kneecapper;                                     // 0x07BC (0x0018)
	float                                                                                                DebuffValue;                                       // 0x07D4 (0x0004)
	float                                                                                                DefaultValue;                                      // 0x07D8 (0x0004)
	float                                                                                                KneecapperValue;                                   // 0x07DC (0x0004)
	float                                                                                                DebuffDuration;                                    // 0x07E0 (0x0004)
	FGameplayTagContainer                                                                                TC_ApplyFatigue;                                   // 0x07E4 (0x0018)
	class UClass*                                                                                        GE_CommandoFatigueInstant;                         // 0x07FC (0x0004)
	FGameplayTagContainer                                                                                TC_IsAfflicted;                                    // 0x0800 (0x0018)
	class AFortPawn*                                                                                     HitTargetPawn;                                     // 0x0818 (0x0004)
	class UClass*                                                                                        GE_CommandoFatigueDuration;                        // 0x081C (0x0004)
public:
	void SetupFatigue(FGameplayEffectSpecHandle EffectspecOutInstant, FGameplayEffectSpecHandle EffectspecOutDuration); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:SetupFatigue
	void SetupAppliedEffect(float Duration, float Magnitude, int32_t Stack_Count, FGameplayEffectSpecHandle EffectSpecHandle, FGameplayEffectSpecHandle EffectspecHandleOut); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:SetupAppliedEffect
	void SetupGameplayEffect(class AActor* HitActor, FGameplayTag EventTag, class UObject* OptionalObject, FGameplayAbilityTargetDataHandle Target_Data, class UClass* DebilitatingShots, int32_t Effect_Level, int32_t Stack_Count); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:SetupGameplayEffect
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Commando_DebilitatingShots(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C:ExecuteUbergraph_GA_Commando_DebilitatingShots
public:
	static class UClass* StaticClass();
};

