#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_MakeItRain_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_MakeItRain
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_MakeItRain.GA_Commando_MakeItRain_C
// 0x001C (0x075C)
class UGA_Commando_MakeItRain_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x074C (0x0008)
	class UClass*                                                                                        GE_MakeItRain;                                     // 0x0754 (0x0004)
	class UClass*                                                                                        GE_MakeItRainUpgraded;                             // 0x0758 (0x0004)
public:
	void SetupVariables(); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_MakeItRain.GA_Commando_MakeItRain_C:SetupVariables
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_MakeItRain.GA_Commando_MakeItRain_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_MakeItRain.GA_Commando_MakeItRain_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Commando_MakeItRain(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/AdvancedTactics/GA_Commando_MakeItRain.GA_Commando_MakeItRain_C:ExecuteUbergraph_GA_Commando_MakeItRain
public:
	static class UClass* StaticClass();
};

