#pragma once
#include "FN_Basic.h"

#include "FN_GA_Generic_AdrenalineRush_parameters.h"
#include "FN_E_AdrenalineRushAOE_enums.h"
#include "FN_E_AdrenalineRushDuration_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Generic_AdrenalineRush
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C
// 0x0134 (0x0810)
class UGA_Generic_AdrenalineRush_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class AFortPlayerPawn*                                                                               Fort_Player_Pawn;                                  // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivate;                                     // 0x073C (0x0008)
	FFortGameplayAbilityMontageInfo                                                                      Montage_Info;                                      // 0x0744 (0x0044)
	class UClass*                                                                                        AdrenalineRushInsta;                               // 0x0788 (0x0004)
	float                                                                                                HealthPercentInstant;                              // 0x078C (0x0004)
	TArray<class AActor*>                                                                                HitActors;                                         // 0x0790 (0x000C)
	bool                                                                                                 IsAOE;                                             // 0x079C (0x0001)
	bool                                                                                                 IsHOT;                                             // 0x079D (0x0001)
	bool                                                                                                 IsPurge;                                           // 0x079E (0x0001)
	E_AdrenalineRushAOE                                                                                  AOEValue;                                          // 0x079F (0x0001)
	E_AdrenalineRushDuration                                                                             DurationValue;                                     // 0x07A0 (0x0001)
	uint8_t                                                                                              UnknownData_7A1[0x3];                              // 0x07A1 (0x0003) MISSED OFFSET
	FGameplayTag                                                                                         TargetRule;                                        // 0x07A4 (0x0008)
	float                                                                                                HOTDuration;                                       // 0x07AC (0x0004)
	FGameplayTag                                                                                         Target_AOE1;                                       // 0x07B0 (0x0008)
	FGameplayTag                                                                                         Target_AOE2;                                       // 0x07B8 (0x0008)
	FGameplayTag                                                                                         Target_AOE3;                                       // 0x07C0 (0x0008)
	FGameplayAttribute                                                                                   HospitalSubBuilding3;                              // 0x07C8 (0x0004)
	float                                                                                                BasicHOTDuration;                                  // 0x07CC (0x0004)
	float                                                                                                Upgrade1HOTDuration;                               // 0x07D0 (0x0004)
	float                                                                                                Upgrade2HOTDuration;                               // 0x07D4 (0x0004)
	float                                                                                                InstaHealthUpgrade1;                               // 0x07D8 (0x0004)
	float                                                                                                InstaHealthUpgrade2;                               // 0x07DC (0x0004)
	float                                                                                                InstaHealthUpgrade3;                               // 0x07E0 (0x0004)
	class UClass*                                                                                        AdrenalineRushHOT;                                 // 0x07E4 (0x0004)
	FGameplayTagContainer                                                                                TC_GameplayNegative;                               // 0x07E8 (0x0018)
	int32_t                                                                                              Upgrade_Level;                                     // 0x0800 (0x0004)
	class UClass*                                                                                        AdrenalineRushProjectile;                          // 0x0804 (0x0004)
	float                                                                                                InstantHealAmount;                                 // 0x0808 (0x0004)
	float                                                                                                HOTHealAmount;                                     // 0x080C (0x0004)
public:
	void SpawnVisuals(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:SpawnVisuals
	void ApplyGadgetEffects(FGameplayAbilityTargetDataHandle TargetData); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:ApplyGadgetEffects
	void SetupVariable_Upgrades(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:SetupVariable_Upgrades
	void Cancelled_96CD2D2546A5DCD7B7C14BBA26232864(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:Cancelled_96CD2D2546A5DCD7B7C14BBA26232864
	void Targeted_96CD2D2546A5DCD7B7C14BBA26232864(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:Targeted_96CD2D2546A5DCD7B7C14BBA26232864
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Generic_AdrenalineRush(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/AdrenalineRush/GA_Generic_AdrenalineRush.GA_Generic_AdrenalineRush_C:ExecuteUbergraph_GA_Generic_AdrenalineRush
public:
	static class UClass* StaticClass();
};

