#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_Firewall_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_ConstructorTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_Firewall
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Traits/Shielding/GA_Constructor_Firewall.GA_Constructor_Firewall_C
// 0x001C (0x075C)
class UGA_Constructor_Firewall_C : public UGAT_ConstructorTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	class UClass*                                                                                        GE_FirewallDamage;                                 // 0x074C (0x0004)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0750 (0x0008)
	float                                                                                                ReflectedDamage_;                                  // 0x0758 (0x0004)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Constructor/Traits/Shielding/GA_Constructor_Firewall.GA_Constructor_Firewall_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Constructor_Firewall(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Traits/Shielding/GA_Constructor_Firewall.GA_Constructor_Firewall_C:ExecuteUbergraph_GA_Constructor_Firewall
public:
	static class UClass* StaticClass();
};

