#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_PlasmaPulse_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_PlasmaPulse
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C
// 0x0144 (0x0820)
class UGA_Constructor_PlasmaPulse_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	float                                                                                                Overdrive_Duration;                                // 0x06E0 (0x0004)
	float                                                                                                Default_Duration;                                  // 0x06E4 (0x0004)
	float                                                                                                Pulse_Duration;                                    // 0x06E8 (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06EC (0x0058)
	class APlayerPawn_Constructor_C*                                                                     ConstructorPawn;                                   // 0x0744 (0x0004)
	FGameplayTagContainer                                                                                TC_PowerPulse;                                     // 0x0748 (0x0018)
	class UClass*                                                                                        Prj_PlasmaPulse;                                   // 0x0760 (0x0004)
	float                                                                                                PlasmaSpeed;                                       // 0x0764 (0x0004)
	float                                                                                                PlasmaGravity;                                     // 0x0768 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x076C (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0774 (0x0008)
	class USoundBase*                                                                                    MiniPulseCue;                                      // 0x077C (0x0004)
	class UClass*                                                                                        Prj_MiniPulse;                                     // 0x0780 (0x0004)
	FVector                                                                                              Rotation_Direction;                                // 0x0784 (0x000C)
	float                                                                                                MiniPulseSpeed;                                    // 0x0790 (0x0004)
	float                                                                                                MiniPulseGravity;                                  // 0x0794 (0x0004)
	FGameplayTag                                                                                         EC_PlasmaPulse;                                    // 0x0798 (0x0008)
	FGameplayTag                                                                                         EC_MiniPulse;                                      // 0x07A0 (0x0008)
	class UAnimMontage*                                                                                  M_ThrowDown;                                       // 0x07A8 (0x0004)
	float                                                                                                MinSpawnFloat;                                     // 0x07AC (0x0004)
	float                                                                                                MaxSpawnFloat;                                     // 0x07B0 (0x0004)
	float                                                                                                SpeedMultiplier;                                   // 0x07B4 (0x0004)
	float                                                                                                DefaultMinSpawn;                                   // 0x07B8 (0x0004)
	float                                                                                                DefaultMaxSpawn;                                   // 0x07BC (0x0004)
	FGameplayTagContainer                                                                                TC_IFFCoding;                                      // 0x07C0 (0x0018)
	bool                                                                                                 IFFCoding;                                         // 0x07D8 (0x0001)
	uint8_t                                                                                              UnknownData_7D9[0x3];                              // 0x07D9 (0x0003) MISSED OFFSET
	class UClass*                                                                                        GE_IFFCoding;                                      // 0x07DC (0x0004)
	FGameplayTagContainer                                                                                TC_PlasmaOverdrive;                                // 0x07E0 (0x0018)
	float                                                                                                PlasmaOverdriveSpeedMult;                          // 0x07F8 (0x0004)
	FGameplayTagContainer                                                                                TC_BiometricResonence;                             // 0x07FC (0x0018)
	bool                                                                                                 BiometricResonence;                                // 0x0814 (0x0001)
	uint8_t                                                                                              UnknownData_815[0x3];                              // 0x0815 (0x0003) MISSED OFFSET
	class UClass*                                                                                        GE_BiometricResonence;                             // 0x0818 (0x0004)
	float                                                                                                IFFCodePercent;                                    // 0x081C (0x0004)
public:
	void DarkHackyMath(float SetByCallerValue); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:DarkHackyMath
	void SpawnMiniPulses(FVector HitLocation, FFortGameplayEffectContainerSpec EffectContainerSpec, class AActor* ParentPulse); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:SpawnMiniPulses
	void SetupPlasmaPulse(class UAbilitySystemComponent* Ability_System_Component, FVector Spawn_Location, FRotator Spawn_Rotation, FFortGameplayEffectContainerSpec Plasma_Explosion, FFortGameplayEffectContainerSpec Mini_Explosion); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:SetupPlasmaPulse
	void Destroyed_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Destroyed_76104D9B4F6C3F61303653918697EC35
	void Exploded_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Exploded_76104D9B4F6C3F61303653918697EC35
	void Stopped_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Stopped_76104D9B4F6C3F61303653918697EC35
	void Bounced_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Bounced_76104D9B4F6C3F61303653918697EC35
	void Touched_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Touched_76104D9B4F6C3F61303653918697EC35
	void Created_76104D9B4F6C3F61303653918697EC35(FProjectileEventData ProjectileData); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Created_76104D9B4F6C3F61303653918697EC35
	void Completed_6AC3F9A4491B91FDE0457DAC0E8B468B(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Completed_6AC3F9A4491B91FDE0457DAC0E8B468B
	void Cancelled_6AC3F9A4491B91FDE0457DAC0E8B468B(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Cancelled_6AC3F9A4491B91FDE0457DAC0E8B468B
	void Triggered_6AC3F9A4491B91FDE0457DAC0E8B468B(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:Triggered_6AC3F9A4491B91FDE0457DAC0E8B468B
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Constructor_PlasmaPulse(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Gadgets/PlasmaPulse/GA_Constructor_PlasmaPulse.GA_Constructor_PlasmaPulse_C:ExecuteUbergraph_GA_Constructor_PlasmaPulse
public:
	static class UClass* StaticClass();
};

