#pragma once
#include "FN_Basic.h"

#include "FN_GA_Commando_IfItBleeds_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Commando_IfItBleeds
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/Commando/GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C
// 0x0038 (0x0778)
class UGA_Commando_IfItBleeds_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTagContainer                                                                                TC_GoinCommandoActive;                             // 0x0744 (0x0018)
	FGameplayTagContainer                                                                                NewVar_0;                                          // 0x075C (0x0018)
	class UClass*                                                                                        GE_IfItBleedsDamage;                               // 0x0774 (0x0004)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Commando/Traits/Commando/GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/Commando/GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Commando_IfItBleeds(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/Commando/GA_Commando_IfItBleeds.GA_Commando_IfItBleeds_C:ExecuteUbergraph_GA_Commando_IfItBleeds
public:
	static class UClass* StaticClass();
};

