#pragma once
#include "FN_Basic.h"

#include "FN_GA_CommandoFlakVest_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_CommandoTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_CommandoFlakVest
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Commando/Traits/Perserverence/GA_CommandoFlakVest.GA_CommandoFlakVest_C
// 0x004C (0x078C)
class UGA_CommandoFlakVest_C : public UGAT_CommandoTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         Event_Activation;                                  // 0x0744 (0x0008)
	FGameplayTagContainer                                                                                TC_FlakVest;                                       // 0x074C (0x0018)
	class UClass*                                                                                        GE_FlakVest;                                       // 0x0764 (0x0004)
	FGameplayTagContainer                                                                                TC_SpawnEffect;                                    // 0x0768 (0x0018)
	bool                                                                                                 Disabled;                                          // 0x0780 (0x0001)
	uint8_t                                                                                              UnknownData_781[0x3];                              // 0x0781 (0x0003) MISSED OFFSET
	float                                                                                                RearmTime;                                         // 0x0784 (0x0004)
	FTimerHandle                                                                                         ActiveTimer;                                       // 0x0788 (0x0004)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_CommandoFlakVest.GA_CommandoFlakVest_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_CommandoFlakVest.GA_CommandoFlakVest_C:K2_ActivateAbilityFromEvent
	void ReApplyShield(); // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_CommandoFlakVest.GA_CommandoFlakVest_C:ReApplyShield
	void ExecuteUbergraph_GA_CommandoFlakVest(int32_t EntryPoint); // Function /Game/Abilities/Player/Commando/Traits/Perserverence/GA_CommandoFlakVest.GA_CommandoFlakVest_C:ExecuteUbergraph_GA_CommandoFlakVest
public:
	static class UClass* StaticClass();
};

