#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_ToInfinityAndBeyond_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_ToInfinityAndBeyond
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C
// 0x008C (0x0768)
class UGA_Constructor_ToInfinityAndBeyond_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class APlayerPawn_Constructor_C*                                                                     Constructor_Pawn;                                  // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0744 (0x0008)
	float                                                                                                ExplosionDelay;                                    // 0x074C (0x0004)
	FGameplayTagContainer                                                                                TC_InBase;                                         // 0x0750 (0x0018)
public:
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C:K2_ShouldAbilityRespondToEvent
	void Cancelled_35315E614EE08E9B38A0B1BBADAA3319(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C:Cancelled_35315E614EE08E9B38A0B1BBADAA3319
	void Targeted_35315E614EE08E9B38A0B1BBADAA3319(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C:Targeted_35315E614EE08E9B38A0B1BBADAA3319
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_Constructor_ToInfinityAndBeyond(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_ToInfinityAndBeyond.GA_Constructor_ToInfinityAndBeyond_C:ExecuteUbergraph_GA_Constructor_ToInfinityAndBeyond
public:
	static class UClass* StaticClass();
};

