#pragma once
#include "FN_Basic.h"

#include "FN_GAB_AIBaseMelee_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_AIBaseMelee
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C
// 0x000C (0x06E8)
class UGAB_AIBaseMelee_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	bool                                                                                                 Debug;                                             // 0x06E0 (0x0001)
	bool                                                                                                 UseMoveForwardAction;                              // 0x06E1 (0x0001)
	bool                                                                                                 MoveGate;                                          // 0x06E2 (0x0001)
	bool                                                                                                 UseRotationRateModification;                       // 0x06E3 (0x0001)
	float                                                                                                MeleeRotationRate;                                 // 0x06E4 (0x0004)
public:
	void Completed_8CCC8A6B41B7B728038BDE887BD23BCC(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C:Completed_8CCC8A6B41B7B728038BDE887BD23BCC
	void Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C:Cancelled_8CCC8A6B41B7B728038BDE887BD23BCC
	void Triggered_8CCC8A6B41B7B728038BDE887BD23BCC(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C:Triggered_8CCC8A6B41B7B728038BDE887BD23BCC
	void K2_ActivateAbility(); // Function /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C:K2_ActivateAbility
	void ExecuteUbergraph_GAB_AIBaseMelee(int32_t EntryPoint); // Function /Game/Abilities/NPC/Generic/GAB_AIBaseMelee.GAB_AIBaseMelee_C:ExecuteUbergraph_GAB_AIBaseMelee
public:
	static class UClass* StaticClass();
};

