#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_KeenEyes_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_OutlanderTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_StructKeenEyesTargets_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_KeenEyes
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C
// 0x016C (0x08AC)
class UGA_Outlander_KeenEyes_C : public UGAT_OutlanderTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FVector                                                                                              V_SpawnColor;                                      // 0x0744 (0x000C)
	FVector                                                                                              Uncommon_Color;                                    // 0x0750 (0x000C)
	FVector                                                                                              Normal_Color;                                      // 0x075C (0x000C)
	FVector                                                                                              Epic_Color;                                        // 0x0768 (0x000C)
	class UParticleSystem*                                                                               P_LootIcon;                                        // 0x0774 (0x0004)
	FName                                                                                                SpawnColor;                                        // 0x0778 (0x0008)
	FVector                                                                                              RareColor;                                         // 0x0780 (0x000C)
	FGameplayTag                                                                                         EventActivation;                                   // 0x078C (0x0008)
	float                                                                                                KeenEyesTimer;                                     // 0x0794 (0x0004)
	FGameplayTagContainer                                                                                TC_InTheZone;                                      // 0x0798 (0x0018)
	TArray<class AFortPawn*>                                                                             Fort_Pawn_Array;                                   // 0x07B0 (0x000C)
	bool                                                                                                 WithReachOfTreasure_CanPlay_;                      // 0x07BC (0x0001)
	uint8_t                                                                                              UnknownData_7BD[0x3];                              // 0x07BD (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_KeenerEyes;                                     // 0x07C0 (0x0018)
	float                                                                                                DefaultRadius;                                     // 0x07D8 (0x0004)
	float                                                                                                UpgradeRadius;                                     // 0x07DC (0x0004)
	TArray<class ABuildingContainer*>                                                                    BuildingContainer;                                 // 0x07E0 (0x000C)
	TArray<FStructKeenEyesTargets>                                                                       KeenEyesTargets;                                   // 0x07EC (0x000C)
	FHitResult                                                                                           EmptyHitResult;                                    // 0x07F8 (0x0080)
	TArray<class AFortPawn*>                                                                             VisableActors;                                     // 0x0878 (0x000C)
	bool                                                                                                 HasRevealPulse;                                    // 0x0884 (0x0001)
	uint8_t                                                                                              UnknownData_885[0x3];                              // 0x0885 (0x0003) MISSED OFFSET
	FLinearColor                                                                                         Enemy_FX_Color;                                    // 0x0888 (0x0010)
	class UMaterialInstanceDynamic*                                                                      Post_MID;                                          // 0x0898 (0x0004)
	float                                                                                                Current_Radius;                                    // 0x089C (0x0004)
	float                                                                                                ActivationTimestamp;                               // 0x08A0 (0x0004)
	float                                                                                                ActivationDeactivationAnimRate;                    // 0x08A4 (0x0004)
	class USphereComponent*                                                                              Keen_Eyes_Sphere;                                  // 0x08A8 (0x0004)
public:
	void Setup_Post_Fades(bool Activating__T__Or_Deactivating__F_); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:Setup Post Fades
	void Activate_Deactivate_Outline_Post_Process(float Outline_Weight); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:Activate Deactivate Outline Post Process
	void Deactivate_Keen_Eye_Particles_as_Objects_Leave_the_Overlap_Region(class ABuildingContainer* Building_Container, class AFortPawn* Fort_Pawn, bool Fort_Pawn_True_Building_container_False); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:Deactivate Keen Eye Particles as Objects Leave the Overlap Region
	void Set_Or_Remove_Keen_Eyes_Custom_Depth(class AFortPawn* Character_Mesh, bool Render_CustomDepth); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:Set Or Remove Keen Eyes Custom Depth
	void GetNearbyLoot(class AActor* NewIncomingActor); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:GetNearbyLoot
	void PulseKeenEyes(); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:PulseKeenEyes
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:K2_ActivateAbilityFromEvent
	void OverlapTreasure(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:OverlapTreasure
	void EndOverlap(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:EndOverlap
	void K2_OnEndAbility(); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:K2_OnEndAbility
	void TestTurnOffKeenEyes(); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:TestTurnOffKeenEyes
	void ExecuteUbergraph_GA_Outlander_KeenEyes(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_KeenEyes.GA_Outlander_KeenEyes_C:ExecuteUbergraph_GA_Outlander_KeenEyes
public:
	static class UClass* StaticClass();
};

