#pragma once
#include "FN_Basic.h"

#include "FN_GadgetDisplayItem_parameters.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GadgetDisplayItem
*/

// WidgetBlueprintGeneratedClass /Game/UI/HeroSelect/GadgetDisplayItem.GadgetDisplayItem_C
// 0x000C (0x01C4)
class UGadgetDisplayItem_C : public UUserWidget
{
public:
	class UWidgetSwitcher*                                                                               ContentSwitcher;                                   // 0x01B8 (0x0004)
	class UImage*                                                                                        Image_232;                                         // 0x01BC (0x0004)
	class UItem_C*                                                                                       Item;                                              // 0x01C0 (0x0004)
public:
	void SetGadgetItemData(class UFortItem* GadgetItem); // Function /Game/UI/HeroSelect/GadgetDisplayItem.GadgetDisplayItem_C:SetGadgetItemData
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/HeroSelect/GadgetDisplayItem.PLACEHOLDER-CLASS__Item_C_146
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__Item_C_146
{
public:
	static class UClass* StaticClass();
};

