#pragma once
#include "FN_Basic.h"

#include "FN_GA_Constructor_KineticOverload_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_ConstructorTriggeredAbility_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Constructor_KineticOverload
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C
// 0x0130 (0x0870)
class UGA_Constructor_KineticOverload_C : public UGAT_ConstructorTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0744 (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x074C (0x0008)
	class UClass*                                                                                        GE_KineticDamage;                                  // 0x0754 (0x0004)
	FHitResult                                                                                           HitActor;                                          // 0x0758 (0x0080)
	FGameplayTagContainer                                                                                TC_BeatDown;                                       // 0x07D8 (0x0018)
	class UClass*                                                                                        GE_BeatDown;                                       // 0x07F0 (0x0004)
	FGameplayTagContainer                                                                                TC_KineticOverdrive;                               // 0x07F4 (0x0018)
	bool                                                                                                 KineticOverdrive;                                  // 0x080C (0x0001)
	uint8_t                                                                                              UnknownData_80D[0x3];                              // 0x080D (0x0003) MISSED OFFSET
	FVector                                                                                              MainTargetLocation;                                // 0x0810 (0x000C)
	FGameplayAbilityTargetDataHandle                                                                     AOETargets;                                        // 0x081C (0x0014)
	FGameplayTag                                                                                         EC_AoeTarget;                                      // 0x0830 (0x0008)
	FGameplayTagContainer                                                                                TC_NiceAndSlow;                                    // 0x0838 (0x0018)
	class UClass*                                                                                        GE_NiceAndSlowDamage;                              // 0x0850 (0x0004)
	FGameplayTagContainer                                                                                TC_BluntDamage;                                    // 0x0854 (0x0018)
	class AActor*                                                                                        PrimaryTarget;                                     // 0x086C (0x0004)
public:
	FTransform GetCustomAbilitySourceTransform() const; // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:GetCustomAbilitySourceTransform
	void HitTarget(); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:HitTarget
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload) const; // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:K2_ShouldAbilityRespondToEvent
	void Cancelled_AEF31BFB4F9F700D450DB3A243436FC5(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:Cancelled_AEF31BFB4F9F700D450DB3A243436FC5
	void Targeted_AEF31BFB4F9F700D450DB3A243436FC5(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:Targeted_AEF31BFB4F9F700D450DB3A243436FC5
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:K2_ActivateAbilityFromEvent
	void AbilityTimeout(); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:AbilityTimeout
	void ExecuteUbergraph_GA_Constructor_KineticOverload(int32_t EntryPoint); // Function /Game/Abilities/Player/Constructor/Traits/AppliedForce/GA_Constructor_KineticOverload.GA_Constructor_KineticOverload_C:ExecuteUbergraph_GA_Constructor_KineticOverload
public:
	static class UClass* StaticClass();
};

