#pragma once
#include "FN_Basic.h"

#include "FN_GA_Outlander_InTheZoneSwitch_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_GAT_OutlanderTriggeredAbility_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Outlander_InTheZoneSwitch
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZoneSwitch.GA_Outlander_InTheZoneSwitch_C
// 0x0080 (0x07C0)
class UGA_Outlander_InTheZoneSwitch_C : public UGAT_OutlanderTriggeredAbility_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0740 (0x0004)
	FGameplayTagContainer                                                                                TC_ImpactWeapon;                                   // 0x0744 (0x0018)
	FGameplayTagContainer                                                                                TC_InTheZone;                                      // 0x075C (0x0018)
	FGameplayTagContainer                                                                                TC_LaserFocus;                                     // 0x0774 (0x0018)
	class UClass*                                                                                        GE_LaserFocus;                                     // 0x078C (0x0004)
	FGameplayTagContainer                                                                                TC_Melee_Weapon;                                   // 0x0790 (0x0018)
	FGameplayTagContainer                                                                                TC__Ranged_Weapon;                                 // 0x07A8 (0x0018)
public:
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZoneSwitch.GA_Outlander_InTheZoneSwitch_C:K2_ActivateAbilityFromEvent
	void FadeOutPostProcess(); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZoneSwitch.GA_Outlander_InTheZoneSwitch_C:FadeOutPostProcess
	void ExecuteUbergraph_GA_Outlander_InTheZoneSwitch(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Traits/FocusedAcquisition/GA_Outlander_InTheZoneSwitch.GA_Outlander_InTheZoneSwitch_C:ExecuteUbergraph_GA_Outlander_InTheZoneSwitch
public:
	static class UClass* StaticClass();
};

