#pragma once
#include "FN_Basic.h"

#include "FN_GA_ReflectDamage_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_ReflectDamage
*/

// BlueprintGeneratedClass /Game/Abilities/GA_ReflectDamage.GA_ReflectDamage_C
// 0x0020 (0x06FC)
class UGA_ReflectDamage_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayTag                                                                                         ReflectedTag;                                      // 0x06E0 (0x0008)
	class UClass*                                                                                        DamageGE;                                          // 0x06E8 (0x0004)
	class UAbilitySystemComponent*                                                                       OriginalDamageInstigator;                          // 0x06EC (0x0004)
	class UAbilitySystemComponent*                                                                       OriginalDamageTarget;                              // 0x06F0 (0x0004)
	FGameplayTag                                                                                         ReflectionRequestTag;                              // 0x06F4 (0x0008)
public:
	void ReflectDamage(class UAbilitySystemComponent* OriginalDmgCauser, class UAbilitySystemComponent* OriginalDmgReceiver, class UAbilitySystemComponent* ReflectedDmgDealer, float OriginalDmg, FGameplayTagContainer OriginalDmgReceiverTags, FGameplayTagContainer OriginalDmgCauserTags); // Function /Game/Abilities/GA_ReflectDamage.GA_ReflectDamage_C:ReflectDamage
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/GA_ReflectDamage.GA_ReflectDamage_C:K2_ActivateAbilityFromEvent
	void ExecuteUbergraph_GA_ReflectDamage(int32_t EntryPoint); // Function /Game/Abilities/GA_ReflectDamage.GA_ReflectDamage_C:ExecuteUbergraph_GA_ReflectDamage
public:
	static class UClass* StaticClass();
};

