#pragma once
#include "FN_Basic.h"

#include "FN_GA_Generic_Banner_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Generic_Banner
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C
// 0x017C (0x0858)
class UGA_Generic_Banner_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayEventData                                                                                   EventData;                                         // 0x06E0 (0x0058)
	class AFortPlayerPawn*                                                                               FortPlayerPawn;                                    // 0x0738 (0x0004)
	FGameplayTag                                                                                         EventActivation;                                   // 0x073C (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0744 (0x0008)
	FVector                                                                                              BannerLocation;                                    // 0x074C (0x000C)
	FGameplayTag                                                                                         Event_BuildingSelect;                              // 0x0758 (0x0008)
	FFortGameplayAbilityMontageInfo                                                                      Montage;                                           // 0x0760 (0x0044)
	float                                                                                                RepairRadius;                                      // 0x07A4 (0x0004)
	float                                                                                                RepairWaveIncrement;                               // 0x07A8 (0x0004)
	int32_t                                                                                              RepairWaveCounter;                                 // 0x07AC (0x0004)
	TArray<class ABuildingActor*>                                                                        BuildingsToRepair;                                 // 0x07B0 (0x000C)
	FGameplayAttribute                                                                                   EngineeringSchoolSubBuilding3;                     // 0x07BC (0x0004)
	FGameplayTag                                                                                         AOETarget2;                                        // 0x07C0 (0x0008)
	FGameplayTag                                                                                         AOETarget3;                                        // 0x07C8 (0x0008)
	TArray<class AActor*>                                                                                HitActors;                                         // 0x07D0 (0x000C)
	float                                                                                                RepairRadius_Lv1;                                  // 0x07DC (0x0004)
	float                                                                                                RepairRadius_Lv2;                                  // 0x07E0 (0x0004)
	float                                                                                                RepairRadius_Lv3;                                  // 0x07E4 (0x0004)
	float                                                                                                RepairRadius_Lv4;                                  // 0x07E8 (0x0004)
	float                                                                                                RepairRadius_Lv5;                                  // 0x07EC (0x0004)
	bool                                                                                                 Shockwave;                                         // 0x07F0 (0x0001)
	bool                                                                                                 Shockwave_Lv1;                                     // 0x07F1 (0x0001)
	bool                                                                                                 Shockwave_Lv2;                                     // 0x07F2 (0x0001)
	bool                                                                                                 Shockwave_Lv3;                                     // 0x07F3 (0x0001)
	bool                                                                                                 Shockwave_Lv4;                                     // 0x07F4 (0x0001)
	bool                                                                                                 Shockwave_Lv5;                                     // 0x07F5 (0x0001)
	uint8_t                                                                                              UnknownData_7F6[0x2];                              // 0x07F6 (0x0002) MISSED OFFSET
	int32_t                                                                                              BuildingUpgradeTier;                               // 0x07F8 (0x0004)
	int32_t                                                                                              BuildingUpgradeTier_Lv1;                           // 0x07FC (0x0004)
	int32_t                                                                                              BuildingUpgradeTier_Lv2;                           // 0x0800 (0x0004)
	int32_t                                                                                              BuildingUpgradeTier_Lv3;                           // 0x0804 (0x0004)
	int32_t                                                                                              BuildingUpgradeTier_Lv4;                           // 0x0808 (0x0004)
	int32_t                                                                                              BuildingUpgradeTier_Lv5;                           // 0x080C (0x0004)
	float                                                                                                RepairWaveDelay;                                   // 0x0810 (0x0004)
	float                                                                                                RepairWaveDelay_Lv1;                               // 0x0814 (0x0004)
	float                                                                                                RepairWaveDelay_Lv2;                               // 0x0818 (0x0004)
	float                                                                                                RepairWaveDelay_Lv3;                               // 0x081C (0x0004)
	float                                                                                                RepairWaveDelay_Lv4;                               // 0x0820 (0x0004)
	float                                                                                                RepairWaveDelay_Lv5;                               // 0x0824 (0x0004)
	FGameplayTag                                                                                         AOE_ShockWave;                                     // 0x0828 (0x0008)
	FGameplayTag                                                                                         AOE_ShockWave_Lv1;                                 // 0x0830 (0x0008)
	FGameplayTag                                                                                         AOE_ShockWave_Lv2;                                 // 0x0838 (0x0008)
	FGameplayTag                                                                                         AOE_ShockWave_Lv3;                                 // 0x0840 (0x0008)
	FGameplayTag                                                                                         AOE_ShockWave_Lv4;                                 // 0x0848 (0x0008)
	FGameplayTag                                                                                         AOE_ShockWave_Lv5;                                 // 0x0850 (0x0008)
public:
	void SetupLevelVarsInternal(class UAbilitySystemComponent* AbilitySystemComponent); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:SetupLevelVarsInternal
	FTransform GetCustomAbilitySourceTransform() const; // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:GetCustomAbilitySourceTransform
	void Initialize(); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Initialize
	void SetupLevelVars(); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:SetupLevelVars
	void BuildingRepairWave(float RepairWaveRadius); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:BuildingRepairWave
	void Completed_B223ACB541DAF6B70FE5BCB12C3C66E1(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Completed_B223ACB541DAF6B70FE5BCB12C3C66E1
	void Cancelled_B223ACB541DAF6B70FE5BCB12C3C66E1(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Cancelled_B223ACB541DAF6B70FE5BCB12C3C66E1
	void Triggered_B223ACB541DAF6B70FE5BCB12C3C66E1(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Triggered_B223ACB541DAF6B70FE5BCB12C3C66E1
	void Cancelled_3D9DDD20491DEED5A55268A060EC3B66(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Cancelled_3D9DDD20491DEED5A55268A060EC3B66
	void Targeted_3D9DDD20491DEED5A55268A060EC3B66(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:Targeted_3D9DDD20491DEED5A55268A060EC3B66
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:K2_ActivateAbility
	void DoBuildingRepair(); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:DoBuildingRepair
	void ExecuteUbergraph_GA_Generic_Banner(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Banner/GA_Generic_Banner.GA_Generic_Banner_C:ExecuteUbergraph_GA_Generic_Banner
public:
	static class UClass* StaticClass();
};

