#pragma once
#include "FN_Basic.h"

#include "FN_GAB_GenericApplyKnockback_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_GenericApplyKnockback
*/

// BlueprintGeneratedClass /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C
// 0x006C (0x0748)
class UGAB_GenericApplyKnockback_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class UClass*                                                                                        KnockbackTransferEffect;                           // 0x06E0 (0x0004)
	class UClass*                                                                                        KnockbackActiveEffect;                             // 0x06E4 (0x0004)
	float                                                                                                KnockbackPropagationThreshold;                     // 0x06E8 (0x0004)
	class UAnimMontage*                                                                                  KnockbackGetUpMontage;                             // 0x06EC (0x0004)
	class UAnimMontage*                                                                                  KnockbackJumpUpMontage;                            // 0x06F0 (0x0004)
	class UAnimMontage*                                                                                  KnockbackFallDownMontage;                          // 0x06F4 (0x0004)
	bool                                                                                                 DebugDraw;                                         // 0x06F8 (0x0001)
	bool                                                                                                 DebugNumbers;                                      // 0x06F9 (0x0001)
	bool                                                                                                 DebugForceKnockbackValues;                         // 0x06FA (0x0001)
	bool                                                                                                 bOrientToImpulse;                                  // 0x06FB (0x0001)
	FActiveGameplayEffectHandle                                                                          Active_Gameplay_Effect;                            // 0x06FC (0x0004)
	FVector                                                                                              OrientDirection;                                   // 0x0700 (0x000C)
	FName                                                                                                JumpUpMontageSection;                              // 0x070C (0x0008)
	FVector                                                                                              HitDirection;                                      // 0x0714 (0x000C)
	FName                                                                                                FallDownMontageSection;                            // 0x0720 (0x0008)
	FName                                                                                                GetUpMontageSection;                               // 0x0728 (0x0008)
	FVector                                                                                              ImpulseDirectionVelocityOrRotation;                // 0x0730 (0x000C)
	FVector                                                                                              DebugLastLocation;                                 // 0x073C (0x000C)
public:
	void OnCancelled_07DF210D46EDFA929CDBFFB162E8E4CF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnCancelled_07DF210D46EDFA929CDBFFB162E8E4CF
	void OnInterrupted_07DF210D46EDFA929CDBFFB162E8E4CF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnInterrupted_07DF210D46EDFA929CDBFFB162E8E4CF
	void OnComplete_07DF210D46EDFA929CDBFFB162E8E4CF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnComplete_07DF210D46EDFA929CDBFFB162E8E4CF
	void OnCancelled_D744890E4C485F1C80B3E7864AE506FF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnCancelled_D744890E4C485F1C80B3E7864AE506FF
	void OnInterrupted_D744890E4C485F1C80B3E7864AE506FF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnInterrupted_D744890E4C485F1C80B3E7864AE506FF
	void OnComplete_D744890E4C485F1C80B3E7864AE506FF(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnComplete_D744890E4C485F1C80B3E7864AE506FF
	void OnCancelled_1F181048470CEB2EB6CC648039C5913C(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnCancelled_1F181048470CEB2EB6CC648039C5913C
	void OnInterrupted_1F181048470CEB2EB6CC648039C5913C(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnInterrupted_1F181048470CEB2EB6CC648039C5913C
	void OnComplete_1F181048470CEB2EB6CC648039C5913C(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnComplete_1F181048470CEB2EB6CC648039C5913C
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:K2_OnEndAbility
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:K2_ActivateAbilityFromEvent
	void OnReachedJumpApex(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnReachedJumpApex
	void SetupMontageSectionsAndOrientDirection(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:SetupMontageSectionsAndOrientDirection
	void OnPawnLanded_Event(FHitResult Hit); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnPawnLanded_Event
	void OnHitPawn_Event(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:OnHitPawn_Event
	void DebugLine(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:DebugLine
	void ExecuteUbergraph_GAB_GenericApplyKnockback(int32_t EntryPoint); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyKnockback.GAB_GenericApplyKnockback_C:ExecuteUbergraph_GAB_GenericApplyKnockback
public:
	static class UClass* StaticClass();
};

