#pragma once
#include "FN_Basic.h"

#include "FN_GAB_GenericApplyFullBodyHit_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_GenericApplyFullBodyHit
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C
// 0x002C (0x0708)
class UGAB_GenericApplyFullBodyHit_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class UClass*                                                                                        FullBodyHitTransferEffect;                         // 0x06E0 (0x0004)
	class UClass*                                                                                        FullBodyHitActiveEffect;                           // 0x06E4 (0x0004)
	class UAnimMontage*                                                                                  FullBodyHitMontage;                                // 0x06E8 (0x0004)
	FName                                                                                                FullBodyHitMontageSection;                         // 0x06EC (0x0008)
	FVector                                                                                              HitImpulse;                                        // 0x06F4 (0x000C)
	float                                                                                                PushDuration;                                      // 0x0700 (0x0004)
	float                                                                                                PushMagnitude;                                     // 0x0704 (0x0004)
public:
	bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayTagContainer RelevantTags); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:K2_CanActivateAbility
	void OnCancelled_25E5E66442E815EB40A6DB8205FE0D98(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:OnCancelled_25E5E66442E815EB40A6DB8205FE0D98
	void OnInterrupted_25E5E66442E815EB40A6DB8205FE0D98(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:OnInterrupted_25E5E66442E815EB40A6DB8205FE0D98
	void OnComplete_25E5E66442E815EB40A6DB8205FE0D98(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:OnComplete_25E5E66442E815EB40A6DB8205FE0D98
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:K2_OnEndAbility
	void OnHitPawn(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:OnHitPawn
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:K2_ActivateAbilityFromEvent
	void PickFullBodyHitMontageSection(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:PickFullBodyHitMontageSection
	void ApplyPushMomentum(); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:ApplyPushMomentum
	void ExecuteUbergraph_GAB_GenericApplyFullBodyHit(int32_t EntryPoint); // Function /Game/Abilities/NPC/Generic/GAB_GenericApplyFullBodyHit.GAB_GenericApplyFullBodyHit_C:ExecuteUbergraph_GAB_GenericApplyFullBodyHit
public:
	static class UClass* StaticClass();
};

