#pragma once
#include "FN_Basic.h"

#include "FN_GAB_FlingerThrowHusk_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_FlingerThrowHusk
*/

// GameplayAbilityBlueprintGeneratedClass /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C
// 0x001C (0x06F8)
class UGAB_FlingerThrowHusk_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class AFlingerPawn_C*                                                                                FlingerPawn;                                       // 0x06E0 (0x0004)
	class AHuskPawn_C*                                                                                   HuskHeldByFlinger;                                 // 0x06E4 (0x0004)
	FGameplayTag                                                                                         GC_FlingerGrabNPC;                                 // 0x06E8 (0x0008)
	FGameplayTag                                                                                         GC_NPCRangedThrow;                                 // 0x06F0 (0x0008)
public:
	bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayTagContainer RelevantTags) const; // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:K2_CanActivateAbility
	void Completed_B56594C44CE933A96A3E13BDCFC1097D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:Completed_B56594C44CE933A96A3E13BDCFC1097D
	void Cancelled_B56594C44CE933A96A3E13BDCFC1097D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:Cancelled_B56594C44CE933A96A3E13BDCFC1097D
	void Triggered_B56594C44CE933A96A3E13BDCFC1097D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:Triggered_B56594C44CE933A96A3E13BDCFC1097D
	void K2_ActivateAbility(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:K2_ActivateAbility
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:K2_OnEndAbility
	void CommitAndEndAbility(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:CommitAndEndAbility
	void SpawnFX(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:SpawnFX
	void StopFX(); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:StopFX
	void ExecuteUbergraph_GAB_FlingerThrowHusk(int32_t EntryPoint); // Function /Game/Abilities/NPC/Flinger/GAB_FlingerThrowHusk.GAB_FlingerThrowHusk_C:ExecuteUbergraph_GAB_FlingerThrowHusk
public:
	static class UClass* StaticClass();
};

