#pragma once
#include "FN_Basic.h"

#include "FN_GAB_BlasterRanged_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_BlasterRanged
*/

// BlueprintGeneratedClass /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C
// 0x0010 (0x06EC)
class UGAB_BlasterRanged_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	int32_t                                                                                              NumShotsMax;                                       // 0x06E0 (0x0004)
	class ABlasterPawn_C*                                                                                BlasterPawn;                                       // 0x06E4 (0x0004)
	float                                                                                                RotationRateWhenAttacking;                         // 0x06E8 (0x0004)
public:
	bool K2_CanActivateAbility(FGameplayAbilityActorInfo ActorInfo, FGameplayTagContainer RelevantTags) const; // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:K2_CanActivateAbility
	void OnInterrupted_F2E0D80F47E87F169FADB1814583F0E0(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:OnInterrupted_F2E0D80F47E87F169FADB1814583F0E0
	void OnComplete_F2E0D80F47E87F169FADB1814583F0E0(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:OnComplete_F2E0D80F47E87F169FADB1814583F0E0
	void Completed_B70914E34DF839C9F27FBA8D66801C0D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:Completed_B70914E34DF839C9F27FBA8D66801C0D
	void Cancelled_B70914E34DF839C9F27FBA8D66801C0D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:Cancelled_B70914E34DF839C9F27FBA8D66801C0D
	void Triggered_B70914E34DF839C9F27FBA8D66801C0D(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:Triggered_B70914E34DF839C9F27FBA8D66801C0D
	void K2_ActivateAbility(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:K2_ActivateAbility
	void Reset_Ending_Montage_DoOnce(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:Reset Ending Montage DoOnce
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:K2_OnEndAbility
	void StopFiring(); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:StopFiring
	void ExecuteUbergraph_GAB_BlasterRanged(int32_t EntryPoint); // Function /Game/Abilities/NPC/Blaster/GAB_BlasterRanged.GAB_BlasterRanged_C:ExecuteUbergraph_GAB_BlasterRanged
public:
	static class UClass* StaticClass();
};

