#pragma once
#include "FN_Basic.h"

#include "FN_GA_Ninja_Assassination_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GA_Ninja_Assassination
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Ninja/Traits/Shinobi/GA_Ninja_Assassination.GA_Ninja_Assassination_C
// 0x00DC (0x07B8)
class UGA_Ninja_Assassination_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	FGameplayTagContainer                                                                                TC_EdgedWeapons;                                   // 0x06E0 (0x0018)
	FGameplayEventData                                                                                   EventData;                                         // 0x06F8 (0x0058)
	FGameplayTag                                                                                         EventActivation;                                   // 0x0750 (0x0008)
	FGameplayTag                                                                                         EventComplete;                                     // 0x0758 (0x0008)
	class APlayerPawn_Ninja_C*                                                                           NinjaPawn;                                         // 0x0760 (0x0004)
	class UClass*                                                                                        GE_Assassination;                                  // 0x0764 (0x0004)
	class UClass*                                                                                        GE_WindAndStorm;                                   // 0x0768 (0x0004)
	FGameplayTagContainer                                                                                TC_WindAndStorm;                                   // 0x076C (0x0018)
	FGameplayTagContainer                                                                                TC_PainMastery;                                    // 0x0784 (0x0018)
	class UClass*                                                                                        GE_PainMastery;                                    // 0x079C (0x0004)
	FGameplayTagContainer                                                                                TC_NinjaAbility;                                   // 0x07A0 (0x0018)
public:
	void ApplyStack(class APlayerPawn_Ninja_C* NinjaPawn); // Function /Game/Abilities/Player/Ninja/Traits/Shinobi/GA_Ninja_Assassination.GA_Ninja_Assassination_C:ApplyStack
	bool K2_ShouldAbilityRespondToEvent(FGameplayAbilityActorInfo ActorInfo, FGameplayEventData Payload); // Function /Game/Abilities/Player/Ninja/Traits/Shinobi/GA_Ninja_Assassination.GA_Ninja_Assassination_C:K2_ShouldAbilityRespondToEvent
	void K2_ActivateAbility(); // Function /Game/Abilities/Player/Ninja/Traits/Shinobi/GA_Ninja_Assassination.GA_Ninja_Assassination_C:K2_ActivateAbility
	void ExecuteUbergraph_GA_Ninja_Assassination(int32_t EntryPoint); // Function /Game/Abilities/Player/Ninja/Traits/Shinobi/GA_Ninja_Assassination.GA_Ninja_Assassination_C:ExecuteUbergraph_GA_Ninja_Assassination
public:
	static class UClass* StaticClass();
};

