#pragma once
#include "FN_Basic.h"

#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_GameplayTags_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GameplayTags
*/

// Class /Script/GameplayTags.EditableGameplayTagQuery
// 0x0050 (0x006C)
class UEditableGameplayTagQuery : public UObject
{
public:
	FString                                                                                              UserDescription;                                   // 0x001C (0x000C)
	uint8_t                                                                                              UnknownData_28[0xC];                               // 0x0028 (0x000C) MISSED OFFSET
	class UEditableGameplayTagQueryExpression*                                                           RootExpression;                                    // 0x0034 (0x0004)
	FGameplayTagQuery                                                                                    TagQueryExportText_Helper;                         // 0x0038 (0x0034)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression
// 0x0000 (0x001C)
class UEditableGameplayTagQueryExpression : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_AnyTagsMatch
// 0x0018 (0x0034)
class UEditableGameplayTagQueryExpression_AnyTagsMatch : public UEditableGameplayTagQueryExpression
{
public:
	FGameplayTagContainer                                                                                Tags;                                              // 0x001C (0x0018)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_AllTagsMatch
// 0x0018 (0x0034)
class UEditableGameplayTagQueryExpression_AllTagsMatch : public UEditableGameplayTagQueryExpression
{
public:
	FGameplayTagContainer                                                                                Tags;                                              // 0x001C (0x0018)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_NoTagsMatch
// 0x0018 (0x0034)
class UEditableGameplayTagQueryExpression_NoTagsMatch : public UEditableGameplayTagQueryExpression
{
public:
	FGameplayTagContainer                                                                                Tags;                                              // 0x001C (0x0018)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_AnyExprMatch
// 0x000C (0x0028)
class UEditableGameplayTagQueryExpression_AnyExprMatch : public UEditableGameplayTagQueryExpression
{
public:
	TArray<class UEditableGameplayTagQueryExpression*>                                                   Expressions;                                       // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_AllExprMatch
// 0x000C (0x0028)
class UEditableGameplayTagQueryExpression_AllExprMatch : public UEditableGameplayTagQueryExpression
{
public:
	TArray<class UEditableGameplayTagQueryExpression*>                                                   Expressions;                                       // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.EditableGameplayTagQueryExpression_NoExprMatch
// 0x000C (0x0028)
class UEditableGameplayTagQueryExpression_NoExprMatch : public UEditableGameplayTagQueryExpression
{
public:
	TArray<class UEditableGameplayTagQueryExpression*>                                                   Expressions;                                       // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.GameplayTagAssetInterface
// 0x0000 (0x001C)
class UGameplayTagAssetInterface : public UInterface
{
public:
	bool HasMatchingGameplayTag(FGameplayTag TagToCheck) const; // Function /Script/GameplayTags.GameplayTagAssetInterface:HasMatchingGameplayTag
	bool HasAnyMatchingGameplayTags(FGameplayTagContainer TagContainer, bool bCountEmptyAsMatch) const; // Function /Script/GameplayTags.GameplayTagAssetInterface:HasAnyMatchingGameplayTags
	bool HasAllMatchingGameplayTags(FGameplayTagContainer TagContainer, bool bCountEmptyAsMatch) const; // Function /Script/GameplayTags.GameplayTagAssetInterface:HasAllMatchingGameplayTags
	void GetOwnedGameplayTags(FGameplayTagContainer TagContainer) const; // Function /Script/GameplayTags.GameplayTagAssetInterface:GetOwnedGameplayTags
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.BlueprintGameplayTagLibrary
// 0x0000 (0x001C)
class UBlueprintGameplayTagLibrary : public UBlueprintFunctionLibrary
{
public:
	static bool NotEqual_TagTag(FGameplayTag A, FString B); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:NotEqual_TagTag
	static bool NotEqual_TagContainerTagContainer(FGameplayTagContainer A, FString B); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:NotEqual_TagContainerTagContainer
	static FGameplayTag MakeLiteralGameplayTag(FGameplayTag Value); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:MakeLiteralGameplayTag
	static FGameplayTagQuery MakeGameplayTagQuery(FGameplayTagQuery TagQuery); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:MakeGameplayTagQuery
	static bool HasAllMatchingGameplayTags(TScriptInterface<class UGameplayTagAssetInterface> TagContainerInterface, FGameplayTagContainer OtherContainer, bool bCountEmptyAsMatch); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:HasAllMatchingGameplayTags
	static int32_t GetNumGameplayTagsInContainer(FGameplayTagContainer TagContainer); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:GetNumGameplayTagsInContainer
	static FString GetDebugStringFromGameplayTagContainer(FGameplayTagContainer TagContainer); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:GetDebugStringFromGameplayTagContainer
	static bool DoGameplayTagsMatch(FGameplayTag TagOne, FGameplayTag TagTwo, EGameplayTagMatchType TagOneMatchType, EGameplayTagMatchType TagTwoMatchType); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoGameplayTagsMatch
	static bool DoesTagAssetInterfaceHaveTag(TScriptInterface<class UGameplayTagAssetInterface> TagContainerInterface, EGameplayTagMatchType ContainerTagsMatchType, FGameplayTag Tag, EGameplayTagMatchType TagMatchType); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoesTagAssetInterfaceHaveTag
	static bool DoesContainerMatchTagQuery(FGameplayTagContainer TagContainer, FGameplayTagQuery TagQuery); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoesContainerMatchTagQuery
	static bool DoesContainerMatchAnyTagsInContainer(FGameplayTagContainer TagContainer, FGameplayTagContainer OtherContainer, bool bCountEmptyAsMatch); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoesContainerMatchAnyTagsInContainer
	static bool DoesContainerMatchAllTagsInContainer(FGameplayTagContainer TagContainer, FGameplayTagContainer OtherContainer, bool bCountEmptyAsMatch); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoesContainerMatchAllTagsInContainer
	static bool DoesContainerHaveTag(FGameplayTagContainer TagContainer, EGameplayTagMatchType ContainerTagsMatchType, FGameplayTag Tag, EGameplayTagMatchType TagMatchType); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:DoesContainerHaveTag
	static bool AppendGameplayTagContainers(FGameplayTagContainer InTagContainer, FGameplayTagContainer InOutTagContainer); // Function /Script/GameplayTags.BlueprintGameplayTagLibrary:AppendGameplayTagContainers
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.GameplayTagsManager
// 0x00F0 (0x010C)
class UGameplayTagsManager : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x8C];                              // 0x001C (0x008C) MISSED OFFSET
	TArray<class UDataTable*>                                                                            GameplayTagTables;                                 // 0x00A8 (0x000C)
	uint8_t                                                                                              UnknownData_B4[0x58];                              // 0x00B4 (0x0058) MISSED OFFSET
public:
	FGameplayTag RequestGameplayTag(FName TagName, bool ErrorIfNotFound) const; // Function /Script/GameplayTags.GameplayTagsManager:RequestGameplayTag
public:
	static class UClass* StaticClass();
};

// Class /Script/GameplayTags.GameplayTagsSettings
// 0x000C (0x0028)
class UGameplayTagsSettings : public UObject
{
public:
	TArray<FString>                                                                                      GameplayTags;                                      // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

