#pragma once
#include "FN_Basic.h"

#include "FN_GAB_HuskThrownByFlinger_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: GAB_HuskThrownByFlinger
*/

// BlueprintGeneratedClass /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C
// 0x0038 (0x0714)
class UGAB_HuskThrownByFlinger_C : public UFortGameplayAbility
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x06DC (0x0004)
	class AHuskPawn_C*                                                                                   HuskPawn;                                          // 0x06E0 (0x0004)
	class AFortPawn*                                                                                     FlingerPawn;                                       // 0x06E4 (0x0004)
	float                                                                                                ZVelocityWhenShot;                                 // 0x06E8 (0x0004)
	float                                                                                                XYVelocityMaintainedWhenShot;                      // 0x06EC (0x0004)
	FName                                                                                                HuskPawnCapsuleDefaultCollisionProfileName;        // 0x06F0 (0x0008)
	FName                                                                                                HuskPawnCapsuleCollisionProfileNameWhenHeldByFlinger; // 0x06F8 (0x0008)
	FVector                                                                                              FireLocation;                                      // 0x0700 (0x000C)
	FName                                                                                                MontageSectionFlyingLoop;                          // 0x070C (0x0008)
public:
	void Completed_405AED2944EC7B63E07F8CBC114C4467(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Completed_405AED2944EC7B63E07F8CBC114C4467
	void Cancelled_405AED2944EC7B63E07F8CBC114C4467(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Cancelled_405AED2944EC7B63E07F8CBC114C4467
	void Triggered_405AED2944EC7B63E07F8CBC114C4467(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Triggered_405AED2944EC7B63E07F8CBC114C4467
	void Completed_E287620540AA42D086331C807CAC562F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Completed_E287620540AA42D086331C807CAC562F
	void Cancelled_E287620540AA42D086331C807CAC562F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Cancelled_E287620540AA42D086331C807CAC562F
	void Triggered_E287620540AA42D086331C807CAC562F(FGameplayAbilityTargetDataHandle TargetData, FGameplayTag ApplicationTag); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:Triggered_E287620540AA42D086331C807CAC562F
	void K2_ActivateAbilityFromEvent(FGameplayEventData EventData); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:K2_ActivateAbilityFromEvent
	void HuskDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:HuskDamaged
	void K2_OnEndAbility(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:K2_OnEndAbility
	void BindHuskDamaged(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:BindHuskDamaged
	void HuskLanded(FHitResult Hit); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:HuskLanded
	void HuskHit(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, FHitResult Hit); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:HuskHit
	void UnBindHuskDamaged(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:UnBindHuskDamaged
	void BindHuskLanded(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:BindHuskLanded
	void UnBindHuskLanded(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:UnBindHuskLanded
	void RotationCheck(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:RotationCheck
	void HuskFaceForwardON(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:HuskFaceForwardON
	void HuskFaceForwardOFF(); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:HuskFaceForwardOFF
	void ExecuteUbergraph_GAB_HuskThrownByFlinger(int32_t EntryPoint); // Function /Game/Abilities/NPC/Husk/Base/GAB_HuskThrownByFlinger.GAB_HuskThrownByFlinger_C:ExecuteUbergraph_GAB_HuskThrownByFlinger
public:
	static class UClass* StaticClass();
};

