#pragma once
#include "FN_Basic.h"

#include "FN_HeroInfoWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroInfoWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C
// 0x009D (0x02E1)
class UHeroInfoWidget_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UImage*                                                                                        _Image__Background;                                // 0x0248 (0x0004)
	class UImage*                                                                                        _Image__Class_Icon;                                // 0x024C (0x0004)
	class UImage*                                                                                        _Image__Hero_Portrait;                             // 0x0250 (0x0004)
	class UImage*                                                                                        _Image__Top_Bevel;                                 // 0x0254 (0x0004)
	class UProgressBar*                                                                                  _ProgressBar__Hero_XP;                             // 0x0258 (0x0004)
	class UTextBlock*                                                                                    _Text__Hero_Level;                                 // 0x025C (0x0004)
	class UTextBlock*                                                                                    _Text__Hero_Name;                                  // 0x0260 (0x0004)
	class UTextBlock*                                                                                    _Text__XP_Until_Next;                              // 0x0264 (0x0004)
	class UHorizontalBox*                                                                                HorizontalBoxCoreStats;                            // 0x0268 (0x0004)
	class UHorizontalBox*                                                                                HorizontalBoxCoreStats2;                           // 0x026C (0x0004)
	class UImage*                                                                                        ImageBackground2;                                  // 0x0270 (0x0004)
	class UImage*                                                                                        ImageClassIcon2;                                   // 0x0274 (0x0004)
	class UImage*                                                                                        ImageHeroPortrait2;                                // 0x0278 (0x0004)
	class UImage*                                                                                        ImageHR;                                           // 0x027C (0x0004)
	class UImage*                                                                                        ImageHR2;                                          // 0x0280 (0x0004)
	class UImage*                                                                                        ImageTopBevel2;                                    // 0x0284 (0x0004)
	class UOverlay*                                                                                      OverlayLargeFormat;                                // 0x0288 (0x0004)
	class UOverlay*                                                                                      OverlaySmallFormat;                                // 0x028C (0x0004)
	class UProgressBar*                                                                                  ProgressBarHeroXP2;                                // 0x0290 (0x0004)
	class UWidgetSwitcher*                                                                               SwitcherFormats;                                   // 0x0294 (0x0004)
	class UTextBlock*                                                                                    TextHeroLevel2;                                    // 0x0298 (0x0004)
	class UTextBlock*                                                                                    TextHeroName2;                                     // 0x029C (0x0004)
	FHeroUIData                                                                                          HeroData;                                          // 0x02A0 (0x0018)
	struct FUHeroInfoWidget_C_OnHeroSelected__DelegateSignature                                          OnHeroSelected;                                    // 0x02B8 (0x000C)
	bool                                                                                                 Compact_Version;                                   // 0x02C4 (0x0001)
	uint8_t                                                                                              UnknownData_2C5[0x3];                              // 0x02C5 (0x0003) MISSED OFFSET
	FText                                                                                                XPUntilNext;                                       // 0x02C8 (0x000C)
	FString                                                                                              Hero_ID;                                           // 0x02D4 (0x000C)
	bool                                                                                                 IsCurrentHero;                                     // 0x02E0 (0x0001)
public:
	void OnHeroStatsChanged(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:OnHeroStatsChanged
	void Refresh_Hero_ID(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Refresh Hero ID
	void Set_As_Current_Hero(bool IsSelected); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Set As Current Hero
	void On_Player_Data_Updated(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:On Player Data Updated
	class UWidget* Get_XP_Progress_Tooltip(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Get XP Progress Tooltip
	void Refresh_Format(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Refresh Format
	void Bind_Delegates(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Bind Delegates
	void Refresh_Hero_Info(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Refresh Hero Info
	void Refresh_Hero_XP(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Refresh Hero XP
	void Refresh_Hero_Stats(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Refresh Hero Stats
	void Update(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Update
	void Construct(); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:Construct
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:PreConstruct
	void ExecuteUbergraph_HeroInfoWidget(int32_t EntryPoint); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:ExecuteUbergraph_HeroInfoWidget
	void OnHeroSelected__DelegateSignature(FString Hero_ID); // Function /Game/UI/Heroes/HeroInfoWidget.HeroInfoWidget_C:OnHeroSelected__DelegateSignature
public:
	static class UClass* StaticClass();
};

