#pragma once
#include "FN_Basic.h"

#include "FN_HBOnboarding_NameHomebase_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HBOnboarding_NameHomebase
*/

// BlueprintGeneratedClass /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_NameHomebase.HBOnboarding_NameHomebase_C
// 0x0038 (0x0614)
class AHBOnboarding_NameHomebase_C : public AFortTutorialNotification
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x05DC (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_03_Cue;                       // 0x05E0 (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_02_Cue;                       // 0x05E4 (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_01_Cue;                       // 0x05E8 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x05EC (0x0004)
	FText                                                                                                Name_Home_Base_1;                                  // 0x05F0 (0x000C)
	FText                                                                                                Name_Home_Base_2;                                  // 0x05FC (0x000C)
	FText                                                                                                Name_Home_Base_3;                                  // 0x0608 (0x000C)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_NameHomebase.HBOnboarding_NameHomebase_C:UserConstructionScript
	void OnNotificationStart(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_NameHomebase.HBOnboarding_NameHomebase_C:OnNotificationStart
	void ExecuteUbergraph_HBOnboarding_NameHomebase(int32_t EntryPoint); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_NameHomebase.HBOnboarding_NameHomebase_C:ExecuteUbergraph_HBOnboarding_NameHomebase
public:
	static class UClass* StaticClass();
};

