#pragma once
#include "FN_Basic.h"

#include "FN_HuskPawn_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_ElementalEnum_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HuskPawn
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C
// 0x022C (0x107C)
class AHuskPawn_C : public AFortAIPawn
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0E50 (0x0004)
	class UAudioComponent*                                                                               Elemental_Layer_Audio_Loop;                        // 0x0E54 (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Sleep_WakeUP;                               // 0x0E58 (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Sleep;                                      // 0x0E5C (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Stun;                                       // 0x0E60 (0x0004)
	float                                                                                                Timeline_1_ColorFadeOutTrack_6F447E9B4C4E47B267D3DF9D65CF1BF8; // 0x0E64 (0x0004)
	float                                                                                                Timeline_1_FadeInTrack_6F447E9B4C4E47B267D3DF9D65CF1BF8; // 0x0E68 (0x0004)
	ETimelineDirection                                                                                   Timeline_1__Direction_6F447E9B4C4E47B267D3DF9D65CF1BF8; // 0x0E6C (0x0001)
	uint8_t                                                                                              UnknownData_E6D[0x3];                              // 0x0E6D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_1;                                        // 0x0E70 (0x0004)
	float                                                                                                Dissolve_Dissolve_433BF66B4CF1B472082D00AA8D70E5CB; // 0x0E74 (0x0004)
	ETimelineDirection                                                                                   Dissolve__Direction_433BF66B4CF1B472082D00AA8D70E5CB; // 0x0E78 (0x0001)
	uint8_t                                                                                              UnknownData_E79[0x3];                              // 0x0E79 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Dissolve;                                          // 0x0E7C (0x0004)
	class UCurveFloat*                                                                                   HieghtDistributionCurve;                           // 0x0E80 (0x0004)
	float                                                                                                PseudoRandomNetworkedFloat;                        // 0x0E84 (0x0004)
	TArray<FLinearColor>                                                                                 MaleHuskHairColors;                                // 0x0E88 (0x000C)
	TArray<FLinearColor>                                                                                 MaleHuskSkinColors;                                // 0x0E94 (0x000C)
	TArray<FLinearColor>                                                                                 MaleHuskPantColors;                                // 0x0EA0 (0x000C)
	FRandomStream                                                                                        RandomStream_0;                                    // 0x0EAC (0x0008)
	TArray<FLinearColor>                                                                                 MaleHuskShirtColors;                               // 0x0EB4 (0x000C)
	int32_t                                                                                              HitCount;                                          // 0x0EC0 (0x0004)
	float                                                                                                LastTakeHitTime;                                   // 0x0EC4 (0x0004)
	bool                                                                                                 PushFromFlingerSpawn;                              // 0x0EC8 (0x0001)
	bool                                                                                                 UsePOCScaleAndMaterials;                           // 0x0EC9 (0x0001)
	bool                                                                                                 POCShouldOverrideMaterial;                         // 0x0ECA (0x0001)
	bool                                                                                                 POCShouldOverrideMaterialValues;                   // 0x0ECB (0x0001)
	class UMaterialInterface*                                                                            POCOverrideMaterial;                               // 0x0ECC (0x0004)
	FLinearColor                                                                                         POCMaterialSkinColor;                              // 0x0ED0 (0x0010)
	FLinearColor                                                                                         POCMaterialHairColor;                              // 0x0EE0 (0x0010)
	FLinearColor                                                                                         POCMaterialPantColor;                              // 0x0EF0 (0x0010)
	FLinearColor                                                                                         POCMaterialShirtColor;                             // 0x0F00 (0x0010)
	bool                                                                                                 Mantling;                                          // 0x0F10 (0x0001)
	uint8_t                                                                                              UnknownData_F11[0x3];                              // 0x0F11 (0x0003) MISSED OFFSET
	class AFortPawn*                                                                                     FlingerThatSpawnedMe;                              // 0x0F14 (0x0004)
	FVector                                                                                              FlingerThatSpawnedMeLocation;                      // 0x0F18 (0x000C)
	bool                                                                                                 Stunned;                                           // 0x0F24 (0x0001)
	bool                                                                                                 Sleeping;                                          // 0x0F25 (0x0001)
	uint8_t                                                                                              UnknownData_F26[0x2];                              // 0x0F26 (0x0002) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_HitReactionAdditiveSingleOneShot;               // 0x0F28 (0x0018)
	FGameplayTagContainer                                                                                TC_HitReactionAdditiveLoop;                        // 0x0F40 (0x0018)
	FGameplayTagContainer                                                                                TC_HitReactionFullBody;                            // 0x0F58 (0x0018)
	FGameplayTagContainer                                                                                TC_HitReactionBlockAll;                            // 0x0F70 (0x0018)
	FGameplayTagContainer                                                                                TC_HitReactionBlockMelee;                          // 0x0F88 (0x0018)
	FGameplayTagContainer                                                                                TC_HitReactionBlockRanged;                         // 0x0FA0 (0x0018)
	bool                                                                                                 HitReactForMelee;                                  // 0x0FB8 (0x0001)
	bool                                                                                                 UseRandomColorVariation;                           // 0x0FB9 (0x0001)
	bool                                                                                                 HuskIsInFlingersHand;                              // 0x0FBA (0x0001)
	bool                                                                                                 HuskIsAirborne;                                    // 0x0FBB (0x0001)
	FVector                                                                                              HuskFlingerHandOffset;                             // 0x0FBC (0x000C)
	FRotator                                                                                             HuskFlingerHandRotation;                           // 0x0FC8 (0x000C)
	FVector                                                                                              HuskFlingerProjectileOffset;                       // 0x0FD4 (0x000C)
	FRotator                                                                                             HuskFlingerProjectileRotation;                     // 0x0FE0 (0x000C)
	ElementalEnum                                                                                        ElementalType;                                     // 0x0FEC (0x0001)
	uint8_t                                                                                              UnknownData_FED[0x3];                              // 0x0FED (0x0003) MISSED OFFSET
	class UMaterialInterface*                                                                            Default_Material;                                  // 0x0FF0 (0x0004)
	class UMaterialInterface*                                                                            Fire_Material;                                     // 0x0FF4 (0x0004)
	class UMaterialInterface*                                                                            Ice_Material;                                      // 0x0FF8 (0x0004)
	class UMaterialInterface*                                                                            Electrical_Mat;                                    // 0x0FFC (0x0004)
	class UParticleSystem*                                                                               Particle_Fire_Ambient;                             // 0x1000 (0x0004)
	class UParticleSystem*                                                                               Particle_Ice_Ambient;                              // 0x1004 (0x0004)
	class UParticleSystem*                                                                               Particle_Electrical_Ambient;                       // 0x1008 (0x0004)
	bool                                                                                                 Temp_Disable_Elemental_Effects;                    // 0x100C (0x0001)
	uint8_t                                                                                              UnknownData_100D[0x3];                             // 0x100D (0x0003) MISSED OFFSET
	FGameplayTagContainer                                                                                TC_MeleeWeapon;                                    // 0x1010 (0x0018)
	bool                                                                                                 IsMeleeHit;                                        // 0x1028 (0x0001)
	uint8_t                                                                                              UnknownData_1029[0x3];                             // 0x1029 (0x0003) MISSED OFFSET
	class USoundBase*                                                                                    Elemental_Audio_Layer_Sound;                       // 0x102C (0x0004)
	bool                                                                                                 RandomizeMeshScale;                                // 0x1030 (0x0001)
	uint8_t                                                                                              UnknownData_1031[0x3];                             // 0x1031 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               ImpactParticles_Default;                           // 0x1034 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_HumanFlesh;                        // 0x1038 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Wood;                              // 0x103C (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Stone;                             // 0x1040 (0x0004)
	class UParticleSystem*                                                                               ImpactParticles_Metal;                             // 0x1044 (0x0004)
	bool                                                                                                 MeleeImpact_UseSocketTransforms;                   // 0x1048 (0x0001)
	uint8_t                                                                                              UnknownData_1049[0x3];                             // 0x1049 (0x0003) MISSED OFFSET
	FName                                                                                                Impact_MeleeSocket;                                // 0x104C (0x0008)
	FRotator                                                                                             HuskDefaultRotationRate;                           // 0x1054 (0x000C)
	bool                                                                                                 IsHeadshot_HideHead;                               // 0x1060 (0x0001)
	uint8_t                                                                                              UnknownData_1061[0x3];                             // 0x1061 (0x0003) MISSED OFFSET
	FGameplayTag                                                                                         Damage_Red_Laser;                                  // 0x1064 (0x0008)
	float                                                                                                PreviousLargestDeathRadius;                        // 0x106C (0x0004)
	class UParticleSystemComponent*                                                                      Death_Effects;                                     // 0x1070 (0x0004)
	class USoundBase*                                                                                    Death_Normal_Sound;                                // 0x1074 (0x0004)
	class USoundBase*                                                                                    Death_RedLaser_Sound;                              // 0x1078 (0x0004)
public:
	void SetHuskRotationRate(float YawRate); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:SetHuskRotationRate
	void ResetHuskRotationRateToDefault(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:ResetHuskRotationRateToDefault
	void PlayAdditiveHitReacts(FVector HitDirection); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PlayAdditiveHitReacts
	void PickColorFromAnArrayOfColors(TArray<FLinearColor> ArrayOfColors, FLinearColor Color); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PickColorFromAnArrayOfColors
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:UserConstructionScript
	void Dissolve__FinishedFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:Dissolve__FinishedFunc
	void Dissolve__UpdateFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:Dissolve__UpdateFunc
	void Timeline_1__FinishedFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:Timeline_1__FinishedFunc
	void Timeline_1__UpdateFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:Timeline_1__UpdateFunc
	void Timeline_1__Spawn__EventFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:Timeline_1__Spawn__EventFunc
	void FlingerSpawnedAnEnemy(class AFortAIPawn* EnemySpawned, class AFortProjectileBase* ProjectileThatSpawnedThisEnemy); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerSpawnedAnEnemy
	void CanFlingerSpawnAnEnemy(class AActor* ActorWhoAsked); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:CanFlingerSpawnAnEnemy
	void FlingerCanSpawnAnEnemy(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerCanSpawnAnEnemy
	void FlingerCan_tSpawnAnEnemy(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerCan'tSpawnAnEnemy
	void FlingerThrewAProjectileContainingAnEnemy(class AFortProjectileBase* Projectile); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerThrewAProjectileContainingAnEnemy
	void FlingerEnemyFailedToSpawn(class AFortProjectileBase* FailedProjectile); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerEnemyFailedToSpawn
	void AlertEnemySpawnedByFlinger(FVector PushMomentum, float PushDuration, class APawn* OwningFlinger); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:AlertEnemySpawnedByFlinger
	void FlingerEnemyDied(class APawn* PawnThatDied); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:FlingerEnemyDied
	void HuskEvadeStart(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:HuskEvadeStart
	void VerifyTakerAttack(bool SpecialAttack, bool Swoop, bool Soul_Suck, bool Portal); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:VerifyTakerAttack
	void ResetTakerSpecialAttackTimer(bool Swoop, bool SoulSuckMelee, bool Portal); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:ResetTakerSpecialAttackTimer
	void BeginTakerSwoopAttack(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:BeginTakerSwoopAttack
	void EndTakerSwoopAttack(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:EndTakerSwoopAttack
	void TakerWallPortalBehavior(class AActor* BuildingPart, class UBTTask_BlueprintBase* Task, FVector DesiredMoveLocation, bool Debug); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:TakerWallPortalBehavior
	void IsTakerWallPortalAvailable(bool Portal_Available_); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:IsTakerWallPortalAvailable
	void TakerAttackFSM(bool SuccessfulHit); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:TakerAttackFSM
	void TakerSoulSuckSoundBegin(bool Success); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:TakerSoulSuckSoundBegin
	void TakerSoulSuckSoundEnd(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:TakerSoulSuckSoundEnd
	void PortalAdd(class ABuildingActor* BuildingActor, TArray<class ABuildingActor*> BuildingActorList); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PortalAdd
	void PortalClear(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PortalClear
	void TakerSoulSuckInterrupted(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:TakerSoulSuckInterrupted
	void PortalGet(class ABuildingActor* BuildingActor, TArray<class ABuildingActor*> BuildingActorList, class AActor* BT); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PortalGet
	void PortalFX(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PortalFX
	void PortalCollision(bool Collide_); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PortalCollision
	void OnStunnedEffectBegin(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnStunnedEffectBegin
	void OnStunnedEffectEnd(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnStunnedEffectEnd
	void PawnUniqueIDSet(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PawnUniqueIDSet
	void OnBeginSleepEffects(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnBeginSleepEffects
	void OnEndSleepEffects(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnEndSleepEffects
	void OnLanded(FHitResult Hit); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnLanded
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnDeathPlayEffects
	void MantleStart(FVector StartPos, FVector MidPos, FVector EndPos, bool LowWall, bool MidWall, bool FullWall, bool WindowWall); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:MantleStart
	void MantleEnd(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:MantleEnd
	void PlayHuskAdditiveHitReacts(FVector HitDirection); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:PlayHuskAdditiveHitReacts
	void AdditiveHitReactDelay(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:AdditiveHitReactDelay
	void ReceiveTick(float DeltaSeconds); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:ReceiveTick
	void OnSpawnedFromRift(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnSpawnedFromRift
	void OnForceSpawnEffectCompletion(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnForceSpawnEffectCompletion
	void ReceiveBeginPlay(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:ReceiveBeginPlay
	void OnDamagePlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:OnDamagePlayEffects
	void GameplayCue_Impact_Physical_Creature(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:GameplayCue.Impact.Physical.Creature
	void ExecuteUbergraph_HuskPawn(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn.HuskPawn_C:ExecuteUbergraph_HuskPawn
public:
	static class UClass* StaticClass();
};

