#pragma once
#include "FN_Basic.h"

#include "FN_HBOnboarding_PlaySatelliteCine_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HBOnboarding_PlaySatelliteCine
*/

// BlueprintGeneratedClass /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C
// 0x0010 (0x05EC)
class AHBOnboarding_PlaySatelliteCine_C : public AFortTutorialNotification
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x05DC (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x05E0 (0x0004)
	bool                                                                                                 AllowSkip;                                         // 0x05E4 (0x0001)
	uint8_t                                                                                              UnknownData_5E5[0x3];                              // 0x05E5 (0x0003) MISSED OFFSET
	class AMatineeActor*                                                                                 CurrentMatineeActor;                               // 0x05E8 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:UserConstructionScript
	void OnNotificationStart(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:OnNotificationStart
	void OnCinematicStop(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:OnCinematicStop
	void canskip(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:canskip
	void OnPlayerSkippedCutscene_Copy(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:OnPlayerSkippedCutscene_Copy
	void ExecuteUbergraph_HBOnboarding_PlaySatelliteCine(int32_t EntryPoint); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_PlaySatelliteCine.HBOnboarding_PlaySatelliteCine_C:ExecuteUbergraph_HBOnboarding_PlaySatelliteCine
public:
	static class UClass* StaticClass();
};

