#pragma once
#include "FN_Basic.h"

#include "FN_HBOnboarding_BuildHeroBuilding_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HBOnboarding_BuildHeroBuilding
*/

// BlueprintGeneratedClass /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C
// 0x0040 (0x061C)
class AHBOnboarding_BuildHeroBuilding_C : public AFortTutorialNotification
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x05DC (0x0004)
	class UAudioComponent*                                                                               onboarding_pulse_Cue;                              // 0x05E0 (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_OutpostNew_420_Cue;                        // 0x05E4 (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_05_Cue;                       // 0x05E8 (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_06_Cue;                       // 0x05EC (0x0004)
	class UAudioComponent*                                                                               Ray_ONB_HomeBaseFlow_04_Cue;                       // 0x05F0 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x05F4 (0x0004)
	bool                                                                                                 WaitingForBuilding;                                // 0x05F8 (0x0001)
	uint8_t                                                                                              UnknownData_5F9[0x3];                              // 0x05F9 (0x0003) MISSED OFFSET
	class UMyTownBuildingDefinitionData*                                                                 SoldierBuilding;                                   // 0x05FC (0x0004)
	class UMyTownBuildingDefinitionData*                                                                 ConstructorBuilding;                               // 0x0600 (0x0004)
	FText                                                                                                Recruit;                                           // 0x0604 (0x000C)
	FText                                                                                                Home_Base_Intro;                                   // 0x0610 (0x000C)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:UserConstructionScript
	void OnNotificationStart(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:OnNotificationStart
	void HandleClientEvent_OnboardingBuildingsStage2(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:HandleClientEvent_OnboardingBuildingsStage2
	void HandleClientEvent_BuildingSelected(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:HandleClientEvent_BuildingSelected
	void HandleClientEvent_HomebaseBuiltBuilding(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:HandleClientEvent_HomebaseBuiltBuilding
	void finished(); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:finished
	void ExecuteUbergraph_HBOnboarding_BuildHeroBuilding(int32_t EntryPoint); // Function /Game/FrontEnd/HomebaseOnboarding/Notifications/HBOnboarding_BuildHeroBuilding.HBOnboarding_BuildHeroBuilding_C:ExecuteUbergraph_HBOnboarding_BuildHeroBuilding
public:
	static class UClass* StaticClass();
};

