#pragma once
#include "FN_Basic.h"

#include "FN_HeroListWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroListWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/HeroListWidget.HeroListWidget_C
// 0x001C (0x01D4)
class UHeroListWidget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UVerticalBox*                                                                                  _VerticalBox__Hero_List;                           // 0x01BC (0x0004)
	TArray<class UHeroListItemWidget_C*>                                                                 Hero_Item_Widgets;                                 // 0x01C0 (0x000C)
	FName                                                                                                TabGroupName;                                      // 0x01CC (0x0008)
public:
	void On_Hero_Deleted(bool Success); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:On Hero Deleted
	void On_Hero_Created(bool Success); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:On Hero Created
	void Set_Tab_Group_Name(); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:Set Tab Group Name
	void Refresh_Hero_List(); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:Refresh Hero List
	void Update_Hero_List(); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:Update Hero List
	void On_Hero_Selected(class UFortBaseButton* Hero_List_Item, bool SELECTED); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:On Hero Selected
	void Construct(); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:Construct
	void ExecuteUbergraph_HeroListWidget(int32_t EntryPoint); // Function /Game/UI/Heroes/HeroListWidget.HeroListWidget_C:ExecuteUbergraph_HeroListWidget
public:
	static class UClass* StaticClass();
};

