#pragma once
#include "FN_Basic.h"

#include "FN_HeroCoreStat_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroCoreStatSet
*/

// UserDefinedStruct /Game/UI/Heroes/HeroCoreStatSet.HeroCoreStatSet
// 0x0B50 (0x0B50)
struct FHeroCoreStatSet
{
	FHeroCoreStat                                                                                        Fortitude_2_6DC8DA604803B3EBE0730BB910032092;      // 0x0000 (0x02D4)
	FHeroCoreStat                                                                                        Offense_4_5F4A34004DF42945CDCCC6A9C1CD67C3;        // 0x02D4 (0x02D4)
	FHeroCoreStat                                                                                        Resistance_6_04BA1DFB40BECD0BCDC2CBA064259BAC;     // 0x05A8 (0x02D4)
	FHeroCoreStat                                                                                        Tech_8_263FE469452581C9B254DB981D3D845B;           // 0x087C (0x02D4)

	static class UScriptStruct* StaticStruct();
};

