#pragma once
#include "FN_Basic.h"

#include "FN_HB_RoadSpline_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_Path_structs.h"
#include "FN_RoadConnections_enums.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HB_RoadSpline
*/

// BlueprintGeneratedClass /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C
// 0x00D4 (0x0314)
class AHB_RoadSpline_C : public AActor
{
public:
	class USplineMeshComponent*                                                                          SplineMesh1;                                       // 0x0240 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh1;                                       // 0x0244 (0x0004)
	class UBillboardComponent*                                                                           Billboard1;                                        // 0x0248 (0x0004)
	bool                                                                                                 IsAnchorPoint;                                     // 0x024C (0x0001)
	uint8_t                                                                                              UnknownData_24D[0x3];                              // 0x024D (0x0003) MISSED OFFSET
	class UStaticMesh*                                                                                   Mesh;                                              // 0x0250 (0x0004)
	class AHB_RoadSpline_C*                                                                              StartRoadConnection;                               // 0x0254 (0x0004)
	class AHB_RoadSpline_C*                                                                              EndRoadConnection;                                 // 0x0258 (0x0004)
	FVector                                                                                              Start;                                             // 0x025C (0x000C)
	FVector                                                                                              StartTangent;                                      // 0x0268 (0x000C)
	FVector                                                                                              End;                                               // 0x0274 (0x000C)
	FVector                                                                                              EndTangent;                                        // 0x0280 (0x000C)
	RoadConnections                                                                                      StartConnectionSocket;                             // 0x028C (0x0001)
	RoadConnections                                                                                      EndConnectionSocket;                               // 0x028D (0x0001)
	uint8_t                                                                                              UnknownData_28E[0x2];                              // 0x028E (0x0002) MISSED OFFSET
	float                                                                                                Tension;                                           // 0x0290 (0x0004)
	class AActor*                                                                                        StartRoadActor;                                    // 0x0294 (0x0004)
	class AActor*                                                                                        EndRoadActor;                                      // 0x0298 (0x0004)
	class AActor*                                                                                        DependingActorStart;                               // 0x029C (0x0004)
	class AActor*                                                                                        DependentActorEnd;                                 // 0x02A0 (0x0004)
	class AActor*                                                                                        DependentActorLeft;                                // 0x02A4 (0x0004)
	class AActor*                                                                                        DependentActorRight;                               // 0x02A8 (0x0004)
	float                                                                                                StartScale;                                        // 0x02AC (0x0004)
	float                                                                                                EndScale;                                          // 0x02B0 (0x0004)
	float                                                                                                ActorScale;                                        // 0x02B4 (0x0004)
	float                                                                                                BlendAsphalt;                                      // 0x02B8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Material;                                          // 0x02BC (0x0004)
	bool                                                                                                 IsBuildingFoundation;                              // 0x02C0 (0x0001)
	uint8_t                                                                                              UnknownData_2C1[0x3];                              // 0x02C1 (0x0003) MISSED OFFSET
	TArray<class AActor*>                                                                                DependentActors;                                   // 0x02C4 (0x000C)
	TArray<RoadConnections>                                                                              DepentendActorsSockets;                            // 0x02D0 (0x000C)
	TArray<class AActor*>                                                                                UpgradeBuildings;                                  // 0x02DC (0x000C)
	TArray<FPath>                                                                                        UpgradePaths;                                      // 0x02E8 (0x000C)
	TArray<float>                                                                                        UpgradePathProgression;                            // 0x02F4 (0x000C)
	bool                                                                                                 NewVar;                                            // 0x0300 (0x0001)
	uint8_t                                                                                              UnknownData_301[0x3];                              // 0x0301 (0x0003) MISSED OFFSET
	float                                                                                                StarttoEnd;                                        // 0x0304 (0x0004)
	float                                                                                                StreetBlendEndtoStart;                             // 0x0308 (0x0004)
	float                                                                                                StreetBlendLefttoRight;                            // 0x030C (0x0004)
	float                                                                                                NewVar0;                                           // 0x0310 (0x0004)
public:
	void AddPath(RoadPathConnections Connection, float GravelValue, float StreetValue); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:AddPath
	void SetPath(RoadPathConnections Connection, float Value); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:SetPath
	void UpgradePath(class AActor* UpgradeBuilding); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:UpgradePath
	void ClearDependentActors(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:ClearDependentActors
	void Set_Dependent_ActorsforSpline(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:Set Dependent ActorsforSpline
	void Make_Dynamic_Material(class UMeshComponent* Mesh); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:Make Dynamic Material
	void UpdateDependentActors(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:UpdateDependentActors
	void SetDependentActor(class AActor* Actor, RoadConnections RoadConnection); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:SetDependentActor
	void UpdateSplineRoadConectionEnd(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:UpdateSplineRoadConectionEnd
	void UpdateSpline_Road_Connection_Start(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:UpdateSpline Road Connection Start
	void SetSplineVaribles(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:SetSplineVaribles
	void UserConstructionScript(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadSpline.HB_RoadSpline_C:UserConstructionScript
public:
	static class UClass* StaticClass();
};

