#pragma once
#include "FN_Basic.h"

#include "FN_HomeBaseCamera_Blueprint_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HomeBaseCamera_Blueprint
*/

// BlueprintGeneratedClass /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C
// 0x0066 (0x066E)
class AHomeBaseCamera_Blueprint_C : public AFortHomeBaseCamera
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	float                                                                                                ZoomInTimeline_FloatCurve_5A99B70D8F48CC5A3D3C728E9EC54B4E; // 0x060C (0x0004)
	ETimelineDirection                                                                                   ZoomInTimeline__Direction_5A99B70D8F48CC5A3D3C728E9EC54B4E; // 0x0610 (0x0001)
	uint8_t                                                                                              UnknownData_611[0x3];                              // 0x0611 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            ZoomInTimeline;                                    // 0x0614 (0x0004)
	float                                                                                                ZoomOutTimeline_FloatCurve_F8D27584BD4A57F03BE072B7A9D31232; // 0x0618 (0x0004)
	ETimelineDirection                                                                                   ZoomOutTimeline__Direction_F8D27584BD4A57F03BE072B7A9D31232; // 0x061C (0x0001)
	uint8_t                                                                                              UnknownData_61D[0x3];                              // 0x061D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            ZoomOutTimeline;                                   // 0x0620 (0x0004)
	float                                                                                                ZoomLevel;                                         // 0x0624 (0x0004)
	bool                                                                                                 MouseDown;                                         // 0x0628 (0x0001)
	uint8_t                                                                                              UnknownData_629[0x3];                              // 0x0629 (0x0003) MISSED OFFSET
	float                                                                                                LerpPos;                                           // 0x062C (0x0004)
	FVector                                                                                              PreviousLocation;                                  // 0x0630 (0x000C)
	FRotator                                                                                             PreviousRotation;                                  // 0x063C (0x000C)
	float                                                                                                PreviousFOV;                                       // 0x0648 (0x0004)
	FVector                                                                                              LerpFromLocation;                                  // 0x064C (0x000C)
	FRotator                                                                                             LerpFromRotation;                                  // 0x0658 (0x000C)
	float                                                                                                LerpFromFOV;                                       // 0x0664 (0x0004)
	class APostProcessVolume*                                                                            Volume;                                            // 0x0668 (0x0004)
	bool                                                                                                 LoggedIn;                                          // 0x066C (0x0001)
	bool                                                                                                 IsFocused;                                         // 0x066D (0x0001)
public:
	void IsBusy(bool IsBusy); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:IsBusy
	void StorePrevious(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:StorePrevious
	void StoreLerpFrom(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:StoreLerpFrom
	void UserConstructionScript(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:UserConstructionScript
	void ZoomInTimeline__FinishedFunc(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ZoomInTimeline__FinishedFunc
	void ZoomInTimeline__UpdateFunc(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ZoomInTimeline__UpdateFunc
	void ZoomOutTimeline__FinishedFunc(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ZoomOutTimeline__FinishedFunc
	void ZoomOutTimeline__UpdateFunc(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ZoomOutTimeline__UpdateFunc
	void InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31(FKey Key); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_31
	void InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30(FKey Key); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_30
	void ReceiveTick(float DeltaSeconds); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ReceiveTick
	void OnActivated(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:OnActivated
	void OnDeactivated(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:OnDeactivated
	void ReceiveBeginPlay(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ReceiveBeginPlay
	void ClearBuildingFocus(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ClearBuildingFocus
	void SetBuildingFocus(class UCameraComponent* BuildingCameraComponent); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:SetBuildingFocus
	void BP_Clear_Focus(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:BP Clear Focus
	void OnDragBegin(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:OnDragBegin
	void OnDragEnd(); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:OnDragEnd
	void ExecuteUbergraph_HomeBaseCamera_Blueprint(int32_t EntryPoint); // Function /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.HomeBaseCamera_Blueprint_C:ExecuteUbergraph_HomeBaseCamera_Blueprint
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/HomeBaseCamera_Blueprint.PLACEHOLDER-CLASS__TVPostProcessBP_C_158
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_158
{
public:
	static class UClass* StaticClass();
};

