#pragma once
#include "FN_Basic.h"

#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Hero_Management_HUDWrapper
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/Hero_Management_HUDWrapper.Hero_Management_HUDWrapper_C
// 0x0010 (0x0254)
class UHero_Management_HUDWrapper_C : public UFortUserWidget
{
public:
	class UImage*                                                                                        fill;                                              // 0x0244 (0x0004)
	class UImage*                                                                                        Frame;                                             // 0x0248 (0x0004)
	class UHero_Management_C*                                                                            Hero_Management;                                   // 0x024C (0x0004)
	class UImage*                                                                                        Pattern;                                           // 0x0250 (0x0004)
public:
	static class UClass* StaticClass();
};

