#pragma once
#include "FN_Basic.h"

#include "FN_HuskPawn_Bombshell_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_HuskPawn_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HuskPawn_Bombshell
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C
// 0x0018 (0x1094)
class AHuskPawn_Bombshell_C : public AHuskPawn_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x107C (0x0004)
	class UParticleSystem*                                                                               Effect_Head_Fire;                                  // 0x1080 (0x0004)
	class UParticleSystemComponent*                                                                      Effect_Head_Fire_Emitter;                          // 0x1084 (0x0004)
	TArray<class UMaterialInstanceConstant*>                                                             FemaleMaterialVariants;                            // 0x1088 (0x000C)
public:
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C:UserConstructionScript
	void PawnUniqueIDSet(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C:PawnUniqueIDSet
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C:OnDeathPlayEffects
	void ReceiveBeginPlay(); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C:ReceiveBeginPlay
	void ExecuteUbergraph_HuskPawn_Bombshell(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/HuskPawn_Bombshell.HuskPawn_Bombshell_C:ExecuteUbergraph_HuskPawn_Bombshell
public:
	static class UClass* StaticClass();
};

