#pragma once
#include "FN_Basic.h"

#include "FN_HeroesCamera_Blueprint_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroesCamera_Blueprint
*/

// BlueprintGeneratedClass /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C
// 0x000C (0x0614)
class AHeroesCamera_Blueprint_C : public AFortCameraBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	bool                                                                                                 MouseDown;                                         // 0x060C (0x0001)
	uint8_t                                                                                              UnknownData_60D[0x3];                              // 0x060D (0x0003) MISSED OFFSET
	class AFortPlayerPawn*                                                                               Cached_Pawn;                                       // 0x0610 (0x0004)
public:
	void HandleMousePress(); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:HandleMousePress
	void HandleMouseRelease(); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:HandleMouseRelease
	void UserConstructionScript(); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:UserConstructionScript
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_27(FKey Key); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_27
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_26(FKey Key); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_26
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_25(FKey Key); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_25
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_24(FKey Key); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_24
	void OnActivated(); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:OnActivated
	void OnDeactivated(); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:OnDeactivated
	void ReceiveTick(float DeltaSeconds); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:ReceiveTick
	void ExecuteUbergraph_HeroesCamera_Blueprint(int32_t EntryPoint); // Function /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.HeroesCamera_Blueprint_C:ExecuteUbergraph_HeroesCamera_Blueprint
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/HeroesCamera_Blueprint.PLACEHOLDER-CLASS__TVPostProcessBP_C_157
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_157
{
public:
	static class UClass* StaticClass();
};

