#pragma once
#include "FN_Basic.h"

#include "FN_HB_RoadManager_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_Path_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HB_RoadManager
*/

// BlueprintGeneratedClass /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C
// 0x0050 (0x0290)
class AHB_RoadManager_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UBillboardComponent*                                                                           Billboard1;                                        // 0x0244 (0x0004)
	float                                                                                                UpgradeTimeline_Value_5B44A914459EF36B289CBE91AAD4022E; // 0x0248 (0x0004)
	ETimelineDirection                                                                                   UpgradeTimeline__Direction_5B44A914459EF36B289CBE91AAD4022E; // 0x024C (0x0001)
	uint8_t                                                                                              UnknownData_24D[0x3];                              // 0x024D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            UpgradeTimeline;                                   // 0x0250 (0x0004)
	TArray<FPath>                                                                                        UpgradePaths;                                      // 0x0254 (0x000C)
	TArray<float>                                                                                        UpgradePathProgression;                            // 0x0260 (0x000C)
	bool                                                                                                 DisplayAllRoads;                                   // 0x026C (0x0001)
	uint8_t                                                                                              UnknownData_26D[0x3];                              // 0x026D (0x0003) MISSED OFFSET
	float                                                                                                GlobalRoadDebug;                                   // 0x0270 (0x0004)
	TArray<int32_t>                                                                                      UpgradeBuildingID;                                 // 0x0274 (0x000C)
	float                                                                                                TempProgressionValue;                              // 0x0280 (0x0004)
	TArray<int32_t>                                                                                      CurrentPathIndices;                                // 0x0284 (0x000C)
public:
	void FindAllPaths(int32_t ID, TArray<int32_t> IndexArray); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:FindAllPaths
	void ResetAllPaths(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:ResetAllPaths
	void Set_Path(float ProgressValue, int32_t INDEX); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:Set Path
	void DebugAllRoads(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:DebugAllRoads
	void UpgradePath(int32_t INDEX); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:UpgradePath
	void UserConstructionScript(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:UserConstructionScript
	void UpgradeTimeline__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:UpgradeTimeline__FinishedFunc
	void UpgradeTimeline__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:UpgradeTimeline__UpdateFunc
	void StartPathUpgradeAnimation(int32_t ID, float ProgressValue); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:StartPathUpgradeAnimation
	void SetPathProgression(int32_t ID, float ProgressionValue); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:SetPathProgression
	void ExecuteUbergraph_HB_RoadManager(int32_t EntryPoint); // Function /Game/Environments/Homebase/Blueprints/HB_RoadManager.HB_RoadManager_C:ExecuteUbergraph_HB_RoadManager
public:
	static class UClass* StaticClass();
};

