#pragma once
#include "FN_Basic.h"

#include "FN_HeroTrait_Widget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroTrait_Widget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C
// 0x0040 (0x01F8)
class UHeroTrait_Widget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UHeroAbility_Widget_C*                                                                         _Ability__1;                                       // 0x01BC (0x0004)
	class UHeroAbility_Widget_C*                                                                         _Ability__2;                                       // 0x01C0 (0x0004)
	class UHeroAbility_Widget_C*                                                                         _Ability__3;                                       // 0x01C4 (0x0004)
	class UHeroAbility_Widget_C*                                                                         _Ability__4;                                       // 0x01C8 (0x0004)
	class UHeroAbility_Widget_C*                                                                         _Ability__5;                                       // 0x01CC (0x0004)
	class UImage*                                                                                        _Image__Trait_Base;                                // 0x01D0 (0x0004)
	class UImage*                                                                                        _Image__Trait_Icon;                                // 0x01D4 (0x0004)
	class UFortTrait*                                                                                    Trait_Data;                                        // 0x01D8 (0x0004)
	int32_t                                                                                              Trait_Index;                                       // 0x01DC (0x0004)
	TArray<class UHeroAbility_Widget_C*>                                                                 Ability_Widgets;                                   // 0x01E0 (0x000C)
	struct FUHeroTrait_Widget_C_OnRequestSetTraitDepth__DelegateSignature                                OnRequestSetTraitDepth;                            // 0x01EC (0x000C)
public:
	void Refresh(); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:Refresh
	void On_Ability_Selected(int32_t INDEX, bool SELECTED); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:On Ability Selected
	class UWidget* Get_Primary_Trait_Tooltip(); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:Get Primary Trait Tooltip
	void Update(class UFortTrait* Trait, int32_t INDEX); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:Update
	void Construct(); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:Construct
	void ExecuteUbergraph_HeroTrait_Widget(int32_t EntryPoint); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:ExecuteUbergraph_HeroTrait_Widget
	void OnRequestSetTraitDepth__DelegateSignature(); // Function /Game/UI/Heroes/HeroTrait_Widget.HeroTrait_Widget_C:OnRequestSetTraitDepth__DelegateSignature
public:
	static class UClass* StaticClass();
};

