#pragma once
#include "FN_Basic.h"

#include "FN_HeroAbility_Widget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroAbility_Widget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C
// 0x0028 (0x01E0)
class UHeroAbility_Widget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Ability;                                  // 0x01BC (0x0004)
	class UItemStackCounter_C*                                                                           _StackCounter__Cost;                               // 0x01C0 (0x0004)
	bool                                                                                                 Is_Active;                                         // 0x01C4 (0x0001)
	uint8_t                                                                                              UnknownData_1C5[0x3];                              // 0x01C5 (0x0003) MISSED OFFSET
	class UFortAbilityKit*                                                                               Ability_Kit_Data;                                  // 0x01C8 (0x0004)
	int32_t                                                                                              Cost;                                              // 0x01CC (0x0004)
	int32_t                                                                                              INDEX;                                             // 0x01D0 (0x0004)
	struct FUHeroAbility_Widget_C_OnAbilitySelected__DelegateSignature                                   OnAbilitySelected;                                 // 0x01D4 (0x000C)
public:
	void On_Ability_Selected(class UFortBaseButton* Ability_Button, bool SELECTED); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:On Ability Selected
	void Update(class UFortAbilityKit* Ability_Kit, int32_t Cost, bool Is_Active); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:Update
	class UWidget* Get_Ability_Kit_Tooltip(); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:Get Ability Kit Tooltip
	void Construct(); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:Construct
	void ExecuteUbergraph_HeroAbility_Widget(int32_t EntryPoint); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:ExecuteUbergraph_HeroAbility_Widget
	void OnAbilitySelected__DelegateSignature(int32_t INDEX, bool SELECTED); // Function /Game/UI/Heroes/HeroAbility_Widget.HeroAbility_Widget_C:OnAbilitySelected__DelegateSignature
public:
	static class UClass* StaticClass();
};

