#pragma once
#include "FN_Basic.h"

#include "FN_HeadMountedDisplay_enums.h"
#include "FN_HeadMountedDisplay_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeadMountedDisplay
*/

// Class /Script/HeadMountedDisplay.MotionControllerComponent
// 0x0020 (0x0450)
class UMotionControllerComponent : public UPrimitiveComponent
{
public:
	int32_t                                                                                              PlayerIndex;                                       // 0x042C (0x0004)
	EControllerHand                                                                                      Hand;                                              // 0x0430 (0x0001)
	uint8_t                                                                                              UnknownData_431[0x3];                              // 0x0431 (0x0003) MISSED OFFSET
	uint8_t                                                                                              bDisableLowLatencyUpdate : 1;                      // 0x0434 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_435[0x3];                              // 0x0435 (0x0003) MISSED OFFSET
	ETrackingStatus                                                                                      CurrentTrackingStatus;                             // 0x0438 (0x0001)
	uint8_t                                                                                              UnknownData_439[0x17];                             // 0x0439 (0x0017) MISSED OFFSET
public:
	bool IsTracked() const; // Function /Script/HeadMountedDisplay.MotionControllerComponent:IsTracked
public:
	static class UClass* StaticClass();
};

