#pragma once
#include "FN_Basic.h"

#include "FN_HeroCoreAbility_Widget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HeroCoreAbility_Widget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C
// 0x0014 (0x01CC)
class UHeroCoreAbility_Widget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        _Image__Frame;                                     // 0x01BC (0x0004)
	class UImage*                                                                                        _Image__Icon;                                      // 0x01C0 (0x0004)
	bool                                                                                                 Is_Unlocked;                                       // 0x01C4 (0x0001)
	uint8_t                                                                                              UnknownData_1C5[0x3];                              // 0x01C5 (0x0003) MISSED OFFSET
	class UFortAbilityKit*                                                                               Ability_Kit_Data;                                  // 0x01C8 (0x0004)
public:
	void Invalid_Data(); // Function /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C:Invalid Data
	void Update(class UFortAbilityKit* Ability_Kit, bool Is_Unlocked); // Function /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C:Update
	class UWidget* Get_Ability_Kit_Tooltip(); // Function /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C:Get Ability Kit Tooltip
	void Construct(); // Function /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C:Construct
	void ExecuteUbergraph_HeroCoreAbility_Widget(int32_t EntryPoint); // Function /Game/UI/Heroes/HeroCoreAbility_Widget.HeroCoreAbility_Widget_C:ExecuteUbergraph_HeroCoreAbility_Widget
public:
	static class UClass* StaticClass();
};

