#pragma once
#include "FN_Basic.h"

#include "FN_HBOnboardingFlow_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HBOnboardingFlow
*/

// BlueprintGeneratedClass /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C
// 0x006C (0x02AC)
class AHBOnboardingFlow_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x0244 (0x0004)
	class AFortPlayerController*                                                                         PlayerController;                                  // 0x0248 (0x0004)
	class UFortQuestManager*                                                                             QuestManager;                                      // 0x024C (0x0004)
	class UFortQuestItemDefinition*                                                                      OnboardingQuest;                                   // 0x0250 (0x0004)
	class UFortQuestItemDefinition*                                                                      OnboardingAfterOutpostQuest;                       // 0x0254 (0x0004)
	FDataTableRowHandle                                                                                  CompleteZoneObjective;                             // 0x0258 (0x000C)
	FDataTableRowHandle                                                                                  NameHomebaseObjective;                             // 0x0264 (0x000C)
	FDataTableRowHandle                                                                                  BuildHeroBuildingObjective;                        // 0x0270 (0x000C)
	FDataTableRowHandle                                                                                  RecruitHeroObjective;                              // 0x027C (0x000C)
	class UFortQuestItem*                                                                                OnboardingQuestItem;                               // 0x0288 (0x0004)
	FMargin                                                                                              NotificationPadding;                               // 0x028C (0x0010)
	FDataTableRowHandle                                                                                  PlaySatelliteCineObjective;                        // 0x029C (0x000C)
	class UFortAccountItemDefinition*                                                                    ShowNewsToken;                                     // 0x02A8 (0x0004)
public:
	void HandleMcpFailure(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:HandleMcpFailure
	void UpdateVariableCache(bool Success); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:UpdateVariableCache
	void UserConstructionScript(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:UserConstructionScript
	void OnFailure_0A5ABC9C483947108FD9FB9980E7C62F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnFailure_0A5ABC9C483947108FD9FB9980E7C62F
	void OnIgnored_0A5ABC9C483947108FD9FB9980E7C62F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnIgnored_0A5ABC9C483947108FD9FB9980E7C62F
	void OnSuccess_0A5ABC9C483947108FD9FB9980E7C62F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnSuccess_0A5ABC9C483947108FD9FB9980E7C62F
	void OnFailure_94AB314F4BAAB3CAC0FA5E83D4318BDC(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnFailure_94AB314F4BAAB3CAC0FA5E83D4318BDC
	void OnIgnored_94AB314F4BAAB3CAC0FA5E83D4318BDC(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnIgnored_94AB314F4BAAB3CAC0FA5E83D4318BDC
	void OnSuccess_94AB314F4BAAB3CAC0FA5E83D4318BDC(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnSuccess_94AB314F4BAAB3CAC0FA5E83D4318BDC
	void OnFailure_921F8E7C425863C1CDDED09C7FC5034D(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnFailure_921F8E7C425863C1CDDED09C7FC5034D
	void OnIgnored_921F8E7C425863C1CDDED09C7FC5034D(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnIgnored_921F8E7C425863C1CDDED09C7FC5034D
	void OnSuccess_921F8E7C425863C1CDDED09C7FC5034D(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnSuccess_921F8E7C425863C1CDDED09C7FC5034D
	void OnFailure_F17CF9054AFDDDAF314AC4911BC9818F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnFailure_F17CF9054AFDDDAF314AC4911BC9818F
	void OnIgnored_F17CF9054AFDDDAF314AC4911BC9818F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnIgnored_F17CF9054AFDDDAF314AC4911BC9818F
	void OnSuccess_F17CF9054AFDDDAF314AC4911BC9818F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnSuccess_F17CF9054AFDDDAF314AC4911BC9818F
	void OnStateEntered_6973C4804831A19E4BDA22AFFEE0F251(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnStateEntered_6973C4804831A19E4BDA22AFFEE0F251
	void OnStateEntered_FEE56B7E40F9EBA0E7D44DBF3391C2D6(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnStateEntered_FEE56B7E40F9EBA0E7D44DBF3391C2D6
	void OnStateEntered_E61814764FB8ECDF4EEF2091C594F00F(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnStateEntered_E61814764FB8ECDF4EEF2091C594F00F
	void OnStateEntered_674FF9564D47F83BDED1938B23B03D50(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnStateEntered_674FF9564D47F83BDED1938B23B03D50
	void OnStateEntered_13927B524921691ACA0068A46DD375D3(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:OnStateEntered_13927B524921691ACA0068A46DD375D3
	void StartPlaySatelliteCine(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartPlaySatelliteCine
	void UnloadCinHomebase(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:UnloadCinHomebase
	void StartRecruitHero(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartRecruitHero
	void StartBuildHeroBuilding(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartBuildHeroBuilding
	void StartNameHomebase(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartNameHomebase
	void HandleClientEvent_HomebasePersonalized(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:HandleClientEvent_HomebasePersonalized
	void StartOnboardingZone(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartOnboardingZone
	void StartFlow(); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:StartFlow
	void ExecuteUbergraph_HBOnboardingFlow(int32_t EntryPoint); // Function /Game/FrontEnd/HomebaseOnboarding/HBOnboardingFlow.HBOnboardingFlow_C:ExecuteUbergraph_HBOnboardingFlow
public:
	static class UClass* StaticClass();
};

