#pragma once
#include "FN_Basic.h"

#include "FN_Hero_Management_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_WeaponTooltipStatType_enums.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Hero_Management
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/Hero_Management.Hero_Management_C
// 0x0094 (0x02D8)
class UHero_Management_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UBorder*                                                                                       _Border__Stats_Panel;                              // 0x0248 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Close_Stats;                              // 0x024C (0x0004)
	class UButtonIconText_C*                                                                             _Button__Delete;                                   // 0x0250 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Respec;                                   // 0x0254 (0x0004)
	class UHorizontalBox*                                                                                _Horizontal_Box__Core_Abilities;                   // 0x0258 (0x0004)
	class UImage*                                                                                        _Image__CrossoverArrow;                            // 0x025C (0x0004)
	class UImage*                                                                                        _Image__Husklock;                                  // 0x0260 (0x0004)
	class UImage*                                                                                        _Image__Slot_Pointer;                              // 0x0264 (0x0004)
	class UOverlay*                                                                                      _Overlay__Hero_Info;                               // 0x0268 (0x0004)
	class UWidgetSwitcher*                                                                               _Switcher__Points_Lock;                            // 0x026C (0x0004)
	class UButtonIconText_C*                                                                             _Tab__Stats;                                       // 0x0270 (0x0004)
	class UTextBlock*                                                                                    _Text__Ability_Point_Count;                        // 0x0274 (0x0004)
	class UTextBlock*                                                                                    _Text__Ability_Tree_Label;                         // 0x0278 (0x0004)
	class UTextBlock*                                                                                    _Text__Primary_Header;                             // 0x027C (0x0004)
	class UVerticalBox*                                                                                  _Vertical_Box__Skill_Tree;                         // 0x0280 (0x0004)
	class UVerticalBox*                                                                                  _Vertical_Box__Stats;                              // 0x0284 (0x0004)
	class UHeroInfoWidget_C*                                                                             HeroInfoWidget;                                    // 0x0288 (0x0004)
	class UVerticalBox*                                                                                  VerticalBoxHeroSlots;                              // 0x028C (0x0004)
	class UHeroListWidget_C*                                                                             WidgetHeroList;                                    // 0x0290 (0x0004)
	TArray<class UHeroListItemWidget_C*>                                                                 HeroWidgetArray;                                   // 0x0294 (0x000C)
	FString                                                                                              CurrentHero;                                       // 0x02A0 (0x000C)
	class UFortAbilityKit*                                                                               ThisAbilityKitGoesToEleven;                        // 0x02AC (0x0004)
	TArray<class UHeroTrait_Widget_C*>                                                                   HeroTraitWidgetArray;                              // 0x02B0 (0x000C)
	FText                                                                                                StatValue;                                         // 0x02BC (0x000C)
	WeaponTooltipStatType                                                                                StatType;                                          // 0x02C8 (0x0001)
	bool                                                                                                 IsCategory;                                        // 0x02C9 (0x0001)
	uint8_t                                                                                              UnknownData_2CA[0x2];                              // 0x02CA (0x0002) MISSED OFFSET
	FString                                                                                              StringMagnitude;                                   // 0x02CC (0x000C)
public:
	void On_Hero_Stats_Changed(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:On Hero Stats Changed
	void Set_Main_Panel_Visibility(bool Is_Visible); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Set Main Panel Visibility
	void Refresh_Delete_Permission(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Refresh Delete Permission
	void Rebuild_Hero_Slots(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Hero Slots
	void On_Ability_Points_Assigned(bool Success); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:On Ability Points Assigned
	void On_Hero_Deleted(bool Success); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:On Hero Deleted
	void On_Hero_Created(bool Success); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:On Hero Created
	void Rebuild_All(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild All
	void Show_Hide_Stats_Panel(bool Show_Panel); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Show/Hide Stats Panel
	void Rebuild_Stats_Panel(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Stats Panel
	void Rebuild_Skill_Tree(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Skill Tree
	void Rebuild_Core_Abilities(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Core Abilities
	void Rebuild_Main_Panel(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Main Panel
	void Rebuild_Hero_List(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Rebuild Hero List
	void On_Hero_Selected(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:On Hero Selected
	void OnTimedOut_2CEB7D4940ED5B5499AC7991F91F4019(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:OnTimedOut_2CEB7D4940ED5B5499AC7991F91F4019
	void OnDeclined_2CEB7D4940ED5B5499AC7991F91F4019(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:OnDeclined_2CEB7D4940ED5B5499AC7991F91F4019
	void OnConfirmed_2CEB7D4940ED5B5499AC7991F91F4019(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:OnConfirmed_2CEB7D4940ED5B5499AC7991F91F4019
	void Construct(); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:Construct
	void BndEvt___Tab__Stats_K2Node_ComponentBoundEvent_532_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:BndEvt__[Tab] Stats_K2Node_ComponentBoundEvent_532_FortSelectedStateChanged__DelegateSignature
	void BndEvt___Button__Close_Stats_K2Node_ComponentBoundEvent_606_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:BndEvt__[Button] Close Stats_K2Node_ComponentBoundEvent_606_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Respec_K2Node_ComponentBoundEvent_693_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:BndEvt__[Button] Respec_K2Node_ComponentBoundEvent_693_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Delete_K2Node_ComponentBoundEvent_827_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:BndEvt__[Button] Delete_K2Node_ComponentBoundEvent_827_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_Hero_Management(int32_t EntryPoint); // Function /Game/UI/Heroes/Hero_Management.Hero_Management_C:ExecuteUbergraph_Hero_Management
public:
	static class UClass* StaticClass();
};

