#pragma once
#include "FN_Basic.h"

#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: HB_Placement
*/

// BlueprintGeneratedClass /Game/Environments/Homebase/Blueprints/HB_Placement.HB_Placement_C
// 0x0014 (0x0258)
class AHB_Placement_C : public AMyTownPlacementActor
{
public:
	class UCameraComponent*                                                                              CameraComponent;                                   // 0x0244 (0x0004)
	class UTextRenderComponent*                                                                          TextObject;                                        // 0x0248 (0x0004)
	int32_t                                                                                              BuildingPositionID;                                // 0x024C (0x0004)
	bool                                                                                                 DebugShowBuilding;                                 // 0x0250 (0x0001)
	uint8_t                                                                                              UnknownData_251[0x3];                              // 0x0251 (0x0003) MISSED OFFSET
	class UStaticMesh*                                                                                   DebugMesh;                                         // 0x0254 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Environments/Homebase/Blueprints/HB_Placement.HB_Placement_C:UserConstructionScript
public:
	static class UClass* StaticClass();
};

