#pragma once
#include "FN_Basic.h"

#include "FN_ItemBadge_parameters.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_ItemTierIconSet_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ItemBadge
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/ItemBadge.ItemBadge_C
// 0x0B65 (0x0D1D)
class UItemBadge_C : public UUserWidget
{
public:
	class UVerticalBox*                                                                                  _Vertical_Box_;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        Accent;                                            // 0x01BC (0x0004)
	class UImage*                                                                                        Base;                                              // 0x01C0 (0x0004)
	class UItemLevelBadge_C*                                                                             ItemLevelBadge;                                    // 0x01C4 (0x0004)
	class UOverlay*                                                                                      Main_Overlay;                                      // 0x01C8 (0x0004)
	class UImage*                                                                                        Tier_Icon;                                         // 0x01CC (0x0004)
	FItemTierIconSet                                                                                     TierIconSet;                                       // 0x01D0 (0x000C)
	FFortMultiSizeBrush                                                                                  TierBaseMultiBrush;                                // 0x01DC (0x02B8)
	FFortMultiSizeBrush                                                                                  TierAccentMultiBrush;                              // 0x0494 (0x02B8)
	FFortMultiSizeMargin                                                                                 TierMultiMargin;                                   // 0x074C (0x0060)
	FFortMultiSizeBrush                                                                                  WorkerMultiBrush;                                  // 0x07AC (0x02B8)
	FFortMultiSizeBrush                                                                                  ManagerMultiBrush;                                 // 0x0A64 (0x02B8)
	EFortBrushSize                                                                                       Brush_Size;                                        // 0x0D1C (0x0001)
public:
	void Refresh(class UFortItem* Item_Data, ItemDisplayStyle Display_Style, ItemDisplayMode Display_Mode); // Function /Game/UI/Items/ItemBadge.ItemBadge_C:Refresh
	void Update(EFortBrushSize Brush_Size, ItemDisplayStyle Display_Style, ItemDisplayMode Display_Mode, FFortRarityItemData RarityData, class UFortItem* Item_Data); // Function /Game/UI/Items/ItemBadge.ItemBadge_C:Update
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/ItemBadge.PLACEHOLDER-CLASS__ItemLevelBadge_C_152
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemLevelBadge_C_152
{
public:
	static class UClass* StaticClass();
};

