#pragma once
#include "FN_Basic.h"

#include "FN_ItemLevelBadge_parameters.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ItemLevelBadge
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/ItemLevelBadge.ItemLevelBadge_C
// 0x0414 (0x05CC)
class UItemLevelBadge_C : public UUserWidget
{
public:
	class UBorder*                                                                                       _Border__Base;                                     // 0x01B8 (0x0004)
	class UTextBlock*                                                                                    _Text__Level;                                      // 0x01BC (0x0004)
	class USizeBox*                                                                                      Size_Box;                                          // 0x01C0 (0x0004)
	FFortMultiSizeFont                                                                                   MultiFont;                                         // 0x01C4 (0x00F0)
	FFortMultiSizeMargin                                                                                 MultiMargin;                                       // 0x02B4 (0x0060)
	FFortMultiSizeBrush                                                                                  MultiBrush;                                        // 0x0314 (0x02B8)
public:
	void Refresh(ItemDisplayMode Display_Mode, int32_t Max, int32_t Level); // Function /Game/UI/Items/ItemLevelBadge.ItemLevelBadge_C:Refresh
	void Update(int32_t Max, int32_t Level, EFortBrushSize Brush_Size, FFortRarityItemData Rarity_Data, ItemDisplayMode Display_Mode); // Function /Game/UI/Items/ItemLevelBadge.ItemLevelBadge_C:Update
public:
	static class UClass* StaticClass();
};

