#pragma once
#include "FN_Basic.h"

#include "FN_ItemCooldownMeter_parameters.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ItemCooldownMeter
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/ItemCooldownMeter.ItemCooldownMeter_C
// 0x0160 (0x0318)
class UItemCooldownMeter_C : public UUserWidget
{
public:
	class UImage*                                                                                        _Image__Backfill;                                  // 0x01B8 (0x0004)
	class UImage*                                                                                        _Image__Overfill;                                  // 0x01BC (0x0004)
	class USizeBox*                                                                                      _SizeBox_;                                         // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    _Text__Clock;                                      // 0x01C4 (0x0004)
	FFortMultiSizeFont                                                                                   MultiSizeFont;                                     // 0x01C8 (0x00F0)
	FFortMultiSizeMargin                                                                                 MultiSizeMargin;                                   // 0x02B8 (0x0060)
public:
	int32_t GetSecondsCorrectedMinutes(int32_t Minutes, int32_t Seconds); // Function /Game/UI/Items/ItemCooldownMeter.ItemCooldownMeter_C:GetSecondsCorrectedMinutes
	void Set_Cooldown(FTimespan Time_Left, float Percentage); // Function /Game/UI/Items/ItemCooldownMeter.ItemCooldownMeter_C:Set Cooldown
	void Update(EFortBrushSize Brush_Size, FTimespan Time_Left, float Percentage); // Function /Game/UI/Items/ItemCooldownMeter.ItemCooldownMeter_C:Update
public:
	static class UClass* StaticClass();
};

