#pragma once
#include "FN_Basic.h"

#include "FN_ItemStackCounter_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ItemStackCounter
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/ItemStackCounter.ItemStackCounter_C
// 0x0421 (0x0665)
class UItemStackCounter_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UBorder*                                                                                       _Border__Base;                                     // 0x0248 (0x0004)
	class USizeBox*                                                                                      _SizeBox_;                                         // 0x024C (0x0004)
	class UTextBlock*                                                                                    _Text__Counter;                                    // 0x0250 (0x0004)
	FFortMultiSizeBrush                                                                                  MultiSizeBase;                                     // 0x0254 (0x02B8)
	FFortMultiSizeFont                                                                                   MultiSizeFont;                                     // 0x050C (0x00F0)
	FFortMultiSizeMargin                                                                                 MultiSizeMargin;                                   // 0x05FC (0x0060)
	EFortBrushSize                                                                                       Brush_Size;                                        // 0x065C (0x0001)
	uint8_t                                                                                              UnknownData_65D[0x3];                              // 0x065D (0x0003) MISSED OFFSET
	int32_t                                                                                              Count;                                             // 0x0660 (0x0004)
	bool                                                                                                 AlwaysVisible;                                     // 0x0664 (0x0001)
public:
	void Refresh_Visibility(); // Function /Game/UI/Items/ItemStackCounter.ItemStackCounter_C:Refresh Visibility
	void Set_Stack_Count(int32_t Count); // Function /Game/UI/Items/ItemStackCounter.ItemStackCounter_C:Set Stack Count
	void Update(EFortBrushSize Brush_Size, int32_t Count); // Function /Game/UI/Items/ItemStackCounter.ItemStackCounter_C:Update
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/Items/ItemStackCounter.ItemStackCounter_C:PreConstruct
	void ExecuteUbergraph_ItemStackCounter(int32_t EntryPoint); // Function /Game/UI/Items/ItemStackCounter.ItemStackCounter_C:ExecuteUbergraph_ItemStackCounter
public:
	static class UClass* StaticClass();
};

