#pragma once
#include "FN_Basic.h"

#include "FN_InlineHeroCoreStat_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_HeroCoreStat_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: InlineHeroCoreStat
*/

// WidgetBlueprintGeneratedClass /Game/UI/Heroes/InlineHeroCoreStat.InlineHeroCoreStat_C
// 0x03DC (0x0594)
class UInlineHeroCoreStat_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        ImageStatIcon;                                     // 0x01BC (0x0004)
	class UImage*                                                                                        ImageStatShadow;                                   // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    TextStatValue;                                     // 0x01C4 (0x0004)
	FHeroCoreStat                                                                                        Data;                                              // 0x01C8 (0x02D4)
	EFortBrushSize                                                                                       Brush_Size;                                        // 0x049C (0x0001)
	uint8_t                                                                                              UnknownData_49D[0x3];                              // 0x049D (0x0003) MISSED OFFSET
	float                                                                                                Value;                                             // 0x04A0 (0x0004)
	FFortMultiSizeFont                                                                                   Font;                                              // 0x04A4 (0x00F0)
public:
	class UWidget* Get_Tooltip_Widget(); // Function /Game/UI/Heroes/InlineHeroCoreStat.InlineHeroCoreStat_C:Get Tooltip Widget
	void Update(FHeroCoreStat Data, float Value, EFortBrushSize Brush_Size); // Function /Game/UI/Heroes/InlineHeroCoreStat.InlineHeroCoreStat_C:Update
	void Construct(); // Function /Game/UI/Heroes/InlineHeroCoreStat.InlineHeroCoreStat_C:Construct
	void ExecuteUbergraph_InlineHeroCoreStat(int32_t EntryPoint); // Function /Game/UI/Heroes/InlineHeroCoreStat.InlineHeroCoreStat_C:ExecuteUbergraph_InlineHeroCoreStat
public:
	static class UClass* StaticClass();
};

