#pragma once
#include "FN_Basic.h"

#include "FN_Item_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_ItemDisplayMode_enums.h"
#include "FN_ItemDisplayStyle_enums.h"
#include "FN_ItemTextureSet_structs.h"
#include "FN_ItemTextureStylesheet_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Item
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/Item.Item_C
// 0x1527 (0x1C7F)
class UItem_C : public UFortItemWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0758 (0x0004)
	class UBorder*                                                                                       _Border__Secondary_Icon_Fill;                      // 0x075C (0x0004)
	class UBorder*                                                                                       _Border__Secondary_Icon_Frame;                     // 0x0760 (0x0004)
	class UBorder*                                                                                       _Border__Tertiary_Icon_Fill;                       // 0x0764 (0x0004)
	class UBorder*                                                                                       _Border__Tertiary_Icon_Frame;                      // 0x0768 (0x0004)
	class UHorizontalBox*                                                                                _Horizontal_Box__Subtype_Icons;                    // 0x076C (0x0004)
	class UImage*                                                                                        _Image__Accent_Tint_Shade;                         // 0x0770 (0x0004)
	class UImage*                                                                                        _Image__Background;                                // 0x0774 (0x0004)
	class UImage*                                                                                        _Image__Bevel_Bottom;                              // 0x0778 (0x0004)
	class UImage*                                                                                        _Image__Bevel_Side;                                // 0x077C (0x0004)
	class UImage*                                                                                        _Image__Bevel_Top;                                 // 0x0780 (0x0004)
	class UImage*                                                                                        _Image__Item_Icon;                                 // 0x0784 (0x0004)
	class UImage*                                                                                        _Image__Secondary_Icon;                            // 0x0788 (0x0004)
	class UImage*                                                                                        _Image__Tertiary_Icon;                             // 0x078C (0x0004)
	class UTextBlock*                                                                                    _Text__Ammo_Counter;                               // 0x0790 (0x0004)
	class UTextBlock*                                                                                    _Text__Ammo_Counter_Alternate;                     // 0x0794 (0x0004)
	class UVerticalBox*                                                                                  _Vertical_Box__Subtype_Icons___Ammo_Count;         // 0x0798 (0x0004)
	class UItemBadge_C*                                                                                  ItemBadge;                                         // 0x079C (0x0004)
	class UItemCooldownMeter_C*                                                                          ItemCooldownMeter;                                 // 0x07A0 (0x0004)
	class UItemDurabilityMeter_C*                                                                        ItemDurabilityMeter;                               // 0x07A4 (0x0004)
	class UItemStackCounter_C*                                                                           ItemStackCounter;                                  // 0x07A8 (0x0004)
	class USizeBox*                                                                                      SizeBox;                                           // 0x07AC (0x0004)
	FFortRarityItemData                                                                                  RarityData;                                        // 0x07B0 (0x0070)
	bool                                                                                                 CanBeDragged;                                      // 0x0820 (0x0001)
	uint8_t                                                                                              UnknownData_821[0x3];                              // 0x0821 (0x0003) MISSED OFFSET
	FString                                                                                              DragTagString;                                     // 0x0824 (0x000C)
	class UFortItem*                                                                                     ItemData;                                          // 0x0830 (0x0004)
	ItemDisplayMode                                                                                      DisplayMode;                                       // 0x0834 (0x0001)
	ItemDisplayStyle                                                                                     DisplayStyle;                                      // 0x0835 (0x0001)
	uint8_t                                                                                              UnknownData_836[0x2];                              // 0x0836 (0x0002) MISSED OFFSET
	FItemTextureSet                                                                                      Item_Textures;                                     // 0x0838 (0x0D9C)
	FItemTextureStylesheet                                                                               Item_Texture_Stylesheet;                           // 0x15D4 (0x000C)
	FFortMultiSizeBrush                                                                                  Subtype_Icon_Frame;                                // 0x15E0 (0x02B8)
	FFortMultiSizeFont                                                                                   AmmoMultiFont;                                     // 0x1898 (0x00F0)
	FText                                                                                                TooltipHeaderText;                                 // 0x1988 (0x000C)
	class USlateBrushAsset*                                                                              TooltipHeaderIcon;                                 // 0x1994 (0x0004)
	bool                                                                                                 InfiniteAmmo;                                      // 0x1998 (0x0001)
	uint8_t                                                                                              UnknownData_1999[0x3];                             // 0x1999 (0x0003) MISSED OFFSET
	class UFortItemDefinition*                                                                           DemoItemData;                                      // 0x199C (0x0004)
	FFortMultiSizeBrush                                                                                  Subtype_Icon_Fill;                                 // 0x19A0 (0x02B8)
	FLinearColor                                                                                         Subtype_Fill_Color;                                // 0x1C58 (0x0010)
	FLinearColor                                                                                         Subtype_Frame_Color;                               // 0x1C68 (0x0010)
	bool                                                                                                 OverrideSecondaryTypeIconColor;                    // 0x1C78 (0x0001)
	bool                                                                                                 ShowSecondaryTypeIcon;                             // 0x1C79 (0x0001)
	bool                                                                                                 ShowTertiaryTypeIcon;                              // 0x1C7A (0x0001)
	bool                                                                                                 OverrideTertiaryTypeIconColor;                     // 0x1C7B (0x0001)
	bool                                                                                                 OverrideItemIconVisibility;                        // 0x1C7C (0x0001)
	bool                                                                                                 ShowStackCounter;                                  // 0x1C7D (0x0001)
	bool                                                                                                 OverrideDisplayStyle;                              // 0x1C7E (0x0001)
public:
	void Set_Display_Style(bool Override_Display_Style, ItemDisplayStyle DisplayStyle); // Function /Game/UI/Items/Item.Item_C:Set Display Style
	void Hide_Subtype_Icons(); // Function /Game/UI/Items/Item.Item_C:Hide Subtype Icons
	void Set_Item_Icon_Visibility(bool Override_Icon_Visibility, ESlateVisibility Item_Icon_Visibility); // Function /Game/UI/Items/Item.Item_C:Set Item Icon Visibility
	void Set_Subtype_Icons___Ammo_Color(bool Override_Secondary_Icon_Color, FLinearColor Secondary_Icon_Override_Color, bool Override_Tertiary_Icon_Color, FLinearColor Tertiary_Icon_Override_Color); // Function /Game/UI/Items/Item.Item_C:Set Subtype Icons & Ammo Color
	FEventReply OnMouseButtonDoubleClick(FGeometry InMyGeometry, FPointerEvent InMouseEvent); // Function /Game/UI/Items/Item.Item_C:OnMouseButtonDoubleClick
	void Resize(EFortBrushSize Brush_Size); // Function /Game/UI/Items/Item.Item_C:Resize
	void Refresh(); // Function /Game/UI/Items/Item.Item_C:Refresh
	void Set_Stack_Count(int32_t Count); // Function /Game/UI/Items/Item.Item_C:Set Stack Count
	void Set_Cooldown(FTimespan Time_Left, float Percentage, bool Show_Disabled_Without_Cooldown); // Function /Game/UI/Items/Item.Item_C:Set Cooldown
	void Set_Durability(float Durability); // Function /Game/UI/Items/Item.Item_C:Set Durability
	void Update_Cooldown_Meter(); // Function /Game/UI/Items/Item.Item_C:Update Cooldown Meter
	void Update_Durability_Meter(); // Function /Game/UI/Items/Item.Item_C:Update Durability Meter
	void Set_Tooltip_Header(FText Header_Text, class USlateBrushAsset* Icon_Brush); // Function /Game/UI/Items/Item.Item_C:Set Tooltip Header
	class UWidget* Get_Item_Tooltip(); // Function /Game/UI/Items/Item.Item_C:Get Item Tooltip
	void Set_Display_Mode(EFortUIState Current_UI_State, bool Cursor_Mode); // Function /Game/UI/Items/Item.Item_C:Set Display Mode
	void Set_Ammo_Count(int32_t Count); // Function /Game/UI/Items/Item.Item_C:Set Ammo Count
	void Update_Subtype_Icons___Ammo(); // Function /Game/UI/Items/Item.Item_C:Update Subtype Icons & Ammo
	void Update_Accent_Tint_Shade(); // Function /Game/UI/Items/Item.Item_C:Update Accent Tint/Shade
	void Update_Side_Bevel(); // Function /Game/UI/Items/Item.Item_C:Update Side Bevel
	void Update_Top_Bevel(); // Function /Game/UI/Items/Item.Item_C:Update Top Bevel
	void Update_Bottom_Bevel(); // Function /Game/UI/Items/Item.Item_C:Update Bottom Bevel
	void Update_Masked_Gradient(class UImage* Image, class UTexture* Texture_Mask, FLinearColor Color_A, FLinearColor Color_B); // Function /Game/UI/Items/Item.Item_C:Update Masked Gradient
	void Get_Display_Style(EFortItemType Item_Type, ItemDisplayStyle Style); // Function /Game/UI/Items/Item.Item_C:Get Display Style
	void Update_Tier_Level_Badge(); // Function /Game/UI/Items/Item.Item_C:Update Tier/Level Badge
	void Update_Item_Icon(); // Function /Game/UI/Items/Item.Item_C:Update Item Icon
	void Get_Item_Texture_Set(ItemDisplayStyle Display_Style, FItemTextureSet Texture_Set); // Function /Game/UI/Items/Item.Item_C:Get Item Texture Set
	void Update_Background(); // Function /Game/UI/Items/Item.Item_C:Update Background
	void Update_Size_Box(); // Function /Game/UI/Items/Item.Item_C:Update Size Box
	void OnDragDetected(FGeometry MyGeometry, FPointerEvent PointerEvent, class UDragDropOperation* Operation); // Function /Game/UI/Items/Item.Item_C:OnDragDetected
	FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent MouseEvent); // Function /Game/UI/Items/Item.Item_C:OnMouseButtonDown
	void Update_All(); // Function /Game/UI/Items/Item.Item_C:Update All
	void Update_Stack_Counter(); // Function /Game/UI/Items/Item.Item_C:Update Stack Counter
	void Set_Item_Data(class UFortItem* Item_Data); // Function /Game/UI/Items/Item.Item_C:Set Item Data
	void Update_Base(); // Function /Game/UI/Items/Item.Item_C:Update Base
	void BPOnItemChanged(); // Function /Game/UI/Items/Item.Item_C:BPOnItemChanged
	void Construct(); // Function /Game/UI/Items/Item.Item_C:Construct
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/Items/Item.Item_C:PreConstruct
	void BPOnItemSet(class UFortItem* NewItem); // Function /Game/UI/Items/Item.Item_C:BPOnItemSet
	void OnCursorModeChanged(bool bCursorModeEnabled, FName ActionName, class UUserWidget* CursorModeContentWidget); // Function /Game/UI/Items/Item.Item_C:OnCursorModeChanged
	void ExecuteUbergraph_Item(int32_t EntryPoint); // Function /Game/UI/Items/Item.Item_C:ExecuteUbergraph_Item
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/Item.PLACEHOLDER-CLASS__ItemDragIcon_C_147
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemDragIcon_C_147
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/Item.PLACEHOLDER-CLASS__ItemBadge_C_148
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemBadge_C_148
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/Item.PLACEHOLDER-CLASS__ItemCooldownMeter_C_149
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemCooldownMeter_C_149
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/Item.PLACEHOLDER-CLASS__ItemDurabilityMeter_C_150
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemDurabilityMeter_C_150
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Items/Item.PLACEHOLDER-CLASS__ItemStackCounter_C_151
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__ItemStackCounter_C_151
{
public:
	static class UClass* StaticClass();
};

