#pragma once
#include "FN_Basic.h"

#include "FN_ItemDurabilityMeter_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ItemDurabilityMeter
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C
// 0x0028 (0x01E0)
class UItemDurabilityMeter_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        _Image__Backfill;                                  // 0x01BC (0x0004)
	class UImage*                                                                                        _Image__Overfill;                                  // 0x01C0 (0x0004)
	class USizeBox*                                                                                      Size_Box;                                          // 0x01C4 (0x0004)
	float                                                                                                DefaultPadding;                                    // 0x01C8 (0x0004)
	float                                                                                                MinimumFillHeight;                                 // 0x01CC (0x0004)
	FLinearColor                                                                                         Backfill_Color;                                    // 0x01D0 (0x0010)
public:
	void Set_Backfill_Color(FLinearColor Backfill_Color); // Function /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C:Set Backfill Color
	void Set_Durability(float Durability); // Function /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C:Set Durability
	void Update(FVector2D Draw_Size, float Durability); // Function /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C:Update
	void Construct(); // Function /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C:Construct
	void ExecuteUbergraph_ItemDurabilityMeter(int32_t EntryPoint); // Function /Game/UI/Items/ItemDurabilityMeter.ItemDurabilityMeter_C:ExecuteUbergraph_ItemDurabilityMeter
public:
	static class UClass* StaticClass();
};

