#pragma once
#include "FN_Basic.h"

#include "FN_JournalCategoryWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: JournalCategoryWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C
// 0x001C (0x0260)
class UJournalCategoryWidget_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UFortListView*                                                                                 EntryList;                                         // 0x0248 (0x0004)
	class UButtonIconText_C*                                                                             ExpanderButton;                                    // 0x024C (0x0004)
	class UFortQuestCategory*                                                                            QuestCategory;                                     // 0x0250 (0x0004)
	struct FUJournalCategoryWidget_C_OnItemSelected__DelegateSignature                                   OnItemSelected;                                    // 0x0254 (0x000C)
public:
	void ClearSelection(); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:ClearSelection
	class UWidget* On_EntryList_GenerateRow(class UObject* Item); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:On_EntryList_GenerateRow
	void Construct(); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:Construct
	void BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature(class UObject* Item); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:BndEvt__EntryList_K2Node_ComponentBoundEvent_467_ListViewEvent__DelegateSignature
	void BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:BndEvt__ExpanderButton_K2Node_ComponentBoundEvent_78_FortSelectedStateChanged__DelegateSignature
	void ExecuteUbergraph_JournalCategoryWidget(int32_t EntryPoint); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:ExecuteUbergraph_JournalCategoryWidget
	void OnItemSelected__DelegateSignature(class UJournalCategoryWidget_C* CategoryWidget, class UFortQuestItem* QuestItem); // Function /Game/UI/Journal/JournalCategoryWidget.JournalCategoryWidget_C:OnItemSelected__DelegateSignature
public:
	static class UClass* StaticClass();
};

