#pragma once
#include "FN_Basic.h"

#include "FN_JournalObjectiveEntry_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: JournalObjectiveEntry
*/

// WidgetBlueprintGeneratedClass /Game/UI/Journal/JournalObjectiveEntry.JournalObjectiveEntry_C
// 0x0010 (0x0254)
class UJournalObjectiveEntry_C : public UFortListItem
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UBorder*                                                                                       Background;                                        // 0x0248 (0x0004)
	class UJournalProgressWidget_C*                                                                      JournalProgressWidget;                             // 0x024C (0x0004)
	class UTextBlock*                                                                                    TaskName;                                          // 0x0250 (0x0004)
public:
	void Update(class UFortQuestObjectiveInfo* Objective); // Function /Game/UI/Journal/JournalObjectiveEntry.JournalObjectiveEntry_C:Update
	void UpdateProgress(class UFortQuestObjectiveInfo* Objective); // Function /Game/UI/Journal/JournalObjectiveEntry.JournalObjectiveEntry_C:UpdateProgress
	void SetData(class UObject* InData); // Function /Game/UI/Journal/JournalObjectiveEntry.JournalObjectiveEntry_C:SetData
	void ExecuteUbergraph_JournalObjectiveEntry(int32_t EntryPoint); // Function /Game/UI/Journal/JournalObjectiveEntry.JournalObjectiveEntry_C:ExecuteUbergraph_JournalObjectiveEntry
public:
	static class UClass* StaticClass();
};

