#pragma once
#include "FN_Basic.h"

#include "FN_JournalProgressWidget_parameters.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: JournalProgressWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Journal/JournalProgressWidget.JournalProgressWidget_C
// 0x0014 (0x0258)
class UJournalProgressWidget_C : public UFortUserWidget
{
public:
	class UImage*                                                                                        _Image__Checkbox;                                  // 0x0244 (0x0004)
	class UProgressBar*                                                                                  _ProgressBar__Quest_Progress;                      // 0x0248 (0x0004)
	class UWidgetSwitcher*                                                                               _Switcher__Display_Mode;                           // 0x024C (0x0004)
	class UTextBlock*                                                                                    _Text__Progress_Value;                             // 0x0250 (0x0004)
	class UTextBlock*                                                                                    TextBlock_10431;                                   // 0x0254 (0x0004)
public:
	void Update(int32_t Required, int32_t Achieved); // Function /Game/UI/Journal/JournalProgressWidget.JournalProgressWidget_C:Update
public:
	static class UClass* StaticClass();
};

