#pragma once
#include "FN_Basic.h"

#include "FN_JournalDetails_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: JournalDetails
*/

// WidgetBlueprintGeneratedClass /Game/UI/Journal/JournalDetails.JournalDetails_C
// 0x0038 (0x027C)
class UJournalDetails_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UButtonIconText_C*                                                                             AbandonButton;                                     // 0x0248 (0x0004)
	class UTextBlock*                                                                                    DescriptionTextBlock;                              // 0x024C (0x0004)
	class UVerticalBox*                                                                                  DescriptionVerticalBox;                            // 0x0250 (0x0004)
	class UImage*                                                                                        Image_572;                                         // 0x0254 (0x0004)
	class UBorder*                                                                                       ProgressBorder;                                    // 0x0258 (0x0004)
	class UImage*                                                                                        QuestIcon_Fill;                                    // 0x025C (0x0004)
	class UImage*                                                                                        QuestIcon_Shadow;                                  // 0x0260 (0x0004)
	class UTextBlock*                                                                                    QuestName;                                         // 0x0264 (0x0004)
	class UWidgetSwitcher*                                                                               QuestSelectedWidgetSwitcher;                       // 0x0268 (0x0004)
	class UBorder*                                                                                       RewardsBorder;                                     // 0x026C (0x0004)
	class URewardsListWidget_C*                                                                          RewardsListWidget;                                 // 0x0270 (0x0004)
	class UFortListView*                                                                                 TaskList;                                          // 0x0274 (0x0004)
	class UFortQuestItem*                                                                                QuestItem;                                         // 0x0278 (0x0004)
public:
	class UWidget* GenerateAbandonButtonToolTipWidget(); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:GenerateAbandonButtonToolTipWidget
	void SetupAbandonBtn(); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:SetupAbandonBtn
	void Update(); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:Update
	void Setup(class UFortQuestItem* QuestItem, bool ShowObjectives, bool ShowRewards); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:Setup
	void Construct(); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:Construct
	void BndEvt__AbandonButton_K2Node_ComponentBoundEvent_71_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:BndEvt__AbandonButton_K2Node_ComponentBoundEvent_71_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_JournalDetails(int32_t EntryPoint); // Function /Game/UI/Journal/JournalDetails.JournalDetails_C:ExecuteUbergraph_JournalDetails
public:
	static class UClass* StaticClass();
};

