#pragma once
#include "FN_Basic.h"

#include "FN_JournalEntry_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: JournalEntry
*/

// WidgetBlueprintGeneratedClass /Game/UI/Journal/JournalEntry.JournalEntry_C
// 0x002C (0x0768)
class UJournalEntry_C : public UFortBaseButton
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x073C (0x0004)
	class UImage*                                                                                        _Image__Background;                                // 0x0740 (0x0004)
	class UImage*                                                                                        _Image__Quest_Name__HR_;                           // 0x0744 (0x0004)
	class UImage*                                                                                        _Image__Top_Bevel;                                 // 0x0748 (0x0004)
	class UTextBlock*                                                                                    _Text__Quest_Name;                                 // 0x074C (0x0004)
	class UFortBangWrapper*                                                                              FortBangWrapper;                                   // 0x0750 (0x0004)
	class UImage*                                                                                        ImageAlternabang;                                  // 0x0754 (0x0004)
	class UJournalProgressWidget_C*                                                                      JournalProgressWidget;                             // 0x0758 (0x0004)
	class UImage*                                                                                        QuestIcon_Fill;                                    // 0x075C (0x0004)
	class UImage*                                                                                        QuestIcon_Shadow;                                  // 0x0760 (0x0004)
	class UFortQuestItem*                                                                                QuestItem;                                         // 0x0764 (0x0004)
public:
	void Setup(class UFortQuestItem* Quest); // Function /Game/UI/Journal/JournalEntry.JournalEntry_C:Setup
	void UpdateProgress(); // Function /Game/UI/Journal/JournalEntry.JournalEntry_C:UpdateProgress
	void Construct(); // Function /Game/UI/Journal/JournalEntry.JournalEntry_C:Construct
	void HandleSelectedChanged(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Journal/JournalEntry.JournalEntry_C:HandleSelectedChanged
	void ExecuteUbergraph_JournalEntry(int32_t EntryPoint); // Function /Game/UI/Journal/JournalEntry.JournalEntry_C:ExecuteUbergraph_JournalEntry
public:
	static class UClass* StaticClass();
};

