#pragma once
#include "FN_Basic.h"

#include "FN_Lobby_structs.h"
#include "FN_Lobby_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"
#include "FN_OnlineSubsystemUtils_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Lobby
*/

// Class /Script/Lobby.LobbyBeaconHost
// 0x0024 (0x0280)
class ALobbyBeaconHost : public AOnlineBeaconHostObject
{
public:
	uint8_t                                                                                              UnknownData_25C[0x8];                              // 0x025C (0x0008) MISSED OFFSET
	TAssetPtr<UClass>                                                                                    LobbyStateClass;                                   // 0x0264 (0x0018)
	class ALobbyBeaconState*                                                                             LobbyState;                                        // 0x027C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Lobby.LobbyBeaconClient
// 0x0048 (0x02BC)
class ALobbyBeaconClient : public AOnlineBeaconClient
{
public:
	class ALobbyBeaconState*                                                                             LobbyState;                                        // 0x0274 (0x0004)
	class ALobbyBeaconPlayerState*                                                                       PlayerState;                                       // 0x0278 (0x0004)
	uint8_t                                                                                              UnknownData_27C[0x40];                             // 0x027C (0x0040) MISSED OFFSET
public:
	void ServerSetPartyOwner(FUniqueNetIdRepl InUniqueId, FUniqueNetIdRepl InPartyOwnerId); // Function /Script/Lobby.LobbyBeaconClient:ServerSetPartyOwner
	void ServerNotifyJoiningServer(); // Function /Script/Lobby.LobbyBeaconClient:ServerNotifyJoiningServer
	void ServerLoginPlayer(FString InSessionId, FUniqueNetIdRepl InUniqueId, FString UrlString); // Function /Script/Lobby.LobbyBeaconClient:ServerLoginPlayer
	void ServerKickPlayer(FUniqueNetIdRepl PlayerToKick, FText Reason); // Function /Script/Lobby.LobbyBeaconClient:ServerKickPlayer
	void ServerDisconnectFromLobby(); // Function /Script/Lobby.LobbyBeaconClient:ServerDisconnectFromLobby
	void ServerCheat(FString Msg); // Function /Script/Lobby.LobbyBeaconClient:ServerCheat
	void ClientWasKicked(FText KickReason); // Function /Script/Lobby.LobbyBeaconClient:ClientWasKicked
	void ClientSetInviteFlags(FJoinabilitySettings Settings); // Function /Script/Lobby.LobbyBeaconClient:ClientSetInviteFlags
	void ClientPlayerLeft(FUniqueNetIdRepl InUniqueId); // Function /Script/Lobby.LobbyBeaconClient:ClientPlayerLeft
	void ClientPlayerJoined(FText NewPlayerName, FUniqueNetIdRepl InUniqueId); // Function /Script/Lobby.LobbyBeaconClient:ClientPlayerJoined
	void ClientLoginComplete(FUniqueNetIdRepl InUniqueId, bool bWasSuccessful); // Function /Script/Lobby.LobbyBeaconClient:ClientLoginComplete
	void ClientJoinGame(); // Function /Script/Lobby.LobbyBeaconClient:ClientJoinGame
	void ClientAckJoiningServer(); // Function /Script/Lobby.LobbyBeaconClient:ClientAckJoiningServer
public:
	static class UClass* StaticClass();
};

// Class /Script/Lobby.LobbyBeaconPlayerState
// 0x005C (0x029C)
class ALobbyBeaconPlayerState : public AInfo
{
public:
	FText                                                                                                DisplayName;                                       // 0x0240 (0x000C)
	FUniqueNetIdRepl                                                                                     UniqueId;                                          // 0x024C (0x0008)
	FUniqueNetIdRepl                                                                                     PartyOwnerUniqueId;                                // 0x0254 (0x0008)
	bool                                                                                                 bInLobby;                                          // 0x025C (0x0001)
	uint8_t                                                                                              UnknownData_25D[0x3];                              // 0x025D (0x0003) MISSED OFFSET
	class AOnlineBeaconClient*                                                                           ClientActor;                                       // 0x0260 (0x0004)
	uint8_t                                                                                              UnknownData_264[0x38];                             // 0x0264 (0x0038) MISSED OFFSET
public:
	void OnRep_PartyOwner(); // Function /Script/Lobby.LobbyBeaconPlayerState:OnRep_PartyOwner
	void OnRep_InLobby(); // Function /Script/Lobby.LobbyBeaconPlayerState:OnRep_InLobby
public:
	static class UClass* StaticClass();
};

// Class /Script/Lobby.LobbyBeaconState
// 0x011C (0x035C)
class ALobbyBeaconState : public AInfo
{
public:
	int32_t                                                                                              MaxPlayers;                                        // 0x0240 (0x0004)
	class UClass*                                                                                        LobbyBeaconPlayerStateClass;                       // 0x0244 (0x0004)
	uint8_t                                                                                              UnknownData_248[0x8];                              // 0x0248 (0x0008) MISSED OFFSET
	bool                                                                                                 bLobbyStarted;                                     // 0x0250 (0x0001)
	uint8_t                                                                                              UnknownData_251[0x3];                              // 0x0251 (0x0003) MISSED OFFSET
	float                                                                                                WaitForPlayersTimeRemaining;                       // 0x0254 (0x0004)
	FLobbyPlayerStateInfoArray                                                                           Players;                                           // 0x0258 (0x0090)
	uint8_t                                                                                              UnknownData_2E8[0x74];                             // 0x02E8 (0x0074) MISSED OFFSET
public:
	void OnRep_WaitForPlayersTimeRemaining(); // Function /Script/Lobby.LobbyBeaconState:OnRep_WaitForPlayersTimeRemaining
	void OnRep_LobbyStarted(); // Function /Script/Lobby.LobbyBeaconState:OnRep_LobbyStarted
public:
	static class UClass* StaticClass();
};

