#pragma once
#include "FN_Basic.h"

#include "FN_Landscape_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Landscape
*/

// ScriptStruct /Script/Landscape.GrassVariety
// 0x0020 (0x0020)
struct FGrassVariety
{
	class UStaticMesh*                                                                                   GrassMesh;                                         // 0x0000 (0x0004)
	float                                                                                                GrassDensity;                                      // 0x0004 (0x0004)
	bool                                                                                                 bUseGrid;                                          // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	float                                                                                                PlacementJitter;                                   // 0x000C (0x0004)
	int32_t                                                                                              StartCullDistance;                                 // 0x0010 (0x0004)
	int32_t                                                                                              EndCullDistance;                                   // 0x0014 (0x0004)
	int32_t                                                                                              MinLOD;                                            // 0x0018 (0x0004)
	bool                                                                                                 RandomRotation;                                    // 0x001C (0x0001)
	bool                                                                                                 AlignToSurface;                                    // 0x001D (0x0001)
	uint8_t                                                                                              UnknownData_1E[0x2];                               // 0x001E (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.WeightmapLayerAllocationInfo
// 0x0008 (0x0008)
struct FWeightmapLayerAllocationInfo
{
	class ULandscapeLayerInfoObject*                                                                     LayerInfo;                                         // 0x0000 (0x0004)
	uint8_t                                                                                              WeightmapTextureIndex;                             // 0x0004 (0x0001)
	uint8_t                                                                                              WeightmapTextureChannel;                           // 0x0005 (0x0001)
	uint8_t                                                                                              GrassMapChannelIndex;                              // 0x0006 (0x0001)
	uint8_t                                                                                              UnknownData_7[0x1];                                // 0x0007 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.GizmoSelectData
// 0x003C (0x003C)
struct FGizmoSelectData
{
	uint8_t                                                                                              UnknownData_0[0x3C];                               // 0x0000 (0x003C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeInfoLayerSettings
// 0x000C (0x000C)
struct FLandscapeInfoLayerSettings
{
	class ULandscapeLayerInfoObject*                                                                     LayerInfoObj;                                      // 0x0000 (0x0004)
	FName                                                                                                LayerName;                                         // 0x0004 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeImportLayerInfo
// 0x0001 (0x0001)
struct FLandscapeImportLayerInfo
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeLayerStruct
// 0x0004 (0x0004)
struct FLandscapeLayerStruct
{
	class ULandscapeLayerInfoObject*                                                                     LayerInfoObj;                                      // 0x0000 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeEditorLayerSettings
// 0x0001 (0x0001)
struct FLandscapeEditorLayerSettings
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeWeightmapUsage
// 0x0010 (0x0010)
struct FLandscapeWeightmapUsage
{
	class ULandscapeComponent*                                                                           ChannelUsage[4];                                   // 0x0000 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeSplineMeshEntry
// 0x0030 (0x0030)
struct FLandscapeSplineMeshEntry
{
	class UStaticMesh*                                                                                   Mesh;                                              // 0x0000 (0x0004)
	TArray<class UMaterialInterface*>                                                                    MaterialOverrides;                                 // 0x0004 (0x000C)
	uint8_t                                                                                              bCenterH : 1;                                      // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	FVector2D                                                                                            CenterAdjust;                                      // 0x0014 (0x0008)
	uint8_t                                                                                              bScaleToWidth : 1;                                 // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET
	FVector                                                                                              Scale;                                             // 0x0020 (0x000C)
	LandscapeSplineMeshOrientation                                                                       Orientation;                                       // 0x002C (0x0001)
	ESplineMeshAxis                                                                                      ForwardAxis;                                       // 0x002D (0x0001)
	ESplineMeshAxis                                                                                      UpAxis;                                            // 0x002E (0x0001)
	uint8_t                                                                                              UnknownData_2F[0x1];                               // 0x002F (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeSplineSegmentConnection
// 0x0010 (0x0010)
struct FLandscapeSplineSegmentConnection
{
	class ULandscapeSplineControlPoint*                                                                  ControlPoint;                                      // 0x0000 (0x0004)
	float                                                                                                TangentLen;                                        // 0x0004 (0x0004)
	FName                                                                                                SocketName;                                        // 0x0008 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeSplineInterpPoint
// 0x0040 (0x0040)
struct FLandscapeSplineInterpPoint
{
	FVector                                                                                              Center;                                            // 0x0000 (0x000C)
	FVector                                                                                              Left;                                              // 0x000C (0x000C)
	FVector                                                                                              Right;                                             // 0x0018 (0x000C)
	FVector                                                                                              FalloffLeft;                                       // 0x0024 (0x000C)
	FVector                                                                                              FalloffRight;                                      // 0x0030 (0x000C)
	float                                                                                                StartEndFalloff;                                   // 0x003C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LandscapeSplineConnection
// 0x0008 (0x0008)
struct FLandscapeSplineConnection
{
	class ULandscapeSplineSegment*                                                                       Segment;                                           // 0x0000 (0x0004)
	uint8_t                                                                                              End : 1;                                           // 0x0004 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.ForeignWorldSplineData
// 0x0001 (0x0001)
struct FForeignWorldSplineData
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.ForeignSplineSegmentData
// 0x0001 (0x0001)
struct FForeignSplineSegmentData
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.ForeignControlPointData
// 0x0001 (0x0001)
struct FForeignControlPointData
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.GrassInput
// 0x0038 (0x0038)
struct FGrassInput
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	class ULandscapeGrassType*                                                                           GrassType;                                         // 0x0008 (0x0004)
	FExpressionInput                                                                                     Input;                                             // 0x000C (0x002C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Landscape.LayerBlendInput
// 0x0078 (0x0078)
struct FLayerBlendInput
{
	FName                                                                                                LayerName;                                         // 0x0000 (0x0008)
	ELandscapeLayerBlendType                                                                             BlendType;                                         // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET
	FExpressionInput                                                                                     LayerInput;                                        // 0x000C (0x002C)
	FExpressionInput                                                                                     HeightInput;                                       // 0x0038 (0x002C)
	float                                                                                                PreviewWeight;                                     // 0x0064 (0x0004)
	FVector                                                                                              ConstLayerInput;                                   // 0x0068 (0x000C)
	float                                                                                                ConstHeightInput;                                  // 0x0074 (0x0004)

	static class UScriptStruct* StaticStruct();
};

