#pragma once
#include "FN_Basic.h"

#include "FN_LoginScreen_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LoginScreen
*/

// WidgetBlueprintGeneratedClass /Game/UI/Master_Layouts/LoginScreen.LoginScreen_C
// 0x002C (0x0294)
class ULoginScreen_C : public UFortUIStateWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0268 (0x0004)
	class UWidgetAnimation*                                                                              QuitButtonEnter;                                   // 0x026C (0x0004)
	class UWidgetAnimation*                                                                              LoginWindowFade_In;                                // 0x0270 (0x0004)
	class ULoginWindow_C*                                                                                LoginWindow_C_1;                                   // 0x0274 (0x0004)
	class UTopLevel_TabControls_C*                                                                       TopLevel_TabControls;                              // 0x0278 (0x0004)
	class UFortUIStateWidget*                                                                            PreviousState;                                     // 0x027C (0x0004)
	class USoundBase*                                                                                    Sound_Login_Clicked;                               // 0x0280 (0x0004)
	class USoundBase*                                                                                    Sound_Login_Failed;                                // 0x0284 (0x0004)
	class USoundBase*                                                                                    Sound_Login_Music;                                 // 0x0288 (0x0004)
	class USoundBase*                                                                                    Sound_Login_Quit;                                  // 0x028C (0x0004)
	class AFort_Entry_Music_Controller_BP_C*                                                             FrontEnd_Music_Controller;                         // 0x0290 (0x0004)
public:
	void OnEnterState(EFortUIState PreviousUIState); // Function /Game/UI/Master_Layouts/LoginScreen.LoginScreen_C:OnEnterState
	void Construct(); // Function /Game/UI/Master_Layouts/LoginScreen.LoginScreen_C:Construct
	void OnExitState(EFortUIState NextUIState); // Function /Game/UI/Master_Layouts/LoginScreen.LoginScreen_C:OnExitState
	void ExecuteUbergraph_LoginScreen(int32_t EntryPoint); // Function /Game/UI/Master_Layouts/LoginScreen.LoginScreen_C:ExecuteUbergraph_LoginScreen
public:
	static class UClass* StaticClass();
};

