#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LevelSequence
*/

// ScriptStruct /Script/LevelSequence.LevelSequenceObject
// 0x0030 (0x0030)
struct FLevelSequenceObject
{
	TLazyObjectPtr<class UObject>                                                                        ObjectOrOwner;                                     // 0x0000 (0x001C)
	FString                                                                                              ComponentName;                                     // 0x001C (0x000C)
	TWeakObjectPtr<class UObject>                                                                        CachedComponent;                                   // 0x0028 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/LevelSequence.LevelSequenceObjectReferenceMap
// 0x003C (0x003C)
struct FLevelSequenceObjectReferenceMap
{
	uint8_t                                                                                              UnknownData_0[0x3C];                               // 0x0000 (0x003C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/LevelSequence.LevelSequenceObjectReference
// 0x001C (0x001C)
struct FLevelSequenceObjectReference
{
	uint8_t                                                                                              UnknownData_0[0x1C];                               // 0x0000 (0x001C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/LevelSequence.LevelSequencePlaybackSettings
// 0x0008 (0x0008)
struct FLevelSequencePlaybackSettings
{
	int32_t                                                                                              LoopCount;                                         // 0x0000 (0x0004)
	float                                                                                                PlayRate;                                          // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

