#pragma once
#include "FN_Basic.h"

#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Lobby
*/

// ScriptStruct /Script/Lobby.LobbyPlayerStateActorInfo
// 0x0004 (0x0010)
struct FLobbyPlayerStateActorInfo : public FFastArraySerializerItem
{
	class ALobbyBeaconPlayerState*                                                                       LobbyPlayerState;                                  // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Lobby.LobbyPlayerStateInfoArray
// 0x0010 (0x0090)
struct FLobbyPlayerStateInfoArray : public FFastArraySerializer
{
	TArray<FLobbyPlayerStateActorInfo>                                                                   Players;                                           // 0x0080 (0x000C)
	class ALobbyBeaconState*                                                                             ParentState;                                       // 0x008C (0x0004)

	static class UScriptStruct* StaticStruct();
};

