#pragma once
#include "FN_Basic.h"

#include "FN_Landscape_enums.h"
#include "FN_Landscape_structs.h"
#include "FN_Landscape_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Landscape
*/

// Class /Script/Landscape.ControlPointMeshComponent
// 0x0000 (0x0520)
class UControlPointMeshComponent : public UStaticMeshComponent
{
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeGrassType
// 0x0024 (0x0040)
class ULandscapeGrassType : public UObject
{
public:
	TArray<FGrassVariety>                                                                                GrassVarieties;                                    // 0x001C (0x000C)
	class UStaticMesh*                                                                                   GrassMesh;                                         // 0x0028 (0x0004)
	float                                                                                                GrassDensity;                                      // 0x002C (0x0004)
	float                                                                                                PlacementJitter;                                   // 0x0030 (0x0004)
	int32_t                                                                                              StartCullDistance;                                 // 0x0034 (0x0004)
	int32_t                                                                                              EndCullDistance;                                   // 0x0038 (0x0004)
	bool                                                                                                 RandomRotation;                                    // 0x003C (0x0001)
	bool                                                                                                 AlignToSurface;                                    // 0x003D (0x0001)
	uint8_t                                                                                              UnknownData_3E[0x2];                               // 0x003E (0x0002) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeComponent
// 0x0120 (0x0550)
class ULandscapeComponent : public UPrimitiveComponent
{
public:
	int32_t                                                                                              SectionBaseX;                                      // 0x042C (0x0004)
	int32_t                                                                                              SectionBaseY;                                      // 0x0430 (0x0004)
	int32_t                                                                                              ComponentSizeQuads;                                // 0x0434 (0x0004)
	int32_t                                                                                              SubsectionSizeQuads;                               // 0x0438 (0x0004)
	int32_t                                                                                              NumSubsections;                                    // 0x043C (0x0004)
	class UMaterialInterface*                                                                            OverrideMaterial;                                  // 0x0440 (0x0004)
	class UMaterialInterface*                                                                            OverrideHoleMaterial;                              // 0x0444 (0x0004)
	class UMaterialInstanceConstant*                                                                     MaterialInstance;                                  // 0x0448 (0x0004)
	TArray<FWeightmapLayerAllocationInfo>                                                                WeightmapLayerAllocations;                         // 0x044C (0x000C)
	TArray<class UTexture2D*>                                                                            WeightmapTextures;                                 // 0x0458 (0x000C)
	class UTexture2D*                                                                                    XYOffsetmapTexture;                                // 0x0464 (0x0004)
	uint8_t                                                                                              UnknownData_468[0x8];                              // 0x0468 (0x0008) MISSED OFFSET
	FVector4                                                                                             WeightmapScaleBias;                                // 0x0470 (0x0010)
	float                                                                                                WeightmapSubsectionOffset;                         // 0x0480 (0x0004)
	uint8_t                                                                                              UnknownData_484[0xC];                              // 0x0484 (0x000C) MISSED OFFSET
	FVector4                                                                                             HeightmapScaleBias;                                // 0x0490 (0x0010)
	class UTexture2D*                                                                                    HeightmapTexture;                                  // 0x04A0 (0x0004)
	FBox                                                                                                 CachedLocalBox;                                    // 0x04A4 (0x001C)
	TLazyObjectPtr<class ULandscapeHeightfieldCollisionComponent>                                        CollisionComponent;                                // 0x04C0 (0x001C)
	TArray<FGuid>                                                                                        IrrelevantLights;                                  // 0x04DC (0x000C)
	uint8_t                                                                                              UnknownData_4E8[0x8];                              // 0x04E8 (0x0008) MISSED OFFSET
	int32_t                                                                                              CollisionMipLevel;                                 // 0x04F0 (0x0004)
	float                                                                                                StaticLightingResolution;                          // 0x04F4 (0x0004)
	int32_t                                                                                              ForcedLOD;                                         // 0x04F8 (0x0004)
	int32_t                                                                                              LODBias;                                           // 0x04FC (0x0004)
	FGuid                                                                                                StateId;                                           // 0x0500 (0x0010)
	FGuid                                                                                                BakedTextureMaterialGuid;                          // 0x0510 (0x0010)
	class UTexture2D*                                                                                    GIBakedBaseColorTexture;                           // 0x0520 (0x0004)
	uint8_t                                                                                              MobileBlendableLayerMask;                          // 0x0524 (0x0001)
	uint8_t                                                                                              UnknownData_525[0x3];                              // 0x0525 (0x0003) MISSED OFFSET
	class UMaterialInterface*                                                                            MobileMaterialInterface;                           // 0x0528 (0x0004)
	class UTexture2D*                                                                                    MobileWeightNormalmapTexture;                      // 0x052C (0x0004)
	uint8_t                                                                                              UnknownData_530[0x20];                             // 0x0530 (0x0020) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeGizmoActor
// 0x0000 (0x0240)
class ALandscapeGizmoActor : public AActor
{
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeGizmoActiveActor
// 0x003C (0x027C)
class ALandscapeGizmoActiveActor : public ALandscapeGizmoActor
{
public:
	uint8_t                                                                                              UnknownData_240[0x3C];                             // 0x0240 (0x003C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeGizmoRenderComponent
// 0x0000 (0x0430)
class ULandscapeGizmoRenderComponent : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeHeightfieldCollisionComponent
// 0x00C0 (0x04F0)
class ULandscapeHeightfieldCollisionComponent : public UPrimitiveComponent
{
public:
	TArray<class ULandscapeLayerInfoObject*>                                                             ComponentLayerInfos;                               // 0x042C (0x000C)
	int32_t                                                                                              SectionBaseX;                                      // 0x0438 (0x0004)
	int32_t                                                                                              SectionBaseY;                                      // 0x043C (0x0004)
	int32_t                                                                                              CollisionSizeQuads;                                // 0x0440 (0x0004)
	float                                                                                                CollisionScale;                                    // 0x0444 (0x0004)
	TArray<uint8_t>                                                                                      CollisionQuadFlags;                                // 0x0448 (0x000C)
	FGuid                                                                                                HeightfieldGuid;                                   // 0x0454 (0x0010)
	FBox                                                                                                 CachedLocalBox;                                    // 0x0464 (0x001C)
	TLazyObjectPtr<class ULandscapeComponent>                                                            RenderComponent;                                   // 0x0480 (0x001C)
	uint8_t                                                                                              UnknownData_49C[0xC];                              // 0x049C (0x000C) MISSED OFFSET
	TArray<class UPhysicalMaterial*>                                                                     CookedPhysicalMaterials;                           // 0x04A8 (0x000C)
	uint8_t                                                                                              UnknownData_4B4[0x3C];                             // 0x04B4 (0x003C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeMeshCollisionComponent
// 0x0010 (0x0500)
class ULandscapeMeshCollisionComponent : public ULandscapeHeightfieldCollisionComponent
{
public:
	FGuid                                                                                                MeshGuid;                                          // 0x04E8 (0x0010)
	uint8_t                                                                                              UnknownData_4F8[0x8];                              // 0x04F8 (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeInfo
// 0x0178 (0x0194)
class ULandscapeInfo : public UObject
{
public:
	TLazyObjectPtr<class ALandscape>                                                                     LandscapeActor;                                    // 0x001C (0x001C)
	FGuid                                                                                                LandscapeGuid;                                     // 0x0038 (0x0010)
	int32_t                                                                                              ComponentSizeQuads;                                // 0x0048 (0x0004)
	int32_t                                                                                              SubsectionSizeQuads;                               // 0x004C (0x0004)
	int32_t                                                                                              ComponentNumSubsections;                           // 0x0050 (0x0004)
	FVector                                                                                              DrawScale;                                         // 0x0054 (0x000C)
	uint8_t                                                                                              UnknownData_60[0x134];                             // 0x0060 (0x0134) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeInfoMap
// 0x003C (0x0058)
class ULandscapeInfoMap : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x3C];                              // 0x001C (0x003C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeLayerInfoObject
// 0x0020 (0x003C)
class ULandscapeLayerInfoObject : public UObject
{
public:
	FName                                                                                                LayerName;                                         // 0x001C (0x0008)
	class UPhysicalMaterial*                                                                             PhysMaterial;                                      // 0x0024 (0x0004)
	float                                                                                                Hardness;                                          // 0x0028 (0x0004)
	FLinearColor                                                                                         LayerUsageDebugColor;                              // 0x002C (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeMaterialInstanceConstant
// 0x000C (0x0114)
class ULandscapeMaterialInstanceConstant : public UMaterialInstanceConstant
{
public:
	uint8_t                                                                                              bIsLayerThumbnail : 1;                             // 0x0108 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_109[0x3];                              // 0x0109 (0x0003) MISSED OFFSET
	int32_t                                                                                              DataWeightmapIndex;                                // 0x010C (0x0004)
	int32_t                                                                                              DataWeightmapSize;                                 // 0x0110 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeMeshProxyActor
// 0x0004 (0x0244)
class ALandscapeMeshProxyActor : public AActor
{
public:
	class ULandscapeMeshProxyComponent*                                                                  LandscapeMeshProxyComponent;                       // 0x0240 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeMeshProxyComponent
// 0x0020 (0x0540)
class ULandscapeMeshProxyComponent : public UStaticMeshComponent
{
public:
	FGuid                                                                                                LandscapeGuid;                                     // 0x0514 (0x0010)
	TArray<FIntPoint>                                                                                    ProxyComponentBases;                               // 0x0524 (0x000C)
	int8_t                                                                                               ProxyLOD;                                          // 0x0530 (0x0001)
	uint8_t                                                                                              UnknownData_531[0xF];                              // 0x0531 (0x000F) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeProxy
// 0x02A4 (0x04E4)
class ALandscapeProxy : public AActor
{
public:
	uint8_t                                                                                              UnknownData_240[0x4];                              // 0x0240 (0x0004) MISSED OFFSET
	class ULandscapeSplinesComponent*                                                                    SplineComponent;                                   // 0x0244 (0x0004)
	FGuid                                                                                                LandscapeGuid;                                     // 0x0248 (0x0010)
	FIntPoint                                                                                            LandscapeSectionOffset;                            // 0x0258 (0x0008)
	int32_t                                                                                              MaxLODLevel;                                       // 0x0260 (0x0004)
	int32_t                                                                                              StaticLightingLOD;                                 // 0x0264 (0x0004)
	class UPhysicalMaterial*                                                                             DefaultPhysMaterial;                               // 0x0268 (0x0004)
	float                                                                                                StreamingDistanceMultiplier;                       // 0x026C (0x0004)
	class UMaterialInterface*                                                                            LandscapeMaterial;                                 // 0x0270 (0x0004)
	class UMaterialInterface*                                                                            LandscapeHoleMaterial;                             // 0x0274 (0x0004)
	float                                                                                                LODDistanceFactor;                                 // 0x0278 (0x0004)
	TArray<class ULandscapeComponent*>                                                                   LandscapeComponents;                               // 0x027C (0x000C)
	TArray<class ULandscapeHeightfieldCollisionComponent*>                                               CollisionComponents;                               // 0x0288 (0x000C)
	TArray<class UHierarchicalInstancedStaticMeshComponent*>                                             FoliageComponents;                                 // 0x0294 (0x000C)
	uint8_t                                                                                              UnknownData_2A0[0x48];                             // 0x02A0 (0x0048) MISSED OFFSET
	float                                                                                                StaticLightingResolution;                          // 0x02E8 (0x0004)
	TLazyObjectPtr<class ALandscape>                                                                     LandscapeActor;                                    // 0x02EC (0x001C)
	uint8_t                                                                                              bCastStaticShadow : 1;                             // 0x0308 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bCastShadowAsTwoSided : 1;                         // 0x0308 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bCastFarShadow : 1;                                // 0x0308 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bIsProxy : 1;                                      // 0x0308 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_309[0x3];                              // 0x0309 (0x0003) MISSED OFFSET
	FLightmassPrimitiveSettings                                                                          LightmassSettings;                                 // 0x030C (0x0018)
	int32_t                                                                                              CollisionMipLevel;                                 // 0x0324 (0x0004)
	float                                                                                                CollisionThickness;                                // 0x0328 (0x0004)
	FBodyInstance                                                                                        BodyInstance;                                      // 0x032C (0x0128)
	bool                                                                                                 bBakeMaterialPositionOffsetIntoCollision;          // 0x0454 (0x0001)
	uint8_t                                                                                              UnknownData_455[0x3];                              // 0x0455 (0x0003) MISSED OFFSET
	int32_t                                                                                              ComponentSizeQuads;                                // 0x0458 (0x0004)
	int32_t                                                                                              SubsectionSizeQuads;                               // 0x045C (0x0004)
	int32_t                                                                                              NumSubsections;                                    // 0x0460 (0x0004)
	uint8_t                                                                                              bUsedForNavigation : 1;                            // 0x0464 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_465[0x3];                              // 0x0465 (0x0003) MISSED OFFSET
	ENavDataGatheringMode                                                                                NavigationGeometryGatheringMode;                   // 0x0468 (0x0001)
	ELandscapeLODFalloff                                                                                 LODFalloff;                                        // 0x0469 (0x0001)
	uint8_t                                                                                              UnknownData_46A[0x7A];                             // 0x046A (0x007A) MISSED OFFSET
public:
	void EditorApplySpline(class USplineComponent* InSplineComponent, float StartWidth, float EndWidth, float StartSideFalloff, float EndSideFalloff, float StartRoll, float EndRoll, int32_t NumSubdivisions, bool bRaiseHeights, bool bLowerHeights, class ULandscapeLayerInfoObject* PaintLayer); // Function /Script/Landscape.LandscapeProxy:EditorApplySpline
	void ChangeLODDistanceFactor(float InLODDistanceFactor); // Function /Script/Landscape.LandscapeProxy:ChangeLODDistanceFactor
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.Landscape
// 0x0000 (0x04E4)
class ALandscape : public ALandscapeProxy
{
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeSplinesComponent
// 0x0020 (0x0450)
class ULandscapeSplinesComponent : public UPrimitiveComponent
{
public:
	TArray<class ULandscapeSplineControlPoint*>                                                          ControlPoints;                                     // 0x042C (0x000C)
	TArray<class ULandscapeSplineSegment*>                                                               Segments;                                          // 0x0438 (0x000C)
	TArray<class UMeshComponent*>                                                                        CookedForeignMeshComponents;                       // 0x0444 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeSplineSegment
// 0x0068 (0x0084)
class ULandscapeSplineSegment : public UObject
{
public:
	FLandscapeSplineSegmentConnection                                                                    Connections[2];                                    // 0x001C (0x0020)
	FInterpCurveVector                                                                                   SplineInfo;                                        // 0x003C (0x0014)
	TArray<FLandscapeSplineInterpPoint>                                                                  Points;                                            // 0x0050 (0x000C)
	FBox                                                                                                 Bounds;                                            // 0x005C (0x001C)
	TArray<class USplineMeshComponent*>                                                                  LocalMeshComponents;                               // 0x0078 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.LandscapeSplineControlPoint
// 0x005C (0x0078)
class ULandscapeSplineControlPoint : public UObject
{
public:
	FVector                                                                                              Location;                                          // 0x001C (0x000C)
	FRotator                                                                                             Rotation;                                          // 0x0028 (0x000C)
	float                                                                                                Width;                                             // 0x0034 (0x0004)
	float                                                                                                SideFalloff;                                       // 0x0038 (0x0004)
	float                                                                                                EndFalloff;                                        // 0x003C (0x0004)
	TArray<FLandscapeSplineConnection>                                                                   ConnectedSegments;                                 // 0x0040 (0x000C)
	TArray<FLandscapeSplineInterpPoint>                                                                  Points;                                            // 0x004C (0x000C)
	FBox                                                                                                 Bounds;                                            // 0x0058 (0x001C)
	class UControlPointMeshComponent*                                                                    LocalMeshComponent;                                // 0x0074 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeGrassOutput
// 0x000C (0x005C)
class UMaterialExpressionLandscapeGrassOutput : public UMaterialExpressionCustomOutput
{
public:
	TArray<FGrassInput>                                                                                  GrassTypes;                                        // 0x0050 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeLayerBlend
// 0x001C (0x006C)
class UMaterialExpressionLandscapeLayerBlend : public UMaterialExpression
{
public:
	TArray<FLayerBlendInput>                                                                             Layers;                                            // 0x0050 (0x000C)
	FGuid                                                                                                ExpressionGUID;                                    // 0x005C (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeLayerCoords
// 0x0014 (0x0064)
class UMaterialExpressionLandscapeLayerCoords : public UMaterialExpression
{
public:
	ETerrainCoordMappingType                                                                             MappingType;                                       // 0x0050 (0x0001)
	ELandscapeCustomizedCoordType                                                                        CustomUVType;                                      // 0x0051 (0x0001)
	uint8_t                                                                                              UnknownData_52[0x2];                               // 0x0052 (0x0002) MISSED OFFSET
	float                                                                                                MappingScale;                                      // 0x0054 (0x0004)
	float                                                                                                MappingRotation;                                   // 0x0058 (0x0004)
	float                                                                                                MappingPanU;                                       // 0x005C (0x0004)
	float                                                                                                MappingPanV;                                       // 0x0060 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeLayerSample
// 0x001C (0x006C)
class UMaterialExpressionLandscapeLayerSample : public UMaterialExpression
{
public:
	FName                                                                                                ParameterName;                                     // 0x0050 (0x0008)
	float                                                                                                PreviewWeight;                                     // 0x0058 (0x0004)
	FGuid                                                                                                ExpressionGUID;                                    // 0x005C (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeLayerSwitch
// 0x0074 (0x00C4)
class UMaterialExpressionLandscapeLayerSwitch : public UMaterialExpression
{
public:
	FExpressionInput                                                                                     LayerUsed;                                         // 0x0050 (0x002C)
	FExpressionInput                                                                                     LayerNotUsed;                                      // 0x007C (0x002C)
	FName                                                                                                ParameterName;                                     // 0x00A8 (0x0008)
	uint8_t                                                                                              PreviewUsed : 1;                                   // 0x00B0 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_B1[0x3];                               // 0x00B1 (0x0003) MISSED OFFSET
	FGuid                                                                                                ExpressionGUID;                                    // 0x00B4 (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeLayerWeight
// 0x0080 (0x00D0)
class UMaterialExpressionLandscapeLayerWeight : public UMaterialExpression
{
public:
	FExpressionInput                                                                                     Base;                                              // 0x0050 (0x002C)
	FExpressionInput                                                                                     Layer;                                             // 0x007C (0x002C)
	FName                                                                                                ParameterName;                                     // 0x00A8 (0x0008)
	float                                                                                                PreviewWeight;                                     // 0x00B0 (0x0004)
	FVector                                                                                              ConstBase;                                         // 0x00B4 (0x000C)
	FGuid                                                                                                ExpressionGUID;                                    // 0x00C0 (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/Landscape.MaterialExpressionLandscapeVisibilityMask
// 0x0010 (0x0060)
class UMaterialExpressionLandscapeVisibilityMask : public UMaterialExpression
{
public:
	FGuid                                                                                                ExpressionGUID;                                    // 0x0050 (0x0010)
public:
	static class UClass* StaticClass();
};

