#pragma once
#include "FN_Basic.h"

#include "FN_LevelSequence_structs.h"
#include "FN_LevelSequence_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_MovieScene_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LevelSequence
*/

// Class /Script/LevelSequence.LevelSequence
// 0x007C (0x0098)
class ULevelSequence : public UMovieSceneSequence
{
public:
	class UMovieScene*                                                                                   MovieScene;                                        // 0x001C (0x0004)
	FLevelSequenceObjectReferenceMap                                                                     ObjectReferences;                                  // 0x0020 (0x003C)
	TMap<FString, FLevelSequenceObject>                                                                  PossessedObjects;                                  // 0x005C (0x003C)
public:
	static class UClass* StaticClass();
};

// Class /Script/LevelSequence.LevelSequencePlayer
// 0x004C (0x0068)
class ULevelSequencePlayer : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x10];                              // 0x001C (0x0010) MISSED OFFSET
	class ULevelSequence*                                                                                LevelSequence;                                     // 0x002C (0x0004)
	bool                                                                                                 bIsPlaying;                                        // 0x0030 (0x0001)
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
	float                                                                                                TimeCursorPosition;                                // 0x0034 (0x0004)
	uint8_t                                                                                              UnknownData_38[0x8];                               // 0x0038 (0x0008) MISSED OFFSET
	FLevelSequencePlaybackSettings                                                                       PlaybackSettings;                                  // 0x0040 (0x0008)
	uint8_t                                                                                              UnknownData_48[0x20];                              // 0x0048 (0x0020) MISSED OFFSET
public:
	void Stop(); // Function /Script/LevelSequence.LevelSequencePlayer:Stop
	void SetPlayRate(float PlayRate); // Function /Script/LevelSequence.LevelSequencePlayer:SetPlayRate
	void SetPlaybackRange(float NewStartTime, float NewEndTime); // Function /Script/LevelSequence.LevelSequencePlayer:SetPlaybackRange
	void SetPlaybackPosition(float NewPlaybackPosition); // Function /Script/LevelSequence.LevelSequencePlayer:SetPlaybackPosition
	void PlayLooping(int32_t NumLoops); // Function /Script/LevelSequence.LevelSequencePlayer:PlayLooping
	void Play(); // Function /Script/LevelSequence.LevelSequencePlayer:Play
	void Pause(); // Function /Script/LevelSequence.LevelSequencePlayer:Pause
	bool IsPlaying() const; // Function /Script/LevelSequence.LevelSequencePlayer:IsPlaying
	float GetPlayRate() const; // Function /Script/LevelSequence.LevelSequencePlayer:GetPlayRate
	float GetPlaybackPosition() const; // Function /Script/LevelSequence.LevelSequencePlayer:GetPlaybackPosition
	float GetLength() const; // Function /Script/LevelSequence.LevelSequencePlayer:GetLength
	static class ULevelSequencePlayer* CreateLevelSequencePlayer(class UObject* WorldContextObject, class ULevelSequence* LevelSequence, FLevelSequencePlaybackSettings Settings); // Function /Script/LevelSequence.LevelSequencePlayer:CreateLevelSequencePlayer
public:
	static class UClass* StaticClass();
};

// Class /Script/LevelSequence.LevelSequenceActor
// 0x001C (0x025C)
class ALevelSequenceActor : public AActor
{
public:
	bool                                                                                                 bAutoPlay;                                         // 0x0240 (0x0001)
	uint8_t                                                                                              UnknownData_241[0x3];                              // 0x0241 (0x0003) MISSED OFFSET
	FLevelSequencePlaybackSettings                                                                       PlaybackSettings;                                  // 0x0244 (0x0008)
	class ULevelSequencePlayer*                                                                          SequencePlayer;                                    // 0x024C (0x0004)
	FStringAssetReference                                                                                LevelSequence;                                     // 0x0250 (0x000C)
public:
	void SetSequence(class ULevelSequence* InSequence); // Function /Script/LevelSequence.LevelSequenceActor:SetSequence
public:
	static class UClass* StaticClass();
};

