#pragma once
#include "FN_Basic.h"

#include "FN_LlamaAnim_BP_parameters.h"
#include "FN_AnimGraphRuntime_enums.h"
#include "FN_AnimGraphRuntime_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LlamaAnim_BP
*/

// AnimBlueprintGeneratedClass /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C
// 0x00DC (0x03EC)
class ULlamaAnim_BP_C : public UAnimInstance
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0310 (0x0004)
	FAnimNode_Root                                                                                       AnimGraphNode_Root_8ADDC02643B32A1F7CC89BB11903C1F2; // 0x0314 (0x002C)
	FAnimNode_Slot                                                                                       AnimGraphNode_Slot_C6CBF2C14D7E2661FA836083EBC21EC6; // 0x0340 (0x0044)
	FAnimNode_SequencePlayer                                                                             AnimGraphNode_SequencePlayer_E380EEC3438D7B982F70B1B965A9BC1B; // 0x0384 (0x0058)
	bool                                                                                                 readyToPop;                                        // 0x03DC (0x0001)
	uint8_t                                                                                              UnknownData_3DD[0x3];                              // 0x03DD (0x0003) MISSED OFFSET
	class AProp_Explorer_OutlanderFragment_Llama_C*                                                      Owning_Llama_Fragment;                             // 0x03E0 (0x0004)
	class UAnimMontage*                                                                                  LlamaMontage;                                      // 0x03E4 (0x0004)
	class UAnimMontage*                                                                                  LlamaMontage1;                                     // 0x03E8 (0x0004)
public:
	void AnimNotify_LlamaDeathAnimationCompleted(); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:AnimNotify_LlamaDeathAnimationCompleted
	void Play_First_Explosion_Animation(); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:Play First Explosion Animation
	void TheHeadProjectileHasSpawned(); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:TheHeadProjectileHasSpawned
	void AnimNotify_LlamasHeadIsReadyToBurst(); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:AnimNotify_LlamasHeadIsReadyToBurst
	void BlueprintInitializeAnimation(); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:BlueprintInitializeAnimation
	void ExecuteUbergraph_LlamaAnim_BP(int32_t EntryPoint); // Function /Game/Animation/Game/Gadgets/Llama/LlamaAnim_BP.LlamaAnim_BP_C:ExecuteUbergraph_LlamaAnim_BP
public:
	static class UClass* StaticClass();
};

