#pragma once
#include "FN_Basic.h"

#include "FN_LightBox_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LightBox
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/LightBox.LightBox_C
// 0x0024 (0x0268)
class ULightBox_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UWidgetAnimation*                                                                              Fade_Out;                                          // 0x0248 (0x0004)
	class UWidgetAnimation*                                                                              Fade_In;                                           // 0x024C (0x0004)
	class UNamedSlot*                                                                                    _Slot_CenterContent;                               // 0x0250 (0x0004)
	bool                                                                                                 DestroyContentPostFadeOut;                         // 0x0254 (0x0001)
	uint8_t                                                                                              UnknownData_255[0x3];                              // 0x0255 (0x0003) MISSED OFFSET
	class UFortActionHandlerPanel*                                                                       ContainedActionHandlerPanel;                       // 0x0258 (0x0004)
	struct FULightBox_C_CenterContentCleared__DelegateSignature                                          CenterContentCleared;                              // 0x025C (0x000C)
public:
	void OnPanelActivated(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:OnPanelActivated
	void EstablishContainedPanel(class UFortActionHandlerPanel* New_Panel); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:EstablishContainedPanel
	void AddActivePanelContent(class UFortActionHandlerPanel* ActionHandlerPanel, EHorizontalAlignment InHorizontal_Alignment, EVerticalAlignment InVertical_Alignment); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:AddActivePanelContent
	void OnPanelDeactivated(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:OnPanelDeactivated
	void Construct(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:Construct
	void Destruct(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:Destruct
	void OnFadeOutComplete(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:OnFadeOutComplete
	void ExecuteUbergraph_LightBox(int32_t EntryPoint); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:ExecuteUbergraph_LightBox
	void CenterContentCleared__DelegateSignature(); // Function /Game/UI/Global_Elements/LightBox.LightBox_C:CenterContentCleared__DelegateSignature
public:
	static class UClass* StaticClass();
};

