#pragma once
#include "FN_Basic.h"

#include "FN_LoginWindow_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_SlateCore_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: LoginWindow
*/

// WidgetBlueprintGeneratedClass /Game/UI/LoginWindow/LoginWindow.LoginWindow_C
// 0x0060 (0x02CC)
class ULoginWindow_C : public UFortLoginWindow
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x026C (0x0004)
	class UWidgetAnimation*                                                                              TestAnimation;                                     // 0x0270 (0x0004)
	class UBasicStrokeBox_C*                                                                             BasicStrokeBox;                                    // 0x0274 (0x0004)
	class UTextBlock*                                                                                    BuildWatermark;                                    // 0x0278 (0x0004)
	class UEditableText*                                                                                 Email;                                             // 0x027C (0x0004)
	class UCanvasPanel*                                                                                  ErrorPanel;                                        // 0x0280 (0x0004)
	class UImage*                                                                                        hr;                                                // 0x0284 (0x0004)
	class UButtonIconText_C*                                                                             Login_Button;                                      // 0x0288 (0x0004)
	class UWidgetSwitcher*                                                                               Login_State_View_Switcher;                         // 0x028C (0x0004)
	class UTextBlock*                                                                                    LoginResultText;                                   // 0x0290 (0x0004)
	class UTextBlock*                                                                                    LoginStatusText;                                   // 0x0294 (0x0004)
	class UImage*                                                                                        Logo;                                              // 0x0298 (0x0004)
	class UEditableText*                                                                                 Password;                                          // 0x029C (0x0004)
	class UCheckBox*                                                                                     RememberCheckbox;                                  // 0x02A0 (0x0004)
	class UTextBlock*                                                                                    RememberLabel;                                     // 0x02A4 (0x0004)
	class UVersionInfo_C*                                                                                VersionInfo;                                       // 0x02A8 (0x0004)
	bool                                                                                                 CanLogin;                                          // 0x02AC (0x0001)
	uint8_t                                                                                              UnknownData_2AD[0x3];                              // 0x02AD (0x0003) MISSED OFFSET
	class USoundBase*                                                                                    Sound_Login_Error;                                 // 0x02B0 (0x0004)
	class USoundBase*                                                                                    Sound_Login_Click;                                 // 0x02B4 (0x0004)
	class USoundBase*                                                                                    Sound_Logging_In;                                  // 0x02B8 (0x0004)
	class USoundBase*                                                                                    Sound_Login_Success;                               // 0x02BC (0x0004)
	TArray<FText>                                                                                        StatusUpdates;                                     // 0x02C0 (0x000C)
public:
	void RunInitialBenchmark(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:RunInitialBenchmark
	void Update_Watermark(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:Update Watermark
	void SetEditingFocus(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:SetEditingFocus
	void Show_Login_Result_Error(FText In_Text); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:Show Login Result Error
	void Set_Login_Permission(bool Login_Enabled); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:Set Login Permission
	void Check_Login_Permission(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:Check Login Permission
	void RequestLogin(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:RequestLogin
	FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnKeyDown
	void OnTimedOut_D5FE647942DB4B7E21D74DBFFFE496C7(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnTimedOut_D5FE647942DB4B7E21D74DBFFFE496C7
	void OnDeclined_D5FE647942DB4B7E21D74DBFFFE496C7(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnDeclined_D5FE647942DB4B7E21D74DBFFFE496C7
	void OnConfirmed_D5FE647942DB4B7E21D74DBFFFE496C7(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnConfirmed_D5FE647942DB4B7E21D74DBFFFE496C7
	void Construct(); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:Construct
	void OnLoginStatusChanged(EUILoginStatus NewStatus, FText InMessage); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnLoginStatusChanged
	void BndEvt__Password_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature(FText TEXT, ETextCommit CommitMethod); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:BndEvt__Password_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature
	void BndEvt__Email_K2Node_ComponentBoundEvent_36_OnEditableTextCommittedEvent__DelegateSignature(FText TEXT, ETextCommit CommitMethod); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:BndEvt__Email_K2Node_ComponentBoundEvent_36_OnEditableTextCommittedEvent__DelegateSignature
	void BndEvt__Email_K2Node_ComponentBoundEvent_54_OnEditableTextChangedEvent__DelegateSignature(FText TEXT); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:BndEvt__Email_K2Node_ComponentBoundEvent_54_OnEditableTextChangedEvent__DelegateSignature
	void BndEvt__Password_K2Node_ComponentBoundEvent_60_OnEditableTextChangedEvent__DelegateSignature(FText TEXT); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:BndEvt__Password_K2Node_ComponentBoundEvent_60_OnEditableTextChangedEvent__DelegateSignature
	void OnQueryFortBackendVersionComplete(FFortBackendVersion FortBackendVersion); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:OnQueryFortBackendVersionComplete
	void BndEvt__Login_Button_K2Node_ComponentBoundEvent_437_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:BndEvt__Login Button_K2Node_ComponentBoundEvent_437_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_LoginWindow(int32_t EntryPoint); // Function /Game/UI/LoginWindow/LoginWindow.LoginWindow_C:ExecuteUbergraph_LoginWindow
public:
	static class UClass* StaticClass();
};

