#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MaterialShaderQualitySettings
*/

// ScriptStruct /Script/MaterialShaderQualitySettings.MaterialQualityOverrides
// 0x0005 (0x0005)
struct FMaterialQualityOverrides
{
	bool                                                                                                 bEnableOverride;                                   // 0x0000 (0x0001)
	bool                                                                                                 bForceFullyRough;                                  // 0x0001 (0x0001)
	bool                                                                                                 bForceNonMetal;                                    // 0x0002 (0x0001)
	bool                                                                                                 bForceDisableLMDirectionality;                     // 0x0003 (0x0001)
	bool                                                                                                 bForceLQReflections;                               // 0x0004 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MaterialShaderQualitySettings.ShaderQualityOverridesListItem
// 0x0014 (0x0014)
struct FShaderQualityOverridesListItem
{
	FString                                                                                              RangeName;                                         // 0x0000 (0x000C)
	class UBoolProperty*                                                                                 QualityProperty;                                   // 0x000C (0x0004)
	class UShaderPlatformQualitySettings*                                                                SettingContainer;                                  // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

