#pragma once
#include "FN_Basic.h"

#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieScene
*/

// Class /Script/MovieScene.MovieScene
// 0x0054 (0x0070)
class UMovieScene : public UObject
{
public:
	TArray<FMovieSceneSpawnable>                                                                         Spawnables;                                        // 0x001C (0x000C)
	TArray<FMovieScenePossessable>                                                                       Possessables;                                      // 0x0028 (0x000C)
	TArray<FMovieSceneBinding>                                                                           ObjectBindings;                                    // 0x0034 (0x000C)
	TArray<class UMovieSceneTrack*>                                                                      MasterTracks;                                      // 0x0040 (0x000C)
	class UMovieSceneTrack*                                                                              ShotTrack;                                         // 0x004C (0x0004)
	FFloatRange                                                                                          PlaybackRange;                                     // 0x0050 (0x0010)
	float                                                                                                InTime;                                            // 0x0060 (0x0004)
	float                                                                                                OutTime;                                           // 0x0064 (0x0004)
	float                                                                                                StartTime;                                         // 0x0068 (0x0004)
	float                                                                                                EndTime;                                           // 0x006C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieScene.MovieSceneSection
// 0x0014 (0x0030)
class UMovieSceneSection : public UObject
{
public:
	float                                                                                                StartTime;                                         // 0x001C (0x0004)
	float                                                                                                EndTime;                                           // 0x0020 (0x0004)
	int32_t                                                                                              RowIndex;                                          // 0x0024 (0x0004)
	int32_t                                                                                              OverlapPriority;                                   // 0x0028 (0x0004)
	uint8_t                                                                                              bIsActive : 1;                                     // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bIsLocked : 1;                                     // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bIsInfinite : 1;                                   // 0x002C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieScene.MovieSceneSequence
// 0x0000 (0x001C)
class UMovieSceneSequence : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieScene.MovieSceneTrack
// 0x0000 (0x001C)
class UMovieSceneTrack : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieScene.MovieSceneNameableTrack
// 0x0000 (0x001C)
class UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	static class UClass* StaticClass();
};

