#pragma once
#include "FN_Basic.h"

#include "FN_MovieScene_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieScene
*/

// ScriptStruct /Script/MovieScene.MovieSceneBinding
// 0x0028 (0x0028)
struct FMovieSceneBinding
{
	FGuid                                                                                                ObjectGuid;                                        // 0x0000 (0x0010)
	FString                                                                                              BindingName;                                       // 0x0010 (0x000C)
	TArray<class UMovieSceneTrack*>                                                                      Tracks;                                            // 0x001C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieScene.MovieScenePossessable
// 0x0030 (0x0030)
struct FMovieScenePossessable
{
	FGuid                                                                                                Guid;                                              // 0x0000 (0x0010)
	FString                                                                                              Name;                                              // 0x0010 (0x000C)
	class UClass*                                                                                        PossessedObjectClass;                              // 0x001C (0x0004)
	FGuid                                                                                                ParentGuid;                                        // 0x0020 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieScene.MovieSceneSpawnable
// 0x0030 (0x0030)
struct FMovieSceneSpawnable
{
	FGuid                                                                                                Guid;                                              // 0x0000 (0x0010)
	FString                                                                                              Name;                                              // 0x0010 (0x000C)
	class UClass*                                                                                        GeneratedClass;                                    // 0x001C (0x0004)
	TArray<FGuid>                                                                                        ChildPossessables;                                 // 0x0020 (0x000C)
	ESpawnOwnership                                                                                      Ownership;                                         // 0x002C (0x0001)
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieScene.MovieSceneTrackLabels
// 0x000C (0x000C)
struct FMovieSceneTrackLabels
{
	TArray<FString>                                                                                      Strings;                                           // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieScene.MovieSceneExpansionState
// 0x0001 (0x0001)
struct FMovieSceneExpansionState
{
	bool                                                                                                 bExpanded;                                         // 0x0000 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieScene.MovieSceneEditorData
// 0x005C (0x005C)
struct FMovieSceneEditorData
{
	TMap<FString, FMovieSceneExpansionState>                                                             ExpansionStates;                                   // 0x0000 (0x003C)
	FFloatRange                                                                                          WorkingRange;                                      // 0x003C (0x0010)
	FFloatRange                                                                                          ViewRange;                                         // 0x004C (0x0010)

	static class UScriptStruct* StaticStruct();
};

