#pragma once
#include "FN_Basic.h"

#include "FN_MovieSceneTracks_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieSceneTracks
*/

// ScriptStruct /Script/MovieSceneTracks.MovieSceneEventSectionKey
// 0x0010 (0x0010)
struct FMovieSceneEventSectionKey
{
	TArray<FName>                                                                                        EventNames;                                        // 0x0000 (0x000C)
	float                                                                                                Time;                                              // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneTracks.ColorParameterNameAndCurves
// 0x015C (0x015C)
struct FColorParameterNameAndCurves
{
	FName                                                                                                ParameterName;                                     // 0x0000 (0x0008)
	int32_t                                                                                              INDEX;                                             // 0x0008 (0x0004)
	FRichCurve                                                                                           RedCurve;                                          // 0x000C (0x0054)
	FRichCurve                                                                                           GreenCurve;                                        // 0x0060 (0x0054)
	FRichCurve                                                                                           BlueCurve;                                         // 0x00B4 (0x0054)
	FRichCurve                                                                                           AlphaCurve;                                        // 0x0108 (0x0054)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneTracks.VectorParameterNameAndCurves
// 0x0108 (0x0108)
struct FVectorParameterNameAndCurves
{
	FName                                                                                                ParameterName;                                     // 0x0000 (0x0008)
	int32_t                                                                                              INDEX;                                             // 0x0008 (0x0004)
	FRichCurve                                                                                           XCurve;                                            // 0x000C (0x0054)
	FRichCurve                                                                                           YCurve;                                            // 0x0060 (0x0054)
	FRichCurve                                                                                           ZCurve;                                            // 0x00B4 (0x0054)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneTracks.ScalarParameterNameAndCurve
// 0x0060 (0x0060)
struct FScalarParameterNameAndCurve
{
	FName                                                                                                ParameterName;                                     // 0x0000 (0x0008)
	int32_t                                                                                              INDEX;                                             // 0x0008 (0x0004)
	FRichCurve                                                                                           ParameterCurve;                                    // 0x000C (0x0054)

	static class UScriptStruct* StaticStruct();
};

