#pragma once
#include "FN_Basic.h"

#include "FN_MediaAssets_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MediaAssets
*/

// Class /Script/MediaAssets.MediaPlayer
// 0x00A4 (0x00C0)
class UMediaPlayer : public UObject
{
public:
	struct FMediaAssets_OnMediaPlayerMediaEvent__DelegateSignature                                       OnEndReached;                                      // 0x001C (0x000C)
	struct FMediaAssets_OnMediaPlayerMediaEvent__DelegateSignature                                       OnMediaClosed;                                     // 0x0028 (0x000C)
	struct FMediaAssets_OnMediaPlayerMediaOpened__DelegateSignature                                      OnMediaOpened;                                     // 0x0034 (0x000C)
	struct FMediaAssets_OnMediaPlayerMediaOpenFailed__DelegateSignature                                  OnMediaOpenFailed;                                 // 0x0040 (0x000C)
	struct FMediaAssets_OnMediaPlayerMediaEvent__DelegateSignature                                       OnPlaybackResumed;                                 // 0x004C (0x000C)
	struct FMediaAssets_OnMediaPlayerMediaEvent__DelegateSignature                                       OnPlaybackSuspended;                               // 0x0058 (0x000C)
	uint8_t                                                                                              Looping : 1;                                       // 0x0064 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_65[0x3];                               // 0x0065 (0x0003) MISSED OFFSET
	FString                                                                                              URL;                                               // 0x0068 (0x000C)
	uint8_t                                                                                              UnknownData_74[0x4C];                              // 0x0074 (0x004C) MISSED OFFSET
public:
	bool SupportsSeeking() const; // Function /Script/MediaAssets.MediaPlayer:SupportsSeeking
	bool SupportsScrubbing() const; // Function /Script/MediaAssets.MediaPlayer:SupportsScrubbing
	bool SupportsRate(float Rate, bool Unthinned) const; // Function /Script/MediaAssets.MediaPlayer:SupportsRate
	bool SetRate(float Rate); // Function /Script/MediaAssets.MediaPlayer:SetRate
	bool SetLooping(bool InLooping); // Function /Script/MediaAssets.MediaPlayer:SetLooping
	bool Seek(FTimespan InTime); // Function /Script/MediaAssets.MediaPlayer:Seek
	bool Rewind(); // Function /Script/MediaAssets.MediaPlayer:Rewind
	bool Play(); // Function /Script/MediaAssets.MediaPlayer:Play
	bool Pause(); // Function /Script/MediaAssets.MediaPlayer:Pause
	bool OpenUrl(FString NewUrl); // Function /Script/MediaAssets.MediaPlayer:OpenUrl
	bool IsReady() const; // Function /Script/MediaAssets.MediaPlayer:IsReady
	bool IsPlaying() const; // Function /Script/MediaAssets.MediaPlayer:IsPlaying
	bool IsPaused() const; // Function /Script/MediaAssets.MediaPlayer:IsPaused
	bool IsLooping() const; // Function /Script/MediaAssets.MediaPlayer:IsLooping
	FString GetUrl() const; // Function /Script/MediaAssets.MediaPlayer:GetUrl
	FTimespan GetTime() const; // Function /Script/MediaAssets.MediaPlayer:GetTime
	float GetRate() const; // Function /Script/MediaAssets.MediaPlayer:GetRate
	FTimespan GetDuration() const; // Function /Script/MediaAssets.MediaPlayer:GetDuration
	void Close(); // Function /Script/MediaAssets.MediaPlayer:Close
	bool CanPlay() const; // Function /Script/MediaAssets.MediaPlayer:CanPlay
	bool CanPause() const; // Function /Script/MediaAssets.MediaPlayer:CanPause
public:
	static class UClass* StaticClass();
};

// Class /Script/MediaAssets.MediaSoundWave
// 0x0030 (0x01D0)
class UMediaSoundWave : public USoundWave
{
public:
	int32_t                                                                                              AudioTrackIndex;                                   // 0x01A0 (0x0004)
	class UMediaPlayer*                                                                                  MediaPlayer;                                       // 0x01A4 (0x0004)
	uint8_t                                                                                              UnknownData_1A8[0x10];                             // 0x01A8 (0x0010) MISSED OFFSET
	TWeakObjectPtr<class UMediaPlayer>                                                                   CurrentMediaPlayer;                                // 0x01B8 (0x0008)
	uint8_t                                                                                              UnknownData_1C0[0x10];                             // 0x01C0 (0x0010) MISSED OFFSET
public:
	void SetMediaPlayer(class UMediaPlayer* InMediaPlayer); // Function /Script/MediaAssets.MediaSoundWave:SetMediaPlayer
public:
	static class UClass* StaticClass();
};

// Class /Script/MediaAssets.MediaTexture
// 0x0044 (0x00A8)
class UMediaTexture : public UTexture
{
public:
	TextureAddress                                                                                       AddressX;                                          // 0x0064 (0x0001)
	TextureAddress                                                                                       AddressY;                                          // 0x0065 (0x0001)
	uint8_t                                                                                              UnknownData_66[0x2];                               // 0x0066 (0x0002) MISSED OFFSET
	FLinearColor                                                                                         ClearColor;                                        // 0x0068 (0x0010)
	int32_t                                                                                              VideoTrackIndex;                                   // 0x0078 (0x0004)
	class UMediaPlayer*                                                                                  MediaPlayer;                                       // 0x007C (0x0004)
	uint8_t                                                                                              UnknownData_80[0x8];                               // 0x0080 (0x0008) MISSED OFFSET
	TWeakObjectPtr<class UMediaPlayer>                                                                   CurrentMediaPlayer;                                // 0x0088 (0x0008)
	uint8_t                                                                                              UnknownData_90[0x18];                              // 0x0090 (0x0018) MISSED OFFSET
public:
	void SetMediaPlayer(class UMediaPlayer* InMediaPlayer); // Function /Script/MediaAssets.MediaTexture:SetMediaPlayer
public:
	static class UClass* StaticClass();
};

