#pragma once
#include "FN_Basic.h"

#include "FN_MyFort_Manager_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_MyTown_BuildingGroups_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MyFort_Manager
*/

// BlueprintGeneratedClass /Game/MyFort/MyFort_Manager.MyFort_Manager_C
// 0x00A8 (0x0398)
class AMyFort_Manager_C : public AMyTownActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x02F0 (0x0004)
	class UBillboardComponent*                                                                           Root;                                              // 0x02F4 (0x0004)
	TArray<FTransform>                                                                                   SlotCoordinates;                                   // 0x02F8 (0x000C)
	TArray<FMyTown_BuildingGroups>                                                                       BuildingListStruct;                                // 0x0304 (0x000C)
	int32_t                                                                                              numBuildings;                                      // 0x0310 (0x0004)
	TArray<class AMyTownBuildingActor*>                                                                  BuildingGroups;                                    // 0x0314 (0x000C)
	bool                                                                                                 HideBuilding;                                      // 0x0320 (0x0001)
	bool                                                                                                 Start_Hidden;                                      // 0x0321 (0x0001)
	uint8_t                                                                                              UnknownData_322[0x2];                              // 0x0322 (0x0002) MISSED OFFSET
	TArray<class UStaticMeshComponent*>                                                                  BaseMeshArray;                                     // 0x0324 (0x000C)
	FName                                                                                                MaterialBannerParam;                               // 0x0330 (0x0008)
	TArray<class AActor*>                                                                                BuildingPlacement;                                 // 0x0338 (0x000C)
	class AHB_RoadManager_C*                                                                             RoadManager;                                       // 0x0344 (0x0004)
	TArray<class UMaterialInstanceDynamic*>                                                              BuildingMID;                                       // 0x0348 (0x000C)
	class UMaterialInterface*                                                                            UnbuiltOldMaterial;                                // 0x0354 (0x0004)
	FVector                                                                                              SphereCollisionScale;                              // 0x0358 (0x000C)
	FString                                                                                              OpenedMenuString;                                  // 0x0364 (0x000C)
	bool                                                                                                 PanelOpened;                                       // 0x0370 (0x0001)
	uint8_t                                                                                              UnknownData_371[0x3];                              // 0x0371 (0x0003) MISSED OFFSET
	FString                                                                                              OpenedSavedBuildingTemplate;                       // 0x0374 (0x000C)
	bool                                                                                                 PanelIsOpen;                                       // 0x0380 (0x0001)
	uint8_t                                                                                              UnknownData_381[0x3];                              // 0x0381 (0x0003) MISSED OFFSET
	class AMyTownBuildingActor*                                                                          OpenSavedBuilding;                                 // 0x0384 (0x0004)
	class AMyTown_Building_Master_C*                                                                     MyTown_Building_Master;                            // 0x0388 (0x0004)
	class AS_HB_OnboardingCloudCover_C*                                                                  CloudCover;                                        // 0x038C (0x0004)
	bool                                                                                                 bTutorialVisualsInitialized;                       // 0x0390 (0x0001)
	uint8_t                                                                                              UnknownData_391[0x3];                              // 0x0391 (0x0003) MISSED OFFSET
	class UTexture2D*                                                                                    UITextures;                                        // 0x0394 (0x0004)
public:
	void ShouldCreateBuilding(class UMyTownBuildingDefinitionData* Building_Definition, bool Allow_Create); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:ShouldCreateBuilding
	void MouseOverBuildingState(int32_t Building_ID, class AMyTownBuildingActor* Building, class USphereComponent* CollisionComponent, class UStaticMeshComponent* Building_Mesh); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:MouseOverBuildingState
	bool FindBuildingID(FString A, class AMyTownBuildingActor* Item); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:FindBuildingID
	void SmallWorldCollision(FVector InitialBuildingLocation, FVector CameraLocation, class USphereComponent* Collision, float DistanceOffset); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:SmallWorldCollision
	void UpdateRoads(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:UpdateRoads
	void SaveBuildingPosition(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:SaveBuildingPosition
	void Initialize_Array(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:Initialize Array
	void UserConstructionScript(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:UserConstructionScript
	void OnMyTownBuildingWorkersChanged_Event_0_Copy(FString BuildingTemplateId); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:OnMyTownBuildingWorkersChanged_Event_0_Copy
	void ChangeWorker(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:ChangeWorker
	void HandleClientEvent_OnboardingInitializeVisuals(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:HandleClientEvent_OnboardingInitializeVisuals
	void ReceiveBeginPlay(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:ReceiveBeginPlay
	void OnMyTownInitialized_Event(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:OnMyTownInitialized_Event
	void OnMyTownBannerColorChanged_Event(FLinearColor NewColor); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:OnMyTownBannerColorChanged_Event
	void SpawnBuildings(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:SpawnBuildings
	void FindNumberofBuildings(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:FindNumberofBuildings
	void PositioningActors(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:PositioningActors
	void BannerColors(); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:BannerColors
	void ExecuteUbergraph_MyFort_Manager(int32_t EntryPoint); // Function /Game/MyFort/MyFort_Manager.MyFort_Manager_C:ExecuteUbergraph_MyFort_Manager
public:
	static class UClass* StaticClass();
};

