#pragma once
#include "FN_Basic.h"

#include "FN_MusicManager_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MusicManager
*/

// BlueprintGeneratedClass /Game/Blueprints/MusicManager.MusicManager_C
// 0x0068 (0x02CC)
class AMusicManager_C : public AFortMusicManager
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0264 (0x0004)
	class USoundBase*                                                                                    Music_Frontend;                                    // 0x0268 (0x0004)
	class USoundBase*                                                                                    Music_Lobby;                                       // 0x026C (0x0004)
	class USoundBase*                                                                                    MusicDay;                                          // 0x0270 (0x0004)
	class USoundBase*                                                                                    MusicEvening;                                      // 0x0274 (0x0004)
	class USoundBase*                                                                                    MusicNight;                                        // 0x0278 (0x0004)
	class USoundBase*                                                                                    MusicMorning;                                      // 0x027C (0x0004)
	class USoundBase*                                                                                    StingerMorning;                                    // 0x0280 (0x0004)
	class USoundBase*                                                                                    StingerEvening;                                    // 0x0284 (0x0004)
	class USoundBase*                                                                                    StingerNight;                                      // 0x0288 (0x0004)
	EFortDayPhase                                                                                        CurrentDayPhase;                                   // 0x028C (0x0001)
	uint8_t                                                                                              UnknownData_28D[0x3];                              // 0x028D (0x0003) MISSED OFFSET
	class USoundBase*                                                                                    Smasher_Music;                                     // 0x0290 (0x0004)
	class USoundBase*                                                                                    Smasher_Stinger;                                   // 0x0294 (0x0004)
	class USoundBase*                                                                                    Husk_Music;                                        // 0x0298 (0x0004)
	class USoundBase*                                                                                    Husk_Stinger;                                      // 0x029C (0x0004)
	class USoundBase*                                                                                    Husk_Low_Music;                                    // 0x02A0 (0x0004)
	class USoundBase*                                                                                    Husk_Low_Stinger;                                  // 0x02A4 (0x0004)
	bool                                                                                                 bIsPlayingDefaultMusic;                            // 0x02A8 (0x0001)
	bool                                                                                                 bIsPlayingHuskMusic;                               // 0x02A9 (0x0001)
	bool                                                                                                 bIsPlayingSmasherMusic;                            // 0x02AA (0x0001)
	bool                                                                                                 bIsPlayingTakerMusic;                              // 0x02AB (0x0001)
	FName                                                                                                CurrentGameMode;                                   // 0x02AC (0x0008)
	FName                                                                                                GameMode_Lobby;                                    // 0x02B4 (0x0008)
	FName                                                                                                GameMode_Frontend;                                 // 0x02BC (0x0008)
	FName                                                                                                GameMode_InGame;                                   // 0x02C4 (0x0008)
public:
	void ResetMusicBools(); // Function /Game/Blueprints/MusicManager.MusicManager_C:ResetMusicBools
	void UserConstructionScript(); // Function /Game/Blueprints/MusicManager.MusicManager_C:UserConstructionScript
	void OnDayPhaseChanged(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation); // Function /Game/Blueprints/MusicManager.MusicManager_C:OnDayPhaseChanged
	void OnUpdateMusic(); // Function /Game/Blueprints/MusicManager.MusicManager_C:OnUpdateMusic
	void PlayDefaultMusic(); // Function /Game/Blueprints/MusicManager.MusicManager_C:PlayDefaultMusic
	void ReceiveBeginPlay(); // Function /Game/Blueprints/MusicManager.MusicManager_C:ReceiveBeginPlay
	void ExecuteUbergraph_MusicManager(int32_t EntryPoint); // Function /Game/Blueprints/MusicManager.MusicManager_C:ExecuteUbergraph_MusicManager
public:
	static class UClass* StaticClass();
};

