#pragma once
#include "FN_Basic.h"

#include "FN_MovieSceneCapture_structs.h"
#include "FN_MovieSceneCapture_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieSceneCapture
*/

// Class /Script/MovieSceneCapture.CompositionGraphCaptureSettings
// 0x001C (0x0038)
class UCompositionGraphCaptureSettings : public UObject
{
public:
	FCompositionGraphCapturePasses                                                                       IncludeRenderPasses;                               // 0x001C (0x000C)
	bool                                                                                                 bCaptureFramesInHDR;                               // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	FStringAssetReference                                                                                PostProcessingMaterial;                            // 0x002C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.FrameGrabberProtocolSettings
// 0x0008 (0x0024)
class UFrameGrabberProtocolSettings : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x8];                               // 0x001C (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.ImageCaptureSettings
// 0x0004 (0x0028)
class UImageCaptureSettings : public UFrameGrabberProtocolSettings
{
public:
	int32_t                                                                                              CompressionQuality;                                // 0x0024 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.VideoCaptureSettings
// 0x0014 (0x0038)
class UVideoCaptureSettings : public UFrameGrabberProtocolSettings
{
public:
	bool                                                                                                 bUseCompression;                                   // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
	float                                                                                                CompressionQuality;                                // 0x0028 (0x0004)
	FString                                                                                              VideoCodec;                                        // 0x002C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.MovieSceneCaptureInterface
// 0x0000 (0x001C)
class UMovieSceneCaptureInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.MovieSceneCapture
// 0x010C (0x0128)
class UMovieSceneCapture : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x8];                               // 0x001C (0x0008) MISSED OFFSET
	FCaptureProtocolID                                                                                   CaptureType;                                       // 0x0024 (0x0008)
	class UObject*                                                                                       ProtocolSettings;                                  // 0x002C (0x0004)
	FMovieSceneCaptureSettings                                                                           Settings;                                          // 0x0030 (0x0038)
	bool                                                                                                 bUseSeparateProcess;                               // 0x0068 (0x0001)
	uint8_t                                                                                              UnknownData_69[0x3];                               // 0x0069 (0x0003) MISSED OFFSET
	FString                                                                                              AdditionalCommandLineArguments;                    // 0x006C (0x000C)
	FString                                                                                              InheritedCommandLineArguments;                     // 0x0078 (0x000C)
	uint8_t                                                                                              UnknownData_84[0xA4];                              // 0x0084 (0x00A4) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.AutomatedLevelSequenceCapture
// 0x0000 (0x0128)
class UAutomatedLevelSequenceCapture : public UMovieSceneCapture
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.LevelCapture
// 0x0020 (0x0148)
class ULevelCapture : public UMovieSceneCapture
{
public:
	bool                                                                                                 bAutoStartCapture;                                 // 0x0128 (0x0001)
	uint8_t                                                                                              UnknownData_129[0xB];                              // 0x0129 (0x000B) MISSED OFFSET
	FGuid                                                                                                PrerequisiteActorId;                               // 0x0134 (0x0010)
	uint8_t                                                                                              UnknownData_144[0x4];                              // 0x0144 (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneCapture.MovieSceneCaptureEnvironment
// 0x0000 (0x001C)
class UMovieSceneCaptureEnvironment : public UObject
{
public:
	static int32_t GetCaptureFrameNumber(); // Function /Script/MovieSceneCapture.MovieSceneCaptureEnvironment:GetCaptureFrameNumber
	static float GetCaptureElapsedTime(); // Function /Script/MovieSceneCapture.MovieSceneCaptureEnvironment:GetCaptureElapsedTime
public:
	static class UClass* StaticClass();
};

