#pragma once
#include "FN_Basic.h"

#include "FN_MissionTooltip_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MissionTooltip
*/

// WidgetBlueprintGeneratedClass /Game/UI/Theater/MissionTooltip.MissionTooltip_C
// 0x0034 (0x01EC)
class UMissionTooltip_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UHorizontalBox*                                                                                Biome_Info;                                        // 0x01BC (0x0004)
	class UTextBlock*                                                                                    Biome_Name;                                        // 0x01C0 (0x0004)
	class UHorizontalBox*                                                                                Difficulty_Info;                                   // 0x01C4 (0x0004)
	class UTextBlock*                                                                                    Difficulty_Name;                                   // 0x01C8 (0x0004)
	class UTextBlock*                                                                                    Mission_Name;                                      // 0x01CC (0x0004)
	class UImage*                                                                                        Mission_Type_Icon;                                 // 0x01D0 (0x0004)
	class UPowerRequirement_C*                                                                           PowerRequirement;                                  // 0x01D4 (0x0004)
	class UVerticalBox*                                                                                  RewardsContent;                                    // 0x01D8 (0x0004)
	class UVerticalBox*                                                                                  VerticalBox;                                       // 0x01DC (0x0004)
	TArray<FFortMissionRewardInfo>                                                                       MissionRewards;                                    // 0x01E0 (0x000C)
public:
	void HandleMissionRewards(); // Function /Game/UI/Theater/MissionTooltip.MissionTooltip_C:HandleMissionRewards
	void UpdateMissionInfo(class ABP_Hex_PARENT_C* Mission_Details); // Function /Game/UI/Theater/MissionTooltip.MissionTooltip_C:UpdateMissionInfo
	void Construct(); // Function /Game/UI/Theater/MissionTooltip.MissionTooltip_C:Construct
	void ExecuteUbergraph_MissionTooltip(int32_t EntryPoint); // Function /Game/UI/Theater/MissionTooltip.MissionTooltip_C:ExecuteUbergraph_MissionTooltip
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Theater/MissionTooltip.PLACEHOLDER-CLASS__MissionRewardItem-Tooltip_C_135
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__MissionRewardItem_Tooltip_C_135
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Theater/MissionTooltip.PLACEHOLDER-CLASS__BP_Hex_PARENT_C_136
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__BP_Hex_PARENT_C_136
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Theater/MissionTooltip.PLACEHOLDER-CLASS__PowerRequirement_C_137
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__PowerRequirement_C_137
{
public:
	static class UClass* StaticClass();
};

