#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_JsonUtilities_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: McpProfileSys
*/

// ScriptStruct /Script/McpProfileSys.McpLootEntry
// 0x0024 (0x0024)
struct FMcpLootEntry
{
	FString                                                                                              ItemType;                                          // 0x0000 (0x000C)
	FString                                                                                              ItemGuid;                                          // 0x000C (0x000C)
	int32_t                                                                                              Quantity;                                          // 0x0018 (0x0004)
	FJsonObjectWrapper                                                                                   Attributes;                                        // 0x001C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpLootResult
// 0x0024 (0x0024)
struct FMcpLootResult
{
	FString                                                                                              TierGroupName;                                     // 0x0000 (0x000C)
	TArray<FMcpLootEntry>                                                                                PersistentItems;                                   // 0x000C (0x000C)
	TArray<FMcpLootEntry>                                                                                WorldItems;                                        // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.ProfilePendingHttpRequest
// 0x0018 (0x0018)
struct FProfilePendingHttpRequest
{
	class UMcpProfile*                                                                                   SourceProfile;                                     // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0x14];                               // 0x0004 (0x0014) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.ProfileEntry
// 0x0010 (0x0010)
struct FProfileEntry
{
	FString                                                                                              ProfileId;                                         // 0x0000 (0x000C)
	class UMcpProfile*                                                                                   ProfileObject;                                     // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.BaseUrlContext
// 0x0018 (0x0018)
struct FBaseUrlContext
{
	uint8_t                                                                                              UnknownData_0[0x18];                               // 0x0000 (0x0018) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.ClientUrlContext
// 0x0000 (0x0018)
struct FClientUrlContext : public FBaseUrlContext
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.DedicatedServerUrlContext
// 0x0000 (0x0018)
struct FDedicatedServerUrlContext : public FBaseUrlContext
{

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpAddItemRequest
// 0x0024 (0x0024)
struct FMcpAddItemRequest
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)
	FString                                                                                              TemplateId;                                        // 0x000C (0x000C)
	int32_t                                                                                              Quantity;                                          // 0x0018 (0x0004)
	FJsonObjectWrapper                                                                                   Attributes;                                        // 0x001C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpRemoveItemRequest
// 0x000C (0x000C)
struct FMcpRemoveItemRequest
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpChangeQuantityRequest
// 0x0010 (0x0010)
struct FMcpChangeQuantityRequest
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)
	int32_t                                                                                              DeltaQuantity;                                     // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpChangeAttributesRequest
// 0x0014 (0x0014)
struct FMcpChangeAttributesRequest
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)
	FJsonObjectWrapper                                                                                   Attributes;                                        // 0x000C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.McpProfileChangeRequest
// 0x0040 (0x0040)
struct FMcpProfileChangeRequest
{
	int32_t                                                                                              BaseProfileRevision;                               // 0x0000 (0x0004)
	TArray<FMcpAddItemRequest>                                                                           AddRequests;                                       // 0x0004 (0x000C)
	TArray<FMcpRemoveItemRequest>                                                                        RemoveRequests;                                    // 0x0010 (0x000C)
	TArray<FMcpChangeQuantityRequest>                                                                    ChangeQuantityRequests;                            // 0x001C (0x000C)
	TArray<FMcpChangeAttributesRequest>                                                                  ChangeAttributesRequests;                          // 0x0028 (0x000C)
	TArray<FJsonObjectWrapper>                                                                           ChangeStatRequests;                                // 0x0034 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/McpProfileSys.ProfileGroupEntry
// 0x000C (0x000C)
struct FProfileGroupEntry
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET
	class UMcpProfileGroup*                                                                              ProfileGroup;                                      // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

