#pragma once
#include "FN_Basic.h"

#include "FN_MissionRewardItem_Tooltip_parameters.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MissionRewardItem_Tooltip
*/

// WidgetBlueprintGeneratedClass /Game/UI/Theater/MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C
// 0x001C (0x01D4)
class UMissionRewardItem_Tooltip_C : public UUserWidget
{
public:
	class UBorder*                                                                                       Border;                                            // 0x01B8 (0x0004)
	class UImage*                                                                                        Icon;                                              // 0x01BC (0x0004)
	class UTextBlock*                                                                                    TextField;                                         // 0x01C0 (0x0004)
	class UFortItem*                                                                                     Item;                                              // 0x01C4 (0x0004)
	FText                                                                                                DisplayName;                                       // 0x01C8 (0x000C)
public:
	FSlateColor Get_Rarity_Color__SlateColor_(); // Function /Game/UI/Theater/MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C:Get Rarity Color (SlateColor)
	FLinearColor Get_Rarity_Color(); // Function /Game/UI/Theater/MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C:Get Rarity Color
	FSlateBrush Get_Reward_Icon(); // Function /Game/UI/Theater/MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C:Get Reward Icon
	FText Get_Reward_Name(); // Function /Game/UI/Theater/MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C:Get Reward Name
public:
	static class UClass* StaticClass();
};

