#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieSceneCapture
*/

// ScriptStruct /Script/MovieSceneCapture.CompositionGraphCapturePasses
// 0x000C (0x000C)
struct FCompositionGraphCapturePasses
{
	TArray<FString>                                                                                      Value;                                             // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneCapture.CaptureResolution
// 0x0008 (0x0008)
struct FCaptureResolution
{
	uint32_t                                                                                             ResX;                                              // 0x0000 (0x0004)
	uint32_t                                                                                             ResY;                                              // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneCapture.MovieSceneCaptureSettings
// 0x0038 (0x0038)
struct FMovieSceneCaptureSettings
{
	FDirectoryPath                                                                                       OutputDirectory;                                   // 0x0000 (0x000C)
	bool                                                                                                 bCreateTemporaryCopiesOfLevels;                    // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET
	class UClass*                                                                                        GameModeOverride;                                  // 0x0010 (0x0004)
	FString                                                                                              OutputFormat;                                      // 0x0014 (0x000C)
	bool                                                                                                 bOverwriteExisting;                                // 0x0020 (0x0001)
	bool                                                                                                 bUseRelativeFrameNumbers;                          // 0x0021 (0x0001)
	uint8_t                                                                                              UnknownData_22[0x2];                               // 0x0022 (0x0002) MISSED OFFSET
	int32_t                                                                                              FrameRate;                                         // 0x0024 (0x0004)
	FCaptureResolution                                                                                   Resolution;                                        // 0x0028 (0x0008)
	bool                                                                                                 bEnableTextureStreaming;                           // 0x0030 (0x0001)
	bool                                                                                                 bCinematicMode;                                    // 0x0031 (0x0001)
	bool                                                                                                 bAllowMovement;                                    // 0x0032 (0x0001)
	bool                                                                                                 bAllowTurning;                                     // 0x0033 (0x0001)
	bool                                                                                                 bShowPlayer;                                       // 0x0034 (0x0001)
	bool                                                                                                 bShowHUD;                                          // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0x2];                               // 0x0036 (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/MovieSceneCapture.CaptureProtocolID
// 0x0008 (0x0008)
struct FCaptureProtocolID
{
	FName                                                                                                Identifier;                                        // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

