#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MoviePlayer
*/

// Class /Script/MoviePlayer.MoviePlayerSettings
// 0x0010 (0x002C)
class UMoviePlayerSettings : public UObject
{
public:
	bool                                                                                                 bWaitForMoviesToComplete;                          // 0x001C (0x0001)
	bool                                                                                                 bMoviesAreSkippable;                               // 0x001D (0x0001)
	uint8_t                                                                                              UnknownData_1E[0x2];                               // 0x001E (0x0002) MISSED OFFSET
	TArray<FString>                                                                                      StartupMovies;                                     // 0x0020 (0x000C)
public:
	static class UClass* StaticClass();
};

