#pragma once
#include "FN_Basic.h"

#include "FN_MovieSceneTracks_enums.h"
#include "FN_MovieSceneTracks_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_MovieScene_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: MovieSceneTracks
*/

// Class /Script/MovieSceneTracks.MovieScene3DConstraintSection
// 0x0010 (0x0040)
class UMovieScene3DConstraintSection : public UMovieSceneSection
{
public:
	FGuid                                                                                                ConstraintId;                                      // 0x0030 (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DAttachSection
// 0x000C (0x004C)
class UMovieScene3DAttachSection : public UMovieScene3DConstraintSection
{
public:
	FName                                                                                                AttachSocketName;                                  // 0x0040 (0x0008)
	uint8_t                                                                                              bConstrainTx : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bConstrainTy : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bConstrainTz : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bConstrainRx : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              bConstrainRy : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x10]
	uint8_t                                                                                              bConstrainRz : 1;                                  // 0x0048 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x20]
	uint8_t                                                                                              UnknownData_49[0x3];                               // 0x0049 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DPathSection
// 0x005C (0x009C)
class UMovieScene3DPathSection : public UMovieScene3DConstraintSection
{
public:
	FRichCurve                                                                                           TimingCurve;                                       // 0x0040 (0x0054)
	MovieScene3DPathSection_Axis                                                                         FrontAxisEnum;                                     // 0x0094 (0x0001)
	MovieScene3DPathSection_Axis                                                                         UpAxisEnum;                                        // 0x0095 (0x0001)
	uint8_t                                                                                              UnknownData_96[0x2];                               // 0x0096 (0x0002) MISSED OFFSET
	uint8_t                                                                                              bFollow : 1;                                       // 0x0098 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bReverse : 1;                                      // 0x0098 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bForceUpright : 1;                                 // 0x0098 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              UnknownData_99[0x3];                               // 0x0099 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DConstraintTrack
// 0x000C (0x0028)
class UMovieScene3DConstraintTrack : public UMovieSceneTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    ConstraintSections;                                // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DAttachTrack
// 0x0000 (0x0028)
class UMovieScene3DAttachTrack : public UMovieScene3DConstraintTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DPathTrack
// 0x0000 (0x0028)
class UMovieScene3DPathTrack : public UMovieScene3DConstraintTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DTransformSection
// 0x02F8 (0x0328)
class UMovieScene3DTransformSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           Translation[3];                                    // 0x0034 (0x00FC)
	FRichCurve                                                                                           Rotation[3];                                       // 0x0130 (0x00FC)
	FRichCurve                                                                                           Scale[3];                                          // 0x022C (0x00FC)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneAudioSection
// 0x000C (0x003C)
class UMovieSceneAudioSection : public UMovieSceneSection
{
public:
	class USoundBase*                                                                                    Sound;                                             // 0x0030 (0x0004)
	float                                                                                                AudioStartTime;                                    // 0x0034 (0x0004)
	float                                                                                                AudioDilationFactor;                               // 0x0038 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneAudioTrack
// 0x000C (0x0028)
class UMovieSceneAudioTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    AudioSections;                                     // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneBoolSection
// 0x005C (0x008C)
class UMovieSceneBoolSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	bool                                                                                                 DefaultValue;                                      // 0x0034 (0x0001)
	uint8_t                                                                                              UnknownData_35[0x3];                               // 0x0035 (0x0003) MISSED OFFSET
	FIntegralCurve                                                                                       BoolCurve;                                         // 0x0038 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneVisibilitySection
// 0x0000 (0x008C)
class UMovieSceneVisibilitySection : public UMovieSceneBoolSection
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneByteSection
// 0x0058 (0x0088)
class UMovieSceneByteSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FIntegralCurve                                                                                       ByteCurve;                                         // 0x0034 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneColorSection
// 0x0154 (0x0184)
class UMovieSceneColorSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           RedCurve;                                          // 0x0034 (0x0054)
	FRichCurve                                                                                           GreenCurve;                                        // 0x0088 (0x0054)
	FRichCurve                                                                                           BlueCurve;                                         // 0x00DC (0x0054)
	FRichCurve                                                                                           AlphaCurve;                                        // 0x0130 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneEventSection
// 0x004C (0x007C)
class UMovieSceneEventSection : public UMovieSceneSection
{
public:
	FNameCurve                                                                                           Events;                                            // 0x0030 (0x004C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneEventTrack
// 0x0010 (0x002C)
class UMovieSceneEventTrack : public UMovieSceneNameableTrack
{
public:
	uint8_t                                                                                              bFireEventsWhenForwards : 1;                       // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bFireEventsWhenBackwards : 1;                      // 0x001C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x0020 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneFloatSection
// 0x0058 (0x0088)
class UMovieSceneFloatSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           FloatCurve;                                        // 0x0034 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneFadeSection
// 0x0014 (0x009C)
class UMovieSceneFadeSection : public UMovieSceneFloatSection
{
public:
	FLinearColor                                                                                         FadeColor;                                         // 0x0088 (0x0010)
	uint8_t                                                                                              bFadeAudio : 1;                                    // 0x0098 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_99[0x3];                               // 0x0099 (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSlomoSection
// 0x0000 (0x0088)
class UMovieSceneSlomoSection : public UMovieSceneFloatSection
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneParameterSection
// 0x0024 (0x0054)
class UMovieSceneParameterSection : public UMovieSceneSection
{
public:
	TArray<FScalarParameterNameAndCurve>                                                                 ScalarParameterNamesAndCurves;                     // 0x0030 (0x000C)
	TArray<FVectorParameterNameAndCurves>                                                                VectorParameterNamesAndCurves;                     // 0x003C (0x000C)
	TArray<FColorParameterNameAndCurves>                                                                 ColorParameterNamesAndCurves;                      // 0x0048 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneMaterialTrack
// 0x000C (0x0028)
class UMovieSceneMaterialTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneComponentMaterialTrack
// 0x0004 (0x002C)
class UMovieSceneComponentMaterialTrack : public UMovieSceneMaterialTrack
{
public:
	int32_t                                                                                              MaterialIndex;                                     // 0x0028 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneParticleParameterTrack
// 0x000C (0x0028)
class UMovieSceneParticleParameterTrack : public UMovieSceneTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneParticleSection
// 0x0054 (0x0084)
class UMovieSceneParticleSection : public UMovieSceneSection
{
public:
	FIntegralCurve                                                                                       ParticleKeys;                                      // 0x0030 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneParticleTrack
// 0x000C (0x0028)
class UMovieSceneParticleTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    ParticleSections;                                  // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScenePropertyTrack
// 0x0020 (0x003C)
class UMovieScenePropertyTrack : public UMovieSceneTrack
{
public:
	FName                                                                                                PropertyName;                                      // 0x001C (0x0008)
	FString                                                                                              PropertyPath;                                      // 0x0024 (0x000C)
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x0030 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieScene3DTransformTrack
// 0x0000 (0x003C)
class UMovieScene3DTransformTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneBoolTrack
// 0x0000 (0x003C)
class UMovieSceneBoolTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneVisibilityTrack
// 0x0000 (0x003C)
class UMovieSceneVisibilityTrack : public UMovieSceneBoolTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneByteTrack
// 0x0004 (0x0040)
class UMovieSceneByteTrack : public UMovieScenePropertyTrack
{
public:
	class UEnum*                                                                                         Enum;                                              // 0x003C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneColorTrack
// 0x0004 (0x0040)
class UMovieSceneColorTrack : public UMovieScenePropertyTrack
{
public:
	bool                                                                                                 bIsSlateColor;                                     // 0x003C (0x0001)
	uint8_t                                                                                              UnknownData_3D[0x3];                               // 0x003D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneFloatTrack
// 0x0000 (0x003C)
class UMovieSceneFloatTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneFadeTrack
// 0x0000 (0x003C)
class UMovieSceneFadeTrack : public UMovieSceneFloatTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSlomoTrack
// 0x0000 (0x003C)
class UMovieSceneSlomoTrack : public UMovieSceneFloatTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneVectorTrack
// 0x0004 (0x0040)
class UMovieSceneVectorTrack : public UMovieScenePropertyTrack
{
public:
	int32_t                                                                                              NumChannelsUsed;                                   // 0x003C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneShotSection
// 0x0020 (0x0050)
class UMovieSceneShotSection : public UMovieSceneSection
{
public:
	FGuid                                                                                                CameraGuid;                                        // 0x0030 (0x0010)
	FText                                                                                                DisplayName;                                       // 0x0040 (0x000C)
	int32_t                                                                                              ShotNumber;                                        // 0x004C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSubTrack
// 0x000C (0x0028)
class UMovieSceneSubTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneShotTrack
// 0x000C (0x0028)
class UMovieSceneShotTrack : public UMovieSceneTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSkeletalAnimationSection
// 0x001C (0x004C)
class UMovieSceneSkeletalAnimationSection : public UMovieSceneSection
{
public:
	class UAnimSequence*                                                                                 AnimSequence;                                      // 0x0030 (0x0004)
	float                                                                                                StartOffset;                                       // 0x0034 (0x0004)
	float                                                                                                EndOffset;                                         // 0x0038 (0x0004)
	float                                                                                                PlayRate;                                          // 0x003C (0x0004)
	uint8_t                                                                                              bReverse : 1;                                      // 0x0040 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_41[0x3];                               // 0x0041 (0x0003) MISSED OFFSET
	FName                                                                                                SlotName;                                          // 0x0044 (0x0008)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSkeletalAnimationTrack
// 0x000C (0x0028)
class UMovieSceneSkeletalAnimationTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    AnimationSections;                                 // 0x001C (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSpawnTrack
// 0x001C (0x0038)
class UMovieSceneSpawnTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>                                                                    Sections;                                          // 0x001C (0x000C)
	FGuid                                                                                                ObjectGuid;                                        // 0x0028 (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneSubSection
// 0x000C (0x003C)
class UMovieSceneSubSection : public UMovieSceneSection
{
public:
	float                                                                                                StartOffset;                                       // 0x0030 (0x0004)
	float                                                                                                TimeScale;                                         // 0x0034 (0x0004)
	class UMovieSceneSequence*                                                                           SubSequence;                                       // 0x0038 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/MovieSceneTracks.MovieSceneVectorSection
// 0x0158 (0x0188)
class UMovieSceneVectorSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           Curves[4];                                         // 0x0034 (0x0150)
	int32_t                                                                                              ChannelsUsed;                                      // 0x0184 (0x0004)
public:
	static class UClass* StaticClass();
};

