#pragma once
#include "FN_Basic.h"

#include "FN_Niagara_enums.h"
#include "FN_Niagara_structs.h"
#include "FN_Niagara_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_MovieScene_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Niagara
*/

// Class /Script/Niagara.NiagaraActor
// 0x0004 (0x0244)
class ANiagaraActor : public AActor
{
public:
	class UNiagaraComponent*                                                                             NiagaraComponent;                                  // 0x0240 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraComponent
// 0x0010 (0x0440)
class UNiagaraComponent : public UPrimitiveComponent
{
public:
	class UNiagaraEffect*                                                                                Asset;                                             // 0x042C (0x0004)
	uint8_t                                                                                              UnknownData_430[0x10];                             // 0x0430 (0x0010) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraScript
// 0x0154 (0x0170)
class UNiagaraScript : public UObject
{
public:
	TArray<uint8_t>                                                                                      ByteCode;                                          // 0x001C (0x000C)
	FNiagaraScriptConstantData                                                                           ConstantData;                                      // 0x0028 (0x0120)
	TArray<FNiagaraVariableInfo>                                                                         Attributes;                                        // 0x0148 (0x000C)
	TArray<FNiagaraDataSetProperties>                                                                    EventReceivers;                                    // 0x0154 (0x000C)
	TArray<FNiagaraDataSetProperties>                                                                    EventGenerators;                                   // 0x0160 (0x000C)
	FNiagaraScriptUsageInfo                                                                              Usage;                                             // 0x016C (0x0001)
	uint8_t                                                                                              UnknownData_16D[0x3];                              // 0x016D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraEmitterProperties
// 0x00C4 (0x00E0)
class UNiagaraEmitterProperties : public UObject
{
public:
	FString                                                                                              EmitterName;                                       // 0x001C (0x000C)
	bool                                                                                                 bIsEnabled;                                        // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET
	float                                                                                                SpawnRate;                                         // 0x002C (0x0004)
	class UMaterial*                                                                                     Material;                                          // 0x0030 (0x0004)
	EEmitterRenderModuleType                                                                             RenderModuleType;                                  // 0x0034 (0x0001)
	uint8_t                                                                                              UnknownData_35[0x3];                               // 0x0035 (0x0003) MISSED OFFSET
	float                                                                                                StartTime;                                         // 0x0038 (0x0004)
	float                                                                                                EndTime;                                           // 0x003C (0x0004)
	class UNiagaraEffectRendererProperties*                                                              RendererProperties;                                // 0x0040 (0x0004)
	int32_t                                                                                              NumLoops;                                          // 0x0044 (0x0004)
	FNiagaraEmitterScriptProperties                                                                      UpdateScriptProps;                                 // 0x0048 (0x004C)
	FNiagaraEmitterScriptProperties                                                                      SpawnScriptProps;                                  // 0x0094 (0x004C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraEffect
// 0x0018 (0x0034)
class UNiagaraEffect : public UObject
{
public:
	TArray<FDeprecatedNiagaraEmitterProperties>                                                          EmitterPropsSerialized;                            // 0x001C (0x000C)
	TArray<class UNiagaraEmitterProperties*>                                                             EmitterProps;                                      // 0x0028 (0x000C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraEventReceiverEmitterAction
// 0x0000 (0x001C)
class UNiagaraEventReceiverEmitterAction : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
// 0x0004 (0x0020)
class UNiagaraEventReceiverEmitterAction_SpawnParticles : public UNiagaraEventReceiverEmitterAction
{
public:
	uint32_t                                                                                             NumParticles;                                      // 0x001C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraFunctionLibrary
// 0x0000 (0x001C)
class UNiagaraFunctionLibrary : public UBlueprintFunctionLibrary
{
public:
	static class UNiagaraComponent* SpawnEffectAttached(class UNiagaraEffect* EffectTemplate, class USceneComponent* AttachToComponent, FName AttachPointName, FVector Location, FRotator Rotation, EAttachLocation LocationType, bool bAutoDestroy); // Function /Script/Niagara.NiagaraFunctionLibrary:SpawnEffectAttached
	static class UNiagaraComponent* SpawnEffectAtLocation(class UObject* WorldContextObject, class UNiagaraEffect* EffectTemplate, FVector Location, FRotator Rotation, bool bAutoDestroy); // Function /Script/Niagara.NiagaraFunctionLibrary:SpawnEffectAtLocation
	static void SetUpdateScriptConstant(class UNiagaraComponent* Component, FName EmitterName, FName ConstantName, FVector Value); // Function /Script/Niagara.NiagaraFunctionLibrary:SetUpdateScriptConstant
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraScriptSourceBase
// 0x0018 (0x0034)
class UNiagaraScriptSourceBase : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x18];                              // 0x001C (0x0018) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Niagara.NiagaraSequence
// 0x0004 (0x0020)
class UNiagaraSequence : public UMovieSceneSequence
{
public:
	class UMovieScene*                                                                                   MovieScene;                                        // 0x001C (0x0004)
public:
	static class UClass* StaticClass();
};

