#pragma once
#include "FN_Basic.h"

#include "FN_NewsEntry_parameters.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: NewsEntry
*/

// WidgetBlueprintGeneratedClass /Game/UI/NewsScreen/NewsEntry.NewsEntry_C
// 0x0020 (0x0264)
class UNewsEntry_C : public UFortUserWidget
{
public:
	class UTextBlock*                                                                                    Content_Text;                                      // 0x0244 (0x0004)
	class UTextBlock*                                                                                    Header_Text;                                       // 0x0248 (0x0004)
	FText                                                                                                HeaderText;                                        // 0x024C (0x000C)
	FText                                                                                                BodyText;                                          // 0x0258 (0x000C)
public:
	FText Get_Header_Text(); // Function /Game/UI/NewsScreen/NewsEntry.NewsEntry_C:Get_Header_Text
	FText Get_Content_Text(); // Function /Game/UI/NewsScreen/NewsEntry.NewsEntry_C:Get_Content_Text
public:
	static class UClass* StaticClass();
};

