#pragma once
#include "FN_Basic.h"

#include "FN_Niagara_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Niagara
*/

// ScriptStruct /Script/Niagara.NiagaraDataSetID
// 0x000C (0x000C)
struct FNiagaraDataSetID
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	ENiagaraDataSetType                                                                                  Type;                                              // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraVariableInfo
// 0x000C (0x000C)
struct FNiagaraVariableInfo
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	ENiagaraDataType                                                                                     Type;                                              // 0x0008 (0x0001)
	uint8_t                                                                                              UnknownData_9[0x3];                                // 0x0009 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstantBase
// 0x0008 (0x0008)
struct FNiagaraConstantBase
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstants_Float
// 0x0004 (0x000C)
struct FNiagaraConstants_Float : public FNiagaraConstantBase
{
	float                                                                                                Value;                                             // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstants_Vector
// 0x0018 (0x0020)
struct FNiagaraConstants_Vector : public FNiagaraConstantBase
{
	uint8_t                                                                                              UnknownData_8[0x8];                                // 0x0008 (0x0008) MISSED OFFSET
	FVector4                                                                                             Value;                                             // 0x0010 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstants_Matrix
// 0x0048 (0x0050)
struct FNiagaraConstants_Matrix : public FNiagaraConstantBase
{
	uint8_t                                                                                              UnknownData_8[0x8];                                // 0x0008 (0x0008) MISSED OFFSET
	FMatrix                                                                                              Value;                                             // 0x0010 (0x0040)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstants_DataObject
// 0x0004 (0x000C)
struct FNiagaraConstants_DataObject : public FNiagaraConstantBase
{
	class UNiagaraDataObject*                                                                            Value;                                             // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstants
// 0x0030 (0x0030)
struct FNiagaraConstants
{
	TArray<FNiagaraConstants_Float>                                                                      ScalarConstants;                                   // 0x0000 (0x000C)
	TArray<FNiagaraConstants_Vector>                                                                     VectorConstants;                                   // 0x000C (0x000C)
	TArray<FNiagaraConstants_Matrix>                                                                     MatrixConstants;                                   // 0x0018 (0x000C)
	TArray<FNiagaraConstants_DataObject>                                                                 DataObjectConstants;                               // 0x0024 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.DeprecatedNiagaraConstants
// 0x0060 (0x0060)
struct FDeprecatedNiagaraConstants
{
	TArray<FNiagaraVariableInfo>                                                                         ScalarConstantsInfo;                               // 0x0000 (0x000C)
	TArray<FNiagaraVariableInfo>                                                                         VectorConstantsInfo;                               // 0x000C (0x000C)
	TArray<FNiagaraVariableInfo>                                                                         MatrixConstantsInfo;                               // 0x0018 (0x000C)
	uint8_t                                                                                              UnknownData_24[0xC];                               // 0x0024 (0x000C) MISSED OFFSET
	TArray<float>                                                                                        ScalarConstants;                                   // 0x0030 (0x000C)
	TArray<FVector4>                                                                                     VectorConstants;                                   // 0x003C (0x000C)
	TArray<FMatrix>                                                                                      MatrixConstants;                                   // 0x0048 (0x000C)
	uint8_t                                                                                              UnknownData_54[0xC];                               // 0x0054 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraConstantMap
// 0x00F4 (0x00F4)
struct FNiagaraConstantMap
{
	uint8_t                                                                                              UnknownData_0[0xF4];                               // 0x0000 (0x00F4) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraScriptConstantData
// 0x0120 (0x0120)
struct FNiagaraScriptConstantData
{
	FDeprecatedNiagaraConstants                                                                          ExternalConstants;                                 // 0x0000 (0x0060)
	FDeprecatedNiagaraConstants                                                                          InternalConstants;                                 // 0x0060 (0x0060)
	FNiagaraConstants                                                                                    ExternalConstantsNew;                              // 0x00C0 (0x0030)
	FNiagaraConstants                                                                                    InternalConstantsNew;                              // 0x00F0 (0x0030)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraScriptUsageInfo
// 0x0001 (0x0001)
struct FNiagaraScriptUsageInfo
{
	bool                                                                                                 bReadsAttriubteData;                               // 0x0000 (0x0001)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraDataSetProperties
// 0x0018 (0x0018)
struct FNiagaraDataSetProperties
{
	FNiagaraDataSetID                                                                                    ID;                                                // 0x0000 (0x000C)
	TArray<FNiagaraVariableInfo>                                                                         Variables;                                         // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.DeprecatedNiagaraEmitterProperties
// 0x021C (0x021C)
struct FDeprecatedNiagaraEmitterProperties
{
	FString                                                                                              Name;                                              // 0x0000 (0x000C)
	bool                                                                                                 bIsEnabled;                                        // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET
	float                                                                                                SpawnRate;                                         // 0x0010 (0x0004)
	class UNiagaraScript*                                                                                UpdateScript;                                      // 0x0014 (0x0004)
	class UNiagaraScript*                                                                                SpawnScript;                                       // 0x0018 (0x0004)
	class UMaterial*                                                                                     Material;                                          // 0x001C (0x0004)
	EEmitterRenderModuleType                                                                             RenderModuleType;                                  // 0x0020 (0x0001)
	uint8_t                                                                                              UnknownData_21[0x3];                               // 0x0021 (0x0003) MISSED OFFSET
	float                                                                                                StartTime;                                         // 0x0024 (0x0004)
	float                                                                                                EndTime;                                           // 0x0028 (0x0004)
	class UNiagaraEffectRendererProperties*                                                              RendererProperties;                                // 0x002C (0x0004)
	FNiagaraConstantMap                                                                                  ExternalConstants;                                 // 0x0030 (0x00F4)
	FNiagaraConstantMap                                                                                  ExternalSpawnConstants;                            // 0x0124 (0x00F4)
	int32_t                                                                                              NumLoops;                                          // 0x0218 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraEventReceiverProperties
// 0x0024 (0x0024)
struct FNiagaraEventReceiverProperties
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	FName                                                                                                SourceEventGenerator;                              // 0x0008 (0x0008)
	FName                                                                                                SourceEmitter;                                     // 0x0010 (0x0008)
	TArray<class UNiagaraEventReceiverEmitterAction*>                                                    EmitterActions;                                    // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraEventGeneratorProperties
// 0x0004 (0x001C)
struct FNiagaraEventGeneratorProperties : public FNiagaraDataSetProperties
{
	int32_t                                                                                              MaxEventsPerFrame;                                 // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Niagara.NiagaraEmitterScriptProperties
// 0x004C (0x004C)
struct FNiagaraEmitterScriptProperties
{
	class UNiagaraScript*                                                                                Script;                                            // 0x0000 (0x0004)
	FNiagaraConstants                                                                                    ExternalConstants;                                 // 0x0004 (0x0030)
	TArray<FNiagaraEventReceiverProperties>                                                              EventReceivers;                                    // 0x0034 (0x000C)
	TArray<FNiagaraEventGeneratorProperties>                                                             EventGenerators;                                   // 0x0040 (0x000C)

	static class UScriptStruct* StaticStruct();
};

