#pragma once
#include "FN_Basic.h"

#include "FN_NotificationWindow_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: NotificationWindow
*/

// WidgetBlueprintGeneratedClass /Game/UI/Notification/NotificationWindow.NotificationWindow_C
// 0x0081 (0x02C5)
class UNotificationWindow_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UNotificationBox_C*                                                                            NotificationBox;                                   // 0x0248 (0x0004)
	class UObject*                                                                                       NewNotificationData;                               // 0x024C (0x0004)
	struct FUNotificationWindow_C_OnTimerComplete__DelegateSignature                                     OnTimerComplete;                                   // 0x0250 (0x000C)
	float                                                                                                AnimationFinishedDelay;                            // 0x025C (0x0004)
	class UObject*                                                                                       FriendNotificationTemp;                            // 0x0260 (0x0004)
	bool                                                                                                 CurrentlyProcessingNotification;                   // 0x0264 (0x0001)
	uint8_t                                                                                              UnknownData_265[0x3];                              // 0x0265 (0x0003) MISSED OFFSET
	FFortDialogDescription                                                                               CurrentNotification;                               // 0x0268 (0x0050)
	class USoundBase*                                                                                    Sound_Invite_Sent;                                 // 0x02B8 (0x0004)
	class USoundBase*                                                                                    Sound_Invite_Received;                             // 0x02BC (0x0004)
	class USoundBase*                                                                                    Sound_Invite_Accepted;                             // 0x02C0 (0x0004)
	bool                                                                                                 NewVar_0;                                          // 0x02C4 (0x0001)
public:
	void PlayFeedback(EFortDialogFeedbackType FeedBackType); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:PlayFeedback
	void TryConsumeNextNotification(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:TryConsumeNextNotification
	void FinishHandlingNotification(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:FinishHandlingNotification
	void SetIgnoreButton(FText InText); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:SetIgnoreButton
	void SetAcceptButton(FText InText); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:SetAcceptButton
	void SetMessage(FText InText); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:SetMessage
	void SetTitle(FText InText); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:SetTitle
	void RegisterNotificationHandler(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:RegisterNotificationHandler
	void StartNotification(FFortDialogDescription NotificationDescription); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:StartNotification
	void Construct(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:Construct
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_55_OnConfirmed__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_55_OnConfirmed__DelegateSignature
	void NextAnimation(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:NextAnimation
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_116_OnMouseEntered__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_116_OnMouseEntered__DelegateSignature
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_141_OnMouseLeft__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_141_OnMouseLeft__DelegateSignature
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_685_OnIntroComplete__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_685_OnIntroComplete__DelegateSignature
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_694_OnOutroComplete__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_694_OnOutroComplete__DelegateSignature
	void HandleNotificationAvailable(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:HandleNotificationAvailable
	void Destruct(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:Destruct
	void BndEvt__NotificationBox_K2Node_ComponentBoundEvent_558_OnIgnored__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:BndEvt__NotificationBox_K2Node_ComponentBoundEvent_558_OnIgnored__DelegateSignature
	void ExecuteUbergraph_NotificationWindow(int32_t EntryPoint); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:ExecuteUbergraph_NotificationWindow
	void OnTimerComplete__DelegateSignature(); // Function /Game/UI/Notification/NotificationWindow.NotificationWindow_C:OnTimerComplete__DelegateSignature
public:
	static class UClass* StaticClass();
};

