#pragma once
#include "FN_Basic.h"

#include "FN_NearestPlayerContext_parameters.h"
#include "FN_AIModule_enums.h"
#include "FN_AIModule_structs.h"
#include "FN_AIModule_classes.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: NearestPlayerContext
*/

// BlueprintGeneratedClass /Game/AI/EQS/Contexts/NearestPlayerContext.NearestPlayerContext_C
// 0x0031 (0x0051)
class UNearestPlayerContext_C : public UEnvQueryContext_BlueprintBase
{
public:
	FVector                                                                                              QuerierLocation;                                   // 0x0020 (0x000C)
	FVector                                                                                              GoalActorLocation;                                 // 0x002C (0x000C)
	float                                                                                                DistanceBetweenQuerierAndGoal;                     // 0x0038 (0x0004)
	float                                                                                                FinalHuntingRadiusToUse;                           // 0x003C (0x0004)
	FVector                                                                                              FinalHuntingRadiusLocationToUse;                   // 0x0040 (0x000C)
	class AFortAIPawn*                                                                                   Querier;                                           // 0x004C (0x0004)
	bool                                                                                                 Debug;                                             // 0x0050 (0x0001)
public:
	void ProvideSingleLocation(class UObject* QuerierObject, class AActor* QuerierActor, FVector ResultingLocation); // Function /Game/AI/EQS/Contexts/NearestPlayerContext.NearestPlayerContext_C:ProvideSingleLocation
public:
	static class UClass* StaticClass();
};

