#pragma once
#include "FN_Basic.h"

#include "FN_Outpost_CanEditPanel_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Outpost_CanEditPanel
*/

// WidgetBlueprintGeneratedClass /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C
// 0x0024 (0x0268)
class UOutpost_CanEditPanel_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UButtonIconText_C*                                                                             ButtonIconText_C_58;                               // 0x0248 (0x0004)
	class UButtonIconText_C*                                                                             ButtonIconText_C_5943;                             // 0x024C (0x0004)
	class UButtonIconText_C*                                                                             ButtonIconText_C_5944;                             // 0x0250 (0x0004)
	class UButtonIconText_C*                                                                             ButtonIconText_C_5945;                             // 0x0254 (0x0004)
	class UButtonIconText_C*                                                                             MasterSwitchButton;                                // 0x0258 (0x0004)
	class UTextBlock*                                                                                    NoTeammates_TextBlock;                             // 0x025C (0x0004)
	class UWrapBox*                                                                                      playerlistWrapBox;                                 // 0x0260 (0x0004)
	class AFortPlayerStateOutpost*                                                                       OutpostOwner;                                      // 0x0264 (0x0004)
public:
	void SetMasterSwitch(bool bCanEdit); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:SetMasterSwitch
	void Init(class AFortPlayerControllerOutpost* InOutpostOwner); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:Init
	void BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:BndEvt__MasterSwitchButton_K2Node_ComponentBoundEvent_407_FortSelectedStateChanged__DelegateSignature
	void Construct(); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:Construct
	void HandleJoined(FFortTeamMemberInfo NewTeamMemberInfo); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:HandleJoined
	void HandleRemoved(int32_t PlayerIndex); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:HandleRemoved
	void ExecuteUbergraph_Outpost_CanEditPanel(int32_t EntryPoint); // Function /Game/UI/Outpost/Outpost_CanEditPanel.Outpost_CanEditPanel_C:ExecuteUbergraph_Outpost_CanEditPanel
public:
	static class UClass* StaticClass();
};

