#pragma once
#include "FN_Basic.h"

#include "FN_Outpost_CanEditRow_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Outpost_CanEditRow
*/

// WidgetBlueprintGeneratedClass /Game/UI/Outpost/Outpost_CanEditRow.Outpost_CanEditRow_C
// 0x0010 (0x0254)
class UOutpost_CanEditRow_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UButtonIconText_C*                                                                             CanEditButton;                                     // 0x0248 (0x0004)
	class AFortPlayerStateOutpost*                                                                       Player;                                            // 0x024C (0x0004)
	class AFortPlayerStateOutpost*                                                                       OutpostOwner;                                      // 0x0250 (0x0004)
public:
	void Init(class AFortPlayerStateOutpost* InPlayer, class AFortPlayerStateOutpost* InOutpostOwner); // Function /Game/UI/Outpost/Outpost_CanEditRow.Outpost_CanEditRow_C:Init
	void BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Outpost/Outpost_CanEditRow.Outpost_CanEditRow_C:BndEvt__CanEditButton_K2Node_ComponentBoundEvent_278_FortSelectedStateChanged__DelegateSignature
	void ExecuteUbergraph_Outpost_CanEditRow(int32_t EntryPoint); // Function /Game/UI/Outpost/Outpost_CanEditRow.Outpost_CanEditRow_C:ExecuteUbergraph_Outpost_CanEditRow
public:
	static class UClass* StaticClass();
};

