#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: OculusLibrary
*/

// ScriptStruct /Script/OculusLibrary.HmdUserProfileField
// 0x0018 (0x0018)
struct FHmdUserProfileField
{
	FString                                                                                              FieldName;                                         // 0x0000 (0x000C)
	FString                                                                                              FieldValue;                                        // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OculusLibrary.HmdUserProfile
// 0x0038 (0x0038)
struct FHmdUserProfile
{
	FString                                                                                              Name;                                              // 0x0000 (0x000C)
	FString                                                                                              Gender;                                            // 0x000C (0x000C)
	float                                                                                                PlayerHeight;                                      // 0x0018 (0x0004)
	float                                                                                                EyeHeight;                                         // 0x001C (0x0004)
	float                                                                                                IPD;                                               // 0x0020 (0x0004)
	FVector2D                                                                                            NeckToEyeDistance;                                 // 0x0024 (0x0008)
	TArray<FHmdUserProfileField>                                                                         ExtraFields;                                       // 0x002C (0x000C)

	static class UScriptStruct* StaticStruct();
};

