#pragma once
#include "FN_Basic.h"

#include "FN_OnlineSubsystem_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: OnlineSubsystem
*/

// ScriptStruct /Script/OnlineSubsystem.InAppPurchaseProductInfo
// 0x0078 (0x0078)
struct FInAppPurchaseProductInfo
{
	FString                                                                                              Identifier;                                        // 0x0000 (0x000C)
	FString                                                                                              TransactionIdentifier;                             // 0x000C (0x000C)
	FString                                                                                              DisplayName;                                       // 0x0018 (0x000C)
	FString                                                                                              DisplayDescription;                                // 0x0024 (0x000C)
	FString                                                                                              DisplayPrice;                                      // 0x0030 (0x000C)
	FString                                                                                              CurrencyCode;                                      // 0x003C (0x000C)
	FString                                                                                              CurrencySymbol;                                    // 0x0048 (0x000C)
	FString                                                                                              DecimalSeparator;                                  // 0x0054 (0x000C)
	FString                                                                                              GroupingSeparator;                                 // 0x0060 (0x000C)
	FString                                                                                              ReceiptData;                                       // 0x006C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystem.InAppPurchaseRestoreInfo
// 0x0018 (0x0018)
struct FInAppPurchaseRestoreInfo
{
	FString                                                                                              Identifier;                                        // 0x0000 (0x000C)
	FString                                                                                              ReceiptData;                                       // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystem.NamedInterfaceDef
// 0x0014 (0x0014)
struct FNamedInterfaceDef
{
	FName                                                                                                InterfaceName;                                     // 0x0000 (0x0008)
	FString                                                                                              InterfaceClassName;                                // 0x0008 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystem.NamedInterface
// 0x000C (0x000C)
struct FNamedInterface
{
	FName                                                                                                InterfaceName;                                     // 0x0000 (0x0008)
	class UObject*                                                                                       InterfaceObject;                                   // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystem.InAppPurchaseProductRequest
// 0x0010 (0x0010)
struct FInAppPurchaseProductRequest
{
	FString                                                                                              ProductIdentifier;                                 // 0x0000 (0x000C)
	bool                                                                                                 bIsConsumable;                                     // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystem.JoinabilitySettings
// 0x0014 (0x0014)
struct FJoinabilitySettings
{
	FName                                                                                                SessionName;                                       // 0x0000 (0x0008)
	bool                                                                                                 bPublicSearchable;                                 // 0x0008 (0x0001)
	bool                                                                                                 bAllowInvites;                                     // 0x0009 (0x0001)
	bool                                                                                                 bJoinViaPresence;                                  // 0x000A (0x0001)
	bool                                                                                                 bJoinViaPresenceFriendsOnly;                       // 0x000B (0x0001)
	int32_t                                                                                              MaxPlayers;                                        // 0x000C (0x0004)
	int32_t                                                                                              MaxPartySize;                                      // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

