#pragma once
#include "FN_Basic.h"

#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_OnlineSubsystem_enums.h"
#include "FN_OnlineSubsystem_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: OnlineSubsystemUtils
*/

// ScriptStruct /Script/OnlineSubsystemUtils.BlueprintSessionResult
// 0x0084 (0x0084)
struct FBlueprintSessionResult
{
	uint8_t                                                                                              UnknownData_0[0x84];                               // 0x0000 (0x0084) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystemUtils.PlayerReservation
// 0x0018 (0x0018)
struct FPlayerReservation
{
	FUniqueNetIdRepl                                                                                     UniqueId;                                          // 0x0000 (0x0008)
	FString                                                                                              ValidationStr;                                     // 0x0008 (0x000C)
	float                                                                                                ElapsedTime;                                       // 0x0014 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystemUtils.PartyReservation
// 0x0018 (0x0018)
struct FPartyReservation
{
	int32_t                                                                                              TeamNum;                                           // 0x0000 (0x0004)
	FUniqueNetIdRepl                                                                                     PartyLeader;                                       // 0x0004 (0x0008)
	TArray<FPlayerReservation>                                                                           PartyMembers;                                      // 0x000C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/OnlineSubsystemUtils.PIELoginSettingsInternal
// 0x0030 (0x0030)
struct FPIELoginSettingsInternal
{
	FString                                                                                              ID;                                                // 0x0000 (0x000C)
	FString                                                                                              Token;                                             // 0x000C (0x000C)
	FString                                                                                              Type;                                              // 0x0018 (0x000C)
	TArray<uint8_t>                                                                                      TokenBytes;                                        // 0x0024 (0x000C)

	static class UScriptStruct* StaticStruct();
};

