#pragma once
#include "FN_Basic.h"

#include "FN_PowerRequirement_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PowerRequirement
*/

// WidgetBlueprintGeneratedClass /Game/UI/Theater/PowerRequirement.PowerRequirement_C
// 0x0018 (0x01D0)
class UPowerRequirement_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UHorizontalBox*                                                                                PowerRequirementHB;                                // 0x01BC (0x0004)
	class URatingWidget_C*                                                                               RatingWidget;                                      // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    TextBlock;                                         // 0x01C4 (0x0004)
	int32_t                                                                                              RecommendedPower;                                  // 0x01C8 (0x0004)
	int32_t                                                                                              RequiredPower;                                     // 0x01CC (0x0004)
public:
	class UWidget* GenerateToolTipWidget(); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:GenerateToolTipWidget
	void SetUIForRequired(int32_t PartyPower); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:SetUIForRequired
	void SetUIForRecommended(int32_t PartyPower); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:SetUIForRecommended
	void Update(int32_t TeamPower); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:Update
	void SetRequirements(int32_t RequiredPower, int32_t RecommendedPower); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:SetRequirements
	void Construct(); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:Construct
	void HandleTeamPowerChanged(int32_t TeamPower, int32_t PersonalPower); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:HandleTeamPowerChanged
	void ExecuteUbergraph_PowerRequirement(int32_t EntryPoint); // Function /Game/UI/Theater/PowerRequirement.PowerRequirement_C:ExecuteUbergraph_PowerRequirement
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Theater/PowerRequirement.PLACEHOLDER-CLASS__RatingWidget_C_138
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__RatingWidget_C_138
{
public:
	static class UClass* StaticClass();
};

