#pragma once
#include "FN_Basic.h"

#include "FN_Party_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Party
*/

// ScriptStruct /Script/Party.PartyState
// 0x0008 (0x0008)
struct FPartyState
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	EPartyType                                                                                           PartyType;                                         // 0x0004 (0x0001)
	bool                                                                                                 bLeaderFriendsOnly;                                // 0x0005 (0x0001)
	bool                                                                                                 bLeaderInvitesOnly;                                // 0x0006 (0x0001)
	uint8_t                                                                                              UnknownData_7[0x1];                                // 0x0007 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Party.PartyMemberRepState
// 0x0004 (0x0004)
struct FPartyMemberRepState
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

