#pragma once
#include "FN_Basic.h"

#include "FN_Party_enums.h"
#include "FN_Party_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Party
*/

// Class /Script/Party.PartyGameState
// 0x0214 (0x0230)
class UPartyGameState : public UObject
{
public:
	class UScriptStruct*                                                                                 PartyStateRefDef;                                  // 0x001C (0x0004)
	uint8_t                                                                                              UnknownData_20[0x4];                               // 0x0020 (0x0004) MISSED OFFSET
	FUniqueNetIdRepl                                                                                     OwningUserId;                                      // 0x0024 (0x0008)
	uint8_t                                                                                              UnknownData_2C[0x88];                              // 0x002C (0x0088) MISSED OFFSET
	bool                                                                                                 bDebugAcceptingMembers;                            // 0x00B4 (0x0001)
	uint8_t                                                                                              UnknownData_B5[0xC];                               // 0x00B5 (0x000C) MISSED OFFSET
	bool                                                                                                 bStayWithPartyOnDisconnect;                        // 0x00C1 (0x0001)
	uint8_t                                                                                              UnknownData_C2[0x2];                               // 0x00C2 (0x0002) MISSED OFFSET
	class UClass*                                                                                        PartyMemberStateClass;                             // 0x00C4 (0x0004)
	uint8_t                                                                                              UnknownData_C8[0xC0];                              // 0x00C8 (0x00C0) MISSED OFFSET
	class UClass*                                                                                        ReservationBeaconClientClass;                      // 0x0188 (0x0004)
	class APartyBeaconClient*                                                                            ReservationBeaconClient;                           // 0x018C (0x0004)
	uint8_t                                                                                              UnknownData_190[0xA0];                             // 0x0190 (0x00A0) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Party.Party
// 0x01B8 (0x01D4)
class UParty : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x44];                              // 0x001C (0x0044) MISSED OFFSET
	int32_t                                                                                              DefaultMaxPartySize;                               // 0x0060 (0x0004)
	bool                                                                                                 bLeavingPersistentParty;                           // 0x0064 (0x0001)
	uint8_t                                                                                              UnknownData_65[0x16F];                             // 0x0065 (0x016F) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Party.PartyMemberState
// 0x0024 (0x0040)
class UPartyMemberState : public UObject
{
public:
	FUniqueNetIdRepl                                                                                     UniqueId;                                          // 0x001C (0x0008)
	FText                                                                                                DisplayName;                                       // 0x0024 (0x000C)
	class UScriptStruct*                                                                                 MemberStateRefDef;                                 // 0x0030 (0x0004)
	uint8_t                                                                                              UnknownData_34[0x8];                               // 0x0034 (0x0008) MISSED OFFSET
	bool                                                                                                 bHasAnnouncedJoin;                                 // 0x003C (0x0001)
	uint8_t                                                                                              UnknownData_3D[0x3];                               // 0x003D (0x0003) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

