#pragma once
#include "FN_Basic.h"

#include "FN_PlayerPawn_Generic_Parent_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PlayerPawn_Generic_Parent
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C
// 0x0074 (0x0CE4)
class APlayerPawn_Generic_Parent_C : public AFortPlayerPawn
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0C70 (0x0004)
	TArray<class UMaterialInterface*>                                                                    Default_Weapon_Materials;                          // 0x0C74 (0x000C)
	TArray<class UMaterialInstance*>                                                                     PawnBackpackMaterials;                             // 0x0C80 (0x000C)
	TArray<class UMaterialInstance*>                                                                     PawnHatMaterials;                                  // 0x0C8C (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnHeadMaterials;                                 // 0x0C98 (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnBodyMaterials;                                 // 0x0CA4 (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnCharmMaterials;                                // 0x0CB0 (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnFaceMaterials;                                 // 0x0CBC (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnLegsMaterials;                                 // 0x0CC8 (0x000C)
	TArray<class UMaterialInterface*>                                                                    PawnTorsoMaterials;                                // 0x0CD4 (0x000C)
	class UPostProcessComponent*                                                                         PlayerPostProcessFX;                               // 0x0CE0 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C:ReceiveBeginPlay
	void ExecuteUbergraph_PlayerPawn_Generic_Parent(int32_t EntryPoint); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Generic_Parent.PlayerPawn_Generic_Parent_C:ExecuteUbergraph_PlayerPawn_Generic_Parent
public:
	static class UClass* StaticClass();
};

