#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PurchaseFlow
*/

// ScriptStruct /Script/PurchaseFlow.PurchaseFlowItem
// 0x0024 (0x0024)
struct FPurchaseFlowItem
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)
	FString                                                                                              EntitlementId;                                     // 0x000C (0x000C)
	FString                                                                                              ValidationInfo;                                    // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/PurchaseFlow.PurchaseFlowOffer
// 0x0028 (0x0028)
struct FPurchaseFlowOffer
{
	FString                                                                                              OfferNamespace;                                    // 0x0000 (0x000C)
	FString                                                                                              OfferId;                                           // 0x000C (0x000C)
	int32_t                                                                                              Quantity;                                          // 0x0018 (0x0004)
	TArray<FPurchaseFlowItem>                                                                            Items;                                             // 0x001C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/PurchaseFlow.PurchaseFlowReceiptParam
// 0x0024 (0x0024)
struct FPurchaseFlowReceiptParam
{
	FString                                                                                              TransactionId;                                     // 0x0000 (0x000C)
	FString                                                                                              TransactionState;                                  // 0x000C (0x000C)
	TArray<FPurchaseFlowOffer>                                                                           Offers;                                            // 0x0018 (0x000C)

	static class UScriptStruct* StaticStruct();
};

