#pragma once
#include "FN_Basic.h"

#include "FN_PortalServices_enums.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PortalServices
*/

// ScriptStruct /Script/PortalServices.PortalUserIsEntitledToItemResult
// 0x0010 (0x0010)
struct FPortalUserIsEntitledToItemResult
{
	FString                                                                                              ItemId;                                            // 0x0000 (0x000C)
	bool                                                                                                 IsEntitled;                                        // 0x000C (0x0001)
	EEntitlementCacheLevelRetrieved                                                                      RetrievedFromCacheLevel;                           // 0x000D (0x0001)
	uint8_t                                                                                              UnknownData_E[0x2];                                // 0x000E (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/PortalServices.PortalUserDetails
// 0x0028 (0x0028)
struct FPortalUserDetails
{
	FText                                                                                                DisplayName;                                       // 0x0000 (0x000C)
	FText                                                                                                Email;                                             // 0x000C (0x000C)
	FText                                                                                                RealName;                                          // 0x0018 (0x000C)
	bool                                                                                                 IsSignedIn;                                        // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

