#pragma once
#include "FN_Basic.h"

#include "FN_PlayerPawn_Outlander_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_E_Outlander_FragmentTypes_enums.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_GameplayAbilities_enums.h"
#include "FN_GameplayAbilities_structs.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"
#include "FN_PlayerPawn_Generic_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PlayerPawn_Outlander
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C
// 0x026C (0x11AC)
class APlayerPawn_Outlander_C : public APlayerPawn_Generic_C
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0F40 (0x0004)
	class UBoxComponent*                                                                                 AntiMaterialHitBox;                                // 0x0F44 (0x0004)
	class USphereComponent*                                                                              KeenEyesRadius;                                    // 0x0F48 (0x0004)
	class UParticleSystemComponent*                                                                      P_Outlander_PhaseShift_Impact_01;                  // 0x0F4C (0x0004)
	class USkeletalMeshComponent*                                                                        Effect_HeadSkeletalMesh;                           // 0x0F50 (0x0004)
	class USkeletalMeshComponent*                                                                        Effect_BodySkeletalMesh;                           // 0x0F54 (0x0004)
	float                                                                                                PhaseShiftHitSweep_Sweep_81A0178F416D1106B841D9A9B7E8C737; // 0x0F58 (0x0004)
	ETimelineDirection                                                                                   PhaseShiftHitSweep__Direction_81A0178F416D1106B841D9A9B7E8C737; // 0x0F5C (0x0001)
	uint8_t                                                                                              UnknownData_F5D[0x3];                              // 0x0F5D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            PhaseShiftHitSweep;                                // 0x0F60 (0x0004)
	float                                                                                                Phase_Shift_Activation_Timeline_Sweep_6D72A2BD427987D65B765788F442228C; // 0x0F64 (0x0004)
	float                                                                                                Phase_Shift_Activation_Timeline_Opacity_6D72A2BD427987D65B765788F442228C; // 0x0F68 (0x0004)
	ETimelineDirection                                                                                   Phase_Shift_Activation_Timeline__Direction_6D72A2BD427987D65B765788F442228C; // 0x0F6C (0x0001)
	uint8_t                                                                                              UnknownData_F6D[0x3];                              // 0x0F6D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Phase_Shift_Activation_Timeline;                   // 0x0F70 (0x0004)
	class UParticleSystem*                                                                               P_FragmentActivation;                              // 0x0F74 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Core_Index_0;                                      // 0x0F78 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Core_Index_1;                                      // 0x0F7C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Core_Index_2;                                      // 0x0F80 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Diamond_Index3;                                    // 0x0F84 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Diamond_Index4;                                    // 0x0F88 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Diamond_Index5;                                    // 0x0F8C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Sparkles_Index8;                                   // 0x0F90 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Smoke_Index7;                                      // 0x0F94 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Diamond_Index6;                                    // 0x0F98 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Sparkles_Index9;                                   // 0x0F9C (0x0004)
	FLinearColor                                                                                         OffensiveColor1;                                   // 0x0FA0 (0x0010)
	FLinearColor                                                                                         OffensiveColor2;                                   // 0x0FB0 (0x0010)
	FLinearColor                                                                                         DefensiveColor1;                                   // 0x0FC0 (0x0010)
	FLinearColor                                                                                         DefensiveColor2;                                   // 0x0FD0 (0x0010)
	FLinearColor                                                                                         SpecialtyColor1;                                   // 0x0FE0 (0x0010)
	FLinearColor                                                                                         SpecialtyColor2;                                   // 0x0FF0 (0x0010)
	FGameplayTagContainer                                                                                TC_SpecialityBuff;                                 // 0x1000 (0x0018)
	FGameplayTagContainer                                                                                TC_DefensiveBuff;                                  // 0x1018 (0x0018)
	FGameplayTagContainer                                                                                TC_OffensiveBuff;                                  // 0x1030 (0x0018)
	E_Outlander_FragmentTypes                                                                            FragType;                                          // 0x1048 (0x0001)
	uint8_t                                                                                              UnknownData_1049[0x3];                             // 0x1049 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               P_FragmentOffense;                                 // 0x104C (0x0004)
	class UParticleSystem*                                                                               P_FragmentDefense;                                 // 0x1050 (0x0004)
	class UParticleSystem*                                                                               P_FragmentSpeciality;                              // 0x1054 (0x0004)
	class UParticleSystem*                                                                               P_InTheZone_Activate;                              // 0x1058 (0x0004)
	bool                                                                                                 OnPlayerBuiltFloor;                                // 0x105C (0x0001)
	uint8_t                                                                                              UnknownData_105D[0x3];                             // 0x105D (0x0003) MISSED OFFSET
	FGameplayEventData                                                                                   EventData;                                         // 0x1060 (0x0058)
	FGameplayTag                                                                                         EventNeedRoadsActivate;                            // 0x10B8 (0x0008)
	FGameplayTag                                                                                         EventNeedRoadsDeactivate;                          // 0x10C0 (0x0008)
	FGameplayTagContainer                                                                                TC_WhereWeregoingWeNeedRoads;                      // 0x10C8 (0x0018)
	class UParticleSystem*                                                                               P_Fragment;                                        // 0x10E0 (0x0004)
	class UParticleSystem*                                                                               P_Specialty;                                       // 0x10E4 (0x0004)
	class UParticleSystem*                                                                               P_Defensive;                                       // 0x10E8 (0x0004)
	class UParticleSystem*                                                                               P_Offensive;                                       // 0x10EC (0x0004)
	FFortFeedbackHandle                                                                                  Feedback_ShardGet;                                 // 0x10F0 (0x0010)
	FFortFeedbackHandle                                                                                  Feedback_OffensiveShard;                           // 0x1100 (0x0010)
	FFortFeedbackHandle                                                                                  Feedback_DefensiveShard;                           // 0x1110 (0x0010)
	FFortFeedbackHandle                                                                                  Feedback_SpecialtyShard;                           // 0x1120 (0x0010)
	class USoundBase*                                                                                    Sound_Frg_Offensive_Start;                         // 0x1130 (0x0004)
	class USoundBase*                                                                                    Sound_Frg_Defensive_Start;                         // 0x1134 (0x0004)
	class USoundBase*                                                                                    Sound_Frg_Resource_Start;                          // 0x1138 (0x0004)
	class USoundBase*                                                                                    Sound_Frg_Stop;                                    // 0x113C (0x0004)
	class USoundBase*                                                                                    Sound_Frg_Collect;                                 // 0x1140 (0x0004)
	class UParticleSystem*                                                                               P_InTheZone_Running;                               // 0x1144 (0x0004)
	class UParticleSystem*                                                                               P_InTheZone_Hit;                                   // 0x1148 (0x0004)
	FName                                                                                                Spawn_Color;                                       // 0x114C (0x0008)
	TArray<class UMaterialInstanceDynamic*>                                                              Head_Effect_Mesh_Materials;                        // 0x1154 (0x000C)
	TArray<class UMaterialInstanceDynamic*>                                                              Body_Effect_Mesh_Materials;                        // 0x1160 (0x000C)
	class UMaterialInterface*                                                                            Phase_Shift_Material_;                             // 0x116C (0x0004)
	class UParticleSystem*                                                                               PhaseShiftActivateParticles;                       // 0x1170 (0x0004)
	bool                                                                                                 bPhaseShiftActive_;                                // 0x1174 (0x0001)
	uint8_t                                                                                              UnknownData_1175[0x3];                             // 0x1175 (0x0003) MISSED OFFSET
	class UParticleSystem*                                                                               KnockKnockFX;                                      // 0x1178 (0x0004)
	class UParticleSystem*                                                                               P_Handtrail;                                       // 0x117C (0x0004)
	class UParticleSystem*                                                                               P_AMCDustKickup;                                   // 0x1180 (0x0004)
	class UParticleSystem*                                                                               P_AMCShockwave;                                    // 0x1184 (0x0004)
	class UParticleSystemComponent*                                                                      P_Handtrail_Active;                                // 0x1188 (0x0004)
	class UParticleSystem*                                                                               P_ArmThruster;                                     // 0x118C (0x0004)
	class UParticleSystemComponent*                                                                      P_Arm_Thuster_Active;                              // 0x1190 (0x0004)
	class USoundBase*                                                                                    ChargeUpSoundCue;                                  // 0x1194 (0x0004)
	class UAudioComponent*                                                                               ChargeUpAudioComp;                                 // 0x1198 (0x0004)
	class UClass*                                                                                        ChargeUpCameraShake;                               // 0x119C (0x0004)
	class USoundCue*                                                                                     AMCImpactEnemySound;                               // 0x11A0 (0x0004)
	class USoundCue*                                                                                     AMCImpactBuildingSound;                            // 0x11A4 (0x0004)
	class UClass*                                                                                        AMCImpactCameraShake;                              // 0x11A8 (0x0004)
public:
	void OnRep_OnPlayerBuiltFloor(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:OnRep_OnPlayerBuiltFloor
	void UserConstructionScript(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:UserConstructionScript
	void Phase_Shift_Activation_Timeline__FinishedFunc(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:Phase Shift Activation Timeline__FinishedFunc
	void Phase_Shift_Activation_Timeline__UpdateFunc(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:Phase Shift Activation Timeline__UpdateFunc
	void PhaseShiftHitSweep__FinishedFunc(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:PhaseShiftHitSweep__FinishedFunc
	void PhaseShiftHitSweep__UpdateFunc(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:PhaseShiftHitSweep__UpdateFunc
	void GameplayCue_Explorer_Fragment(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Explorer.Fragment
	void GameplayCue_Outlander_InTheZone_FX(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Outlander.InTheZone.FX
	void OnBaseChanged(class AActor* NewBase); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:OnBaseChanged
	void ReceivePossessed(class AController* NewController); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:ReceivePossessed
	void GameplayCue_Explorer_Fragment_Offense_PickupFX(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Explorer.Fragment.Offense.PickupFX
	void GameplayCue_Explorer_Fragment_Defense_PickupFX(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Explorer.Fragment.Defense.PickupFX
	void GameplayCue_Explorer_Fragment_Specialty_PickupFX(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Explorer.Fragment.Specialty.PickupFX
	void WithinReachOfTreasure(FLinearColor VSpawnColor, bool Activate); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:WithinReachOfTreasure
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier1(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier1
	void GameplayCue_Abilities_Activation_Generic_HarvestBuff_Tier2(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Generic.HarvestBuff.Tier2
	void GameplayCue_Outlander_PhaseShift_AppliedFX(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Outlander.PhaseShift.AppliedFX
	void RefreshIcons(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:RefreshIcons
	void OnCharacterPartsReinitialized(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:OnCharacterPartsReinitialized
	void OnDamagePlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:OnDamagePlayEffects
	void EventOnDamagePlayFX(); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:EventOnDamagePlayFX
	void GameplayCue_Outlander_KnockKnock(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Outlander.KnockKnock
	void GameplayCue_Abilities_Activation_Outlander_AntiMaterialCharge(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Outlander.AntiMaterialCharge
	void GameplayCue_Abilities_Activation_Outlander_AntiMaterialChargeThruster(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Outlander.AntiMaterialChargeThruster
	void GameplayCue_Abilities_Activation_Outlander_AntiMaterialChargeChargeUp(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Outlander.AntiMaterialChargeChargeUp
	void GameplayCue_Abilities_Activation_Outlander_AntiMaterialChargeImpact(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:GameplayCue.Abilities.Activation.Outlander.AntiMaterialChargeImpact
	void ExecuteUbergraph_PlayerPawn_Outlander(int32_t EntryPoint); // Function /Game/Abilities/Player/Pawns/PlayerPawn_Outlander.PlayerPawn_Outlander_C:ExecuteUbergraph_PlayerPawn_Outlander
public:
	static class UClass* StaticClass();
};

