#pragma once
#include "FN_Basic.h"

#include "FN_Prop_Explorer_OutlanderFragment_Llama_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Prop_Explorer_OutlanderFragment_Llama
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C
// 0x0189 (0x0ACD)
class AProp_Explorer_OutlanderFragment_Llama_C : public ABuildingProp
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0944 (0x0004)
	class USkeletalMeshComponent*                                                                        LLama_SkeletalMesh;                                // 0x0948 (0x0004)
	class UProjectileMovementComponent*                                                                  MovementComponent;                                 // 0x094C (0x0004)
	float                                                                                                Timeline_0_LlamaScaleIn_CF0E7B9444C376CC817787B0D8C3D666; // 0x0950 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_CF0E7B9444C376CC817787B0D8C3D666; // 0x0954 (0x0001)
	uint8_t                                                                                              UnknownData_955[0x3];                              // 0x0955 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0958 (0x0004)
	float                                                                                                TotalDamage;                                       // 0x095C (0x0004)
	float                                                                                                MaxDamage;                                         // 0x0960 (0x0004)
	float                                                                                                WoodThreshold;                                     // 0x0964 (0x0004)
	float                                                                                                StoneThreshold;                                    // 0x0968 (0x0004)
	float                                                                                                MetalThreshold;                                    // 0x096C (0x0004)
	float                                                                                                RareThreshold;                                     // 0x0970 (0x0004)
	int32_t                                                                                              IntWoodSpawn;                                      // 0x0974 (0x0004)
	int32_t                                                                                              IntStoneSpawn;                                     // 0x0978 (0x0004)
	int32_t                                                                                              IntMetalSpawn;                                     // 0x097C (0x0004)
	int32_t                                                                                              IntRarespawn;                                      // 0x0980 (0x0004)
	float                                                                                                MinRandomVector;                                   // 0x0984 (0x0004)
	float                                                                                                MaxRandomVector;                                   // 0x0988 (0x0004)
	class UFortWorldItemDefinition*                                                                      CrystalType;                                       // 0x098C (0x0004)
	float                                                                                                Min_Percent;                                       // 0x0990 (0x0004)
	float                                                                                                Max_Percent;                                       // 0x0994 (0x0004)
	float                                                                                                BlackPercent;                                      // 0x0998 (0x0004)
	float                                                                                                GreenPercent;                                      // 0x099C (0x0004)
	float                                                                                                RedPercent;                                        // 0x09A0 (0x0004)
	float                                                                                                YellowPercent;                                     // 0x09A4 (0x0004)
	bool                                                                                                 HasDiamonds;                                       // 0x09A8 (0x0001)
	uint8_t                                                                                              UnknownData_9A9[0x3];                              // 0x09A9 (0x0003) MISSED OFFSET
	int32_t                                                                                              IntIntIngrediantSpawn;                             // 0x09AC (0x0004)
	int32_t                                                                                              MaxStone;                                          // 0x09B0 (0x0004)
	class UFortIngredientItemDefinition*                                                                 Item_Ingrediant;                                   // 0x09B4 (0x0004)
	class USoundBase*                                                                                    Cue_HitSound;                                      // 0x09B8 (0x0004)
	int32_t                                                                                              MaxWood;                                           // 0x09BC (0x0004)
	float                                                                                                DealtDamage;                                       // 0x09C0 (0x0004)
	int32_t                                                                                              SpawnedWood;                                       // 0x09C4 (0x0004)
	int32_t                                                                                              CurrentWood;                                       // 0x09C8 (0x0004)
	float                                                                                                DamageRemainder;                                   // 0x09CC (0x0004)
	int32_t                                                                                              CurrentSpawned;                                    // 0x09D0 (0x0004)
	float                                                                                                SpawnThreshold;                                    // 0x09D4 (0x0004)
	float                                                                                                CarryOverDamage;                                   // 0x09D8 (0x0004)
	bool                                                                                                 TestNewDamage;                                     // 0x09DC (0x0001)
	uint8_t                                                                                              UnknownData_9DD[0x3];                              // 0x09DD (0x0003) MISSED OFFSET
	float                                                                                                TempDealtDamage;                                   // 0x09E0 (0x0004)
	int32_t                                                                                              NumSpawnGroups;                                    // 0x09E4 (0x0004)
	bool                                                                                                 FinishSpawning;                                    // 0x09E8 (0x0001)
	uint8_t                                                                                              UnknownData_9E9[0x3];                              // 0x09E9 (0x0003) MISSED OFFSET
	class UFortWorldItemDefinition*                                                                      Wood;                                              // 0x09EC (0x0004)
	class UFortWorldItemDefinition*                                                                      Stone;                                             // 0x09F0 (0x0004)
	bool                                                                                                 NewVar;                                            // 0x09F4 (0x0001)
	uint8_t                                                                                              UnknownData_9F5[0x3];                              // 0x09F5 (0x0003) MISSED OFFSET
	int32_t                                                                                              CurrentStone;                                      // 0x09F8 (0x0004)
	int32_t                                                                                              MaxMetal;                                          // 0x09FC (0x0004)
	int32_t                                                                                              CurrentMetal;                                      // 0x0A00 (0x0004)
	class UFortWorldItemDefinition*                                                                      Metal;                                             // 0x0A04 (0x0004)
	float                                                                                                IngrediantSpawnThreshold;                          // 0x0A08 (0x0004)
	int32_t                                                                                              CurrentIngrediant;                                 // 0x0A0C (0x0004)
	int32_t                                                                                              MaxIngrediant;                                     // 0x0A10 (0x0004)
	class UClass*                                                                                        GE_DiamondsHealthMod;                              // 0x0A14 (0x0004)
	FFortFeedbackHandle                                                                                  FeedbackPain;                                      // 0x0A18 (0x0010)
	class UAnimMontage*                                                                                  Anim_Deploy;                                       // 0x0A28 (0x0004)
	class USoundBase*                                                                                    PinataPain;                                        // 0x0A2C (0x0004)
	class USoundBase*                                                                                    PinataSpawn;                                       // 0x0A30 (0x0004)
	class USoundBase*                                                                                    DeathCue;                                          // 0x0A34 (0x0004)
	bool                                                                                                 PlayDeathSound;                                    // 0x0A38 (0x0001)
	uint8_t                                                                                              UnknownData_A39[0x3];                              // 0x0A39 (0x0003) MISSED OFFSET
	class UClass*                                                                                        HeadProjectile;                                    // 0x0A3C (0x0004)
	FName                                                                                                ProjectileSpawnLocation;                           // 0x0A40 (0x0008)
	class AFortProjectileBase*                                                                           ProjectileReturnValue;                             // 0x0A48 (0x0004)
	float                                                                                                ProjectileSpeedLow;                                // 0x0A4C (0x0004)
	float                                                                                                ProjectileSpeedHigh;                               // 0x0A50 (0x0004)
	class UParticleSystem*                                                                               DeathConfetti_Effects;                             // 0x0A54 (0x0004)
	FName                                                                                                DeathFX_SocketName;                                // 0x0A58 (0x0008)
	class UParticleSystem*                                                                               HitConfetti_Effects;                               // 0x0A60 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_Index_01;                                      // 0x0A64 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_Index_02;                                      // 0x0A68 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_Index_03;                                      // 0x0A6C (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_Index_00;                                      // 0x0A70 (0x0004)
	bool                                                                                                 LlamaSkelMeshVisibility;                           // 0x0A74 (0x0001)
	uint8_t                                                                                              UnknownData_A75[0x3];                              // 0x0A75 (0x0003) MISSED OFFSET
	class UAnimSequence*                                                                                 LlamaDeath_FirstAnim;                              // 0x0A78 (0x0004)
	float                                                                                                Llama_BodyOpacityMask;                             // 0x0A7C (0x0004)
	class UMaterialInterface*                                                                            OverrideStaticMeshMat;                             // 0x0A80 (0x0004)
	float                                                                                                Llama_Lifespan;                                    // 0x0A84 (0x0004)
	TArray<class UMaterialInstanceDynamic*>                                                              MIDs;                                              // 0x0A88 (0x000C)
	float                                                                                                DeathDelay;                                        // 0x0A94 (0x0004)
	class UParticleSystem*                                                                               LlamaDeathLoop;                                    // 0x0A98 (0x0004)
	class UStaticMeshComponent*                                                                          Eyes01;                                            // 0x0A9C (0x0004)
	class UStaticMeshComponent*                                                                          Eyes02;                                            // 0x0AA0 (0x0004)
	class UStaticMeshComponent*                                                                          Eyes01_Skeletal;                                   // 0x0AA4 (0x0004)
	class UStaticMeshComponent*                                                                          Eyes02_Skeletal;                                   // 0x0AA8 (0x0004)
	bool                                                                                                 IsDying;                                           // 0x0AAC (0x0001)
	uint8_t                                                                                              UnknownData_AAD[0x3];                              // 0x0AAD (0x0003) MISSED OFFSET
	class UParticleSystemComponent*                                                                      Llama_Death_Loop_Spawned;                          // 0x0AB0 (0x0004)
	bool                                                                                                 PinataExpired;                                     // 0x0AB4 (0x0001)
	uint8_t                                                                                              UnknownData_AB5[0x3];                              // 0x0AB5 (0x0003) MISSED OFFSET
	class UAnimSequence*                                                                                 LlamaDeath_SecondAnim;                             // 0x0AB8 (0x0004)
	bool                                                                                                 KillParticle;                                      // 0x0ABC (0x0001)
	uint8_t                                                                                              UnknownData_ABD[0x3];                              // 0x0ABD (0x0003) MISSED OFFSET
	class ULlamaAnim_BP_C*                                                                               Llama_Anim_BP;                                     // 0x0AC0 (0x0004)
	class UStaticMeshComponent*                                                                          Building_Static_Mesh_Component;                    // 0x0AC4 (0x0004)
	int32_t                                                                                              Number_Of_llam_mesh_materials;                     // 0x0AC8 (0x0004)
	bool                                                                                                 Headspawned;                                       // 0x0ACC (0x0001)
public:
	void ShowHideModels(bool Show_SkeletalMesh); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:ShowHideModels
	void OnRep_KillParticle(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnRep_KillParticle
	void Llama_Lifespan_Expired(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:Llama_Lifespan_Expired
	void CreateAndAttachEyes(class USkeletalMeshComponent* Skeletal_Mesh); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:CreateAndAttachEyes
	void SpawnHeadProjectile(class USkeletalMeshComponent* SkeletalMesh); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:SpawnHeadProjectile
	void SetupDiamonds(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:SetupDiamonds
	void Spawn_Death_Ingrediants(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:Spawn Death Ingrediants
	void SpawnRareCrystals(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:SpawnRareCrystals
	void ConvertDamageToResources(float Dealt_Damage, float Damage_Threshold, float Spawn_Threshold, int32_t MaxSpawnGroups, int32_t AmountSpawnGroups, class UFortWorldItemDefinition* SpawnItem, int32_t CurrentSpawned, float CarryOverDamage, float DamageRemainder, int32_t AmountSpawned, bool FinishedSpawning); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:ConvertDamageToResources
	void RollIngrediants(class UFortIngredientItemDefinition* SpawnItem); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:RollIngrediants
	void RollCrystalType(class UFortWorldItemDefinition* RareCrystal); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:RollCrystalType
	void UserConstructionScript(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:Timeline_0__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:ReceiveBeginPlay
	void OnDamageServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnDamageServer
	void OnDeathServer(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnDeathServer
	void DefaultLlama(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:DefaultLlama
	void DiamondsLlama(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:DiamondsLlama
	void OnDamagePlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnDamagePlayEffects
	void OnDeathPlayEffects(float Damage, FGameplayTagContainer DamageTags, FVector Momentum, FHitResult HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, FGameplayEffectContextHandle EffectContext); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnDeathPlayEffects
	void OnBounceAnimationUpdate(FFortBounceData Data); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:OnBounceAnimationUpdate
	void TheHeadWasSpawnedOnTheServerCallback(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:TheHeadWasSpawnedOnTheServerCallback
	void LlamaDeathMontageIsComplete(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:LlamaDeathMontageIsComplete
	void The_First_Llama_Death_Animation_is_Finished(); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:The First Llama Death Animation is Finished
	void ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama(int32_t EntryPoint); // Function /Game/Abilities/Player/Outlander/Gadgets/Fragment/Prop_Explorer_OutlanderFragment_Llama.Prop_Explorer_OutlanderFragment_Llama_C:ExecuteUbergraph_Prop_Explorer_OutlanderFragment_Llama
public:
	static class UClass* StaticClass();
};

