#pragma once
#include "FN_Basic.h"

#include "FN_PartyCharacterPlacementHelper_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PartyCharacterPlacementHelper
*/

// BlueprintGeneratedClass /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C
// 0x0028 (0x0268)
class APartyCharacterPlacementHelper_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UWidgetComponent*                                                                              HeroBasicInfo;                                     // 0x0244 (0x0004)
	class UWidgetComponent*                                                                              GadgetSelector;                                    // 0x0248 (0x0004)
	class UStaticMeshComponent*                                                                          CharacterPlacement;                                // 0x024C (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x0250 (0x0004)
	int32_t                                                                                              PlayerID;                                          // 0x0254 (0x0004)
	bool                                                                                                 PreviewMesh;                                       // 0x0258 (0x0001)
	uint8_t                                                                                              UnknownData_259[0x3];                              // 0x0259 (0x0003) MISSED OFFSET
	class UStaticMesh*                                                                                   Mesh;                                              // 0x025C (0x0004)
	class UGadgetDisplayBar_C*                                                                           HeroBasicInfoWidget;                               // 0x0260 (0x0004)
	class UGadgetSelectBar_C*                                                                            GadgetSelectorWidget;                              // 0x0264 (0x0004)
public:
	void InitGadgetSelectorWidget(); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:InitGadgetSelectorWidget
	void InitWidgetComponents(); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:InitWidgetComponents
	void HandleFrontEndCameraChanged(EFrontEndCamera InNewCamera, EFrontEndCamera InOldCamera); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:HandleFrontEndCameraChanged
	void InitHeroBasicInfoWidget(); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:InitHeroBasicInfoWidget
	void UserConstructionScript(); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:ReceiveBeginPlay
	void ExecuteUbergraph_PartyCharacterPlacementHelper(int32_t EntryPoint); // Function /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C:ExecuteUbergraph_PartyCharacterPlacementHelper
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PLACEHOLDER-CLASS__GadgetSelectBar_C_141
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__GadgetSelectBar_C_141
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/Environments/FrontEnd/Blueprints/PartyCharacterPlacementHelper.PLACEHOLDER-CLASS__GadgetDisplayBar_C_142
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__GadgetDisplayBar_C_142
{
public:
	static class UClass* StaticClass();
};

