#pragma once
#include "FN_Basic.h"

#include "FN_ProjectileHuskLobber_Poison_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"
#include "FN_GameplayTags_enums.h"
#include "FN_GameplayTags_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ProjectileHuskLobber_Poison
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C
// 0x00D8 (0x04F0)
class AProjectileHuskLobber_Poison_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class USphereComponent*                                                                              PoisonArea;                                        // 0x041C (0x0004)
	class UAudioComponent*                                                                               LobberProjPoisonLoopingSound;                      // 0x0420 (0x0004)
	class UParticleSystemComponent*                                                                      ProjectileParticleSystem;                          // 0x0424 (0x0004)
	class UAudioComponent*                                                                               PoisonGasSoundLoop;                                // 0x0428 (0x0004)
	class UParticleSystemComponent*                                                                      PoisonCloudParticleSystemComponent;                // 0x042C (0x0004)
	float                                                                                                Timeline_0_Fade_2E79945F4D4A804FEBAEF28A5AC06C31;  // 0x0430 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_2E79945F4D4A804FEBAEF28A5AC06C31; // 0x0434 (0x0001)
	uint8_t                                                                                              UnknownData_435[0x3];                              // 0x0435 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0438 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Trail_Material;                                    // 0x043C (0x0004)
	class UParticleSystem*                                                                               Effect_Explosion;                                  // 0x0440 (0x0004)
	float                                                                                                DebugDuration;                                     // 0x0444 (0x0004)
	float                                                                                                Radius;                                            // 0x0448 (0x0004)
	FVector                                                                                              HitLocation;                                       // 0x044C (0x000C)
	FHitResult                                                                                           ImpactHitResult;                                   // 0x0458 (0x0080)
	class UMaterialInstanceDynamic*                                                                      TrailGlow;                                         // 0x04D8 (0x0004)
	FGameplayTag                                                                                         TC_NPCStatusAOEPoison;                             // 0x04DC (0x0008)
	class UClass*                                                                                        GE_HuskAOE2StandingInPoison;                       // 0x04E4 (0x0004)
	class UClass*                                                                                        GE_HuskAOE3DOTPoison;                              // 0x04E8 (0x0004)
	class UClass*                                                                                        GE_HuskAOE4RemovePoison;                           // 0x04EC (0x0004)
public:
	void Is_Valid_Damage_Target(class AActor* CollidingActor, bool Is_Valid_Damage_Target, class AFortPawn* Valid_Pawn); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:Is Valid Damage Target
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:Timeline_0__UpdateFunc
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:ReceiveHit
	void EndCloud(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:EndCloud
	void BndEvt__PoisonArea_K2Node_ComponentBoundEvent_97_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:BndEvt__PoisonArea_K2Node_ComponentBoundEvent_97_ComponentEndOverlapSignature__DelegateSignature
	void ExecuteUbergraph_ProjectileHuskLobber_Poison(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber_Poison.ProjectileHuskLobber_Poison_C:ExecuteUbergraph_ProjectileHuskLobber_Poison
public:
	static class UClass* StaticClass();
};

