#pragma once
#include "FN_Basic.h"

#include "FN_Preview_Outlander_SpecialFragment_Llama_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Preview_Outlander_SpecialFragment_Llama
*/

// BlueprintGeneratedClass /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C
// 0x0044 (0x03A0)
class APreview_Outlander_SpecialFragment_Llama_C : public AFortDecoPreview
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x035C (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh;                                        // 0x0360 (0x0004)
	class USceneComponent*                                                                               DefaultSceneRoot;                                  // 0x0364 (0x0004)
	float                                                                                                Timeline_0_NewTrack_0_BF02AA2F47C64B26C854B2989FE34226; // 0x0368 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_BF02AA2F47C64B26C854B2989FE34226; // 0x036C (0x0001)
	uint8_t                                                                                              UnknownData_36D[0x3];                              // 0x036D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0370 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Line_MID;                                          // 0x0374 (0x0004)
	class UFortSpline*                                                                                   Fort_Spline;                                       // 0x0378 (0x0004)
	TArray<class UStaticMeshComponent*>                                                                  NewVar_0;                                          // 0x037C (0x000C)
	TArray<FVector>                                                                                      PointArray;                                        // 0x0388 (0x000C)
	class AFortPlayerPawn*                                                                               Instigating_Pawn;                                  // 0x0394 (0x0004)
	class USkeletalMeshComponent*                                                                        Instigating_Pawn_Mesh_Component;                   // 0x0398 (0x0004)
	float                                                                                                NewVar_1;                                          // 0x039C (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:Timeline_0__UpdateFunc
	void ReceiveTick(float DeltaSeconds); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:ReceiveTick
	void ReceiveBeginPlay(); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:ReceiveBeginPlay
	void ExecuteUbergraph_Preview_Outlander_SpecialFragment_Llama(int32_t EntryPoint); // Function /Game/Abilities/Player/Generic/Gadgets/Llama/Preview_Outlander_SpecialFragment_Llama.Preview_Outlander_SpecialFragment_Llama_C:ExecuteUbergraph_Preview_Outlander_SpecialFragment_Llama
public:
	static class UClass* StaticClass();
};

