#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: PortalRpc
*/

// ScriptStruct /Script/PortalRpc.PortalRpcServer
// 0x000C (0x000C)
struct FPortalRpcServer
{
	FString                                                                                              ServerAddress;                                     // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/PortalRpc.PortalRpcLocateServer
// 0x0028 (0x0028)
struct FPortalRpcLocateServer
{
	FGuid                                                                                                ProductId;                                         // 0x0000 (0x0010)
	FString                                                                                              ProductVersion;                                    // 0x0010 (0x000C)
	FString                                                                                              HostMacAddress;                                    // 0x001C (0x000C)

	static class UScriptStruct* StaticStruct();
};

