#pragma once
#include "FN_Basic.h"

#include "FN_ProjectileHuskLobber_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ProjectileHuskLobber
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C
// 0x0030 (0x0448)
class AProjectileHuskLobber_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UAudioComponent*                                                                               LobberProjLoopingSound;                            // 0x041C (0x0004)
	class UParticleSystemComponent*                                                                      ProjectileParticleSystem;                          // 0x0420 (0x0004)
	float                                                                                                Timeline_0_Fade_9959ADDF4DD77547223DFAA24A16DC9E;  // 0x0424 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_9959ADDF4DD77547223DFAA24A16DC9E; // 0x0428 (0x0001)
	uint8_t                                                                                              UnknownData_429[0x3];                              // 0x0429 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x042C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Trail_Material;                                    // 0x0430 (0x0004)
	class UParticleSystem*                                                                               Effect_Explosion;                                  // 0x0434 (0x0004)
	class UMaterialInstanceDynamic*                                                                      TrailGlow;                                         // 0x0438 (0x0004)
	FVector                                                                                              Pushed_Off_Location;                               // 0x043C (0x000C)
public:
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C:Timeline_0__UpdateFunc
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C:ReceiveHit
	void ExecuteUbergraph_ProjectileHuskLobber(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskLobber.ProjectileHuskLobber_C:ExecuteUbergraph_ProjectileHuskLobber
public:
	static class UClass* StaticClass();
};

