#pragma once
#include "FN_Basic.h"

#include "FN_ProjectileHuskRanged_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: ProjectileHuskRanged
*/

// BlueprintGeneratedClass /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C
// 0x0010 (0x0428)
class AProjectileHuskRanged_C : public AFortProjectileBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0418 (0x0004)
	class UAudioComponent*                                                                               Ranged_Projectile_Sound;                           // 0x041C (0x0004)
	class UParticleSystemComponent*                                                                      ProjectileParticleSystem;                          // 0x0420 (0x0004)
	class AActor*                                                                                        GoalActor;                                         // 0x0424 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:UserConstructionScript
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, FVector HitLocation, FVector HitNormal, FVector NormalImpulse, FHitResult Hit); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:ReceiveHit
	void ReceiveBeginPlay(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:ReceiveBeginPlay
	void ProjectileCheck(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:ProjectileCheck
	void StopHoming(); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:StopHoming
	void OnExploded(TArray<class AActor*> HitActors, TArray<FHitResult> HitResults); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:OnExploded
	void ExecuteUbergraph_ProjectileHuskRanged(int32_t EntryPoint); // Function /Game/Characters/Enemies/Husk/Blueprints/ProjectileHuskRanged.ProjectileHuskRanged_C:ExecuteUbergraph_ProjectileHuskRanged
public:
	static class UClass* StaticClass();
};

