#pragma once
#include "FN_Basic.h"

#include "FN_Qos_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Qos
*/

// ScriptStruct /Script/Qos.QosSearchPass
// 0x0010 (0x0010)
struct FQosSearchPass
{
	int32_t                                                                                              CurrentSessionIdx;                                 // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0xC];                                // 0x0004 (0x000C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Qos.QosSearchState
// 0x0014 (0x0014)
struct FQosSearchState
{
	FString                                                                                              DatacenterId;                                      // 0x0000 (0x000C)
	double                                                                                               LastDatacenterIdTimestamp;                         // 0x000C (0x0008)

	static class UScriptStruct* StaticStruct();
};

