#pragma once
#include "FN_Basic.h"

#include "FN_Qos_enums.h"
#include "FN_Qos_structs.h"
#include "FN_Qos_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_OnlineSubsystemUtils_enums.h"
#include "FN_OnlineSubsystemUtils_structs.h"
#include "FN_OnlineSubsystemUtils_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Qos
*/

// Class /Script/Qos.QosBeaconClient
// 0x0028 (0x029C)
class AQosBeaconClient : public AOnlineBeaconClient
{
public:
	uint8_t                                                                                              UnknownData_274[0x28];                             // 0x0274 (0x0028) MISSED OFFSET
public:
	void ServerQosRequest(FString InSessionId); // Function /Script/Qos.QosBeaconClient:ServerQosRequest
	void ClientQosResponse(EQosResponseType Response); // Function /Script/Qos.QosBeaconClient:ClientQosResponse
public:
	static class UClass* StaticClass();
};

// Class /Script/Qos.QosBeaconHost
// 0x000C (0x0268)
class AQosBeaconHost : public AOnlineBeaconHostObject
{
public:
	uint8_t                                                                                              UnknownData_25C[0xC];                              // 0x025C (0x000C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/Qos.QosEvaluator
// 0x005C (0x0078)
class UQosEvaluator : public UObject
{
public:
	FQosSearchState                                                                                      SearchState;                                       // 0x001C (0x0014)
	FQosSearchPass                                                                                       CurrentSearchPass;                                 // 0x0030 (0x0010)
	uint8_t                                                                                              UnknownData_40[0x18];                              // 0x0040 (0x0018) MISSED OFFSET
	class AQosBeaconClient*                                                                              QosBeaconClient;                                   // 0x0058 (0x0004)
	uint8_t                                                                                              UnknownData_5C[0x1C];                              // 0x005C (0x001C) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

