#pragma once
#include "FN_Basic.h"

#include "FN_RatingWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_RatingDisplayStyle_enums.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: RatingWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C
// 0x0B08 (0x1244)
class URatingWidget_C : public UFortBaseButton
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x073C (0x0004)
	class UImage*                                                                                        _Image__RatingIcon;                                // 0x0740 (0x0004)
	class USizeBox*                                                                                      _SizeBox_;                                         // 0x0744 (0x0004)
	class UTextBlock*                                                                                    _Text__RatingValue;                                // 0x0748 (0x0004)
	class UHorizontalBox*                                                                                HorizontalBox;                                     // 0x074C (0x0004)
	int32_t                                                                                              RatingValue;                                       // 0x0750 (0x0004)
	FFortMultiSizeBrush                                                                                  Icon_Sum;                                          // 0x0754 (0x02B8)
	FFortMultiSizeBrush                                                                                  Icon_Team;                                         // 0x0A0C (0x02B8)
	FFortMultiSizeBrush                                                                                  Icon_Default;                                      // 0x0CC4 (0x02B8)
	FFortMultiSizeBrush                                                                                  Icon;                                              // 0x0F7C (0x02B8)
	RatingDisplayStyle                                                                                   Display_Style;                                     // 0x1234 (0x0001)
	uint8_t                                                                                              UnknownData_1235[0x3];                             // 0x1235 (0x0003) MISSED OFFSET
	class UFortButtonStyle*                                                                              Style_Sum;                                         // 0x1238 (0x0004)
	class UFortButtonStyle*                                                                              Style_Team;                                        // 0x123C (0x0004)
	class UFortButtonStyle*                                                                              Style_Default;                                     // 0x1240 (0x0004)
public:
	void Redraw(); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Redraw
	void Set_Display_Style(RatingDisplayStyle New_Style); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Set Display Style
	void Set_Padding(); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Set Padding
	void Set_Size_Box(class USizeBox* Size_Box); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Set Size Box
	void Set_Icon(FFortMultiSizeBrush Icon_Brush); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Set Icon
	void Set_Rating_Value(int32_t Rating); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:Set Rating Value
	void PreConstruct(bool IsDesignTime); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:PreConstruct
	void ExecuteUbergraph_RatingWidget(int32_t EntryPoint); // Function /Game/UI/HomeBase/Rating/RatingWidget.RatingWidget_C:ExecuteUbergraph_RatingWidget
public:
	static class UClass* StaticClass();
};

