#pragma once
#include "FN_Basic.h"

#include "FN_RoboBear_AnimBP_parameters.h"
#include "FN_AnimGraphRuntime_enums.h"
#include "FN_AnimGraphRuntime_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: RoboBear_AnimBP
*/

// AnimBlueprintGeneratedClass /Game/Gadgets/Assets/RoboBear/RoboBear_AnimBP.RoboBear_AnimBP_C
// 0x0250 (0x0690)
class URoboBear_AnimBP_C : public UFortAnimInstance
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0440 (0x0004)
	FAnimNode_Root                                                                                       AnimGraphNode_Root_94A5640D46AA80EE3A525181A40E89FB; // 0x0444 (0x002C)
	FAnimNode_Root                                                                                       AnimGraphNode_StateResult_8FC73BE849B7182366D0C69D3B182E6A; // 0x0470 (0x002C)
	FAnimNode_StateMachine                                                                               AnimGraphNode_StateMachine_46A72CBF4D105A71E6DE649812CC6D5B; // 0x049C (0x0094)
	FAnimNode_ModifyBone                                                                                 AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12; // 0x0530 (0x0080)
	FAnimNode_ConvertLocalToComponentSpace                                                               AnimGraphNode_LocalToComponentSpace_9EB9EC34459C844B0FE0BA8E435EFF6F; // 0x05B0 (0x002C)
	FAnimNode_ConvertComponentToLocalSpace                                                               AnimGraphNode_ComponentToLocalSpace_03791F914454ADFD2E1913880C785340; // 0x05DC (0x002C)
	FAnimNode_ModifyBone                                                                                 AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0; // 0x0608 (0x0080)
	float                                                                                                BearYaw;                                           // 0x0688 (0x0004)
	float                                                                                                BearPitch;                                         // 0x068C (0x0004)
public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12(); // Function /Game/Gadgets/Assets/RoboBear/RoboBear_AnimBP.RoboBear_AnimBP_C:EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_929212094C7DC2D4ED970EAEFEDF8C12
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0(); // Function /Game/Gadgets/Assets/RoboBear/RoboBear_AnimBP.RoboBear_AnimBP_C:EvaluateGraphExposedInputs_ExecuteUbergraph_RoboBear_AnimBP_AnimGraphNode_ModifyBone_2628A2884DFA7E07F877E392C1D6D0B0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function /Game/Gadgets/Assets/RoboBear/RoboBear_AnimBP.RoboBear_AnimBP_C:BlueprintUpdateAnimation
	void ExecuteUbergraph_RoboBear_AnimBP(int32_t EntryPoint); // Function /Game/Gadgets/Assets/RoboBear/RoboBear_AnimBP.RoboBear_AnimBP_C:ExecuteUbergraph_RoboBear_AnimBP
public:
	static class UClass* StaticClass();
};

