#pragma once
#include "FN_Basic.h"

#include "FN_SlateCore_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: SlateCore
*/

// ScriptStruct /Script/SlateCore.Margin
// 0x0010 (0x0010)
struct FMargin
{
	float                                                                                                Left;                                              // 0x0000 (0x0004)
	float                                                                                                Top;                                               // 0x0004 (0x0004)
	float                                                                                                Right;                                             // 0x0008 (0x0004)
	float                                                                                                Bottom;                                            // 0x000C (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SlateColor
// 0x001C (0x001C)
struct FSlateColor
{
	FLinearColor                                                                                         SpecifiedColor;                                    // 0x0000 (0x0010)
	ESlateColorStylingMode                                                                               ColorUseRule;                                      // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0xB];                               // 0x0011 (0x000B) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SlateBrush
// 0x0074 (0x0074)
struct FSlateBrush
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET
	FVector2D                                                                                            ImageSize;                                         // 0x0004 (0x0008)
	ESlateBrushDrawType                                                                                  DrawAs;                                            // 0x000C (0x0001)
	uint8_t                                                                                              UnknownData_D[0x3];                                // 0x000D (0x0003) MISSED OFFSET
	FMargin                                                                                              Margin;                                            // 0x0010 (0x0010)
	FLinearColor                                                                                         Tint;                                              // 0x0020 (0x0010)
	FSlateColor                                                                                          TintColor;                                         // 0x0030 (0x001C)
	ESlateBrushTileType                                                                                  Tiling;                                            // 0x004C (0x0001)
	ESlateBrushMirrorType                                                                                Mirroring;                                         // 0x004D (0x0001)
	ESlateBrushImageType                                                                                 ImageType;                                         // 0x004E (0x0001)
	uint8_t                                                                                              UnknownData_4F[0x1];                               // 0x004F (0x0001) MISSED OFFSET
	class UObject*                                                                                       ResourceObject;                                    // 0x0050 (0x0004)
	FName                                                                                                ResourceName;                                      // 0x0054 (0x0008)
	bool                                                                                                 bIsDynamicallyLoaded;                              // 0x005C (0x0001)
	bool                                                                                                 bHasUObject;                                       // 0x005D (0x0001)
	uint8_t                                                                                              UnknownData_5E[0x2];                               // 0x005E (0x0002) MISSED OFFSET
	FBox2D                                                                                               UVRegion;                                          // 0x0060 (0x0014)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.InputEvent
// 0x001C (0x001C)
struct FInputEvent
{
	uint8_t                                                                                              UnknownData_0[0x1C];                               // 0x0000 (0x001C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.PointerEvent
// 0x0044 (0x0060)
struct FPointerEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x44];                              // 0x001C (0x0044) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.Geometry
// 0x0034 (0x0034)
struct FGeometry
{
	uint8_t                                                                                              UnknownData_0[0x34];                               // 0x0000 (0x0034) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SlateWidgetStyle
// 0x0004 (0x0004)
struct FSlateWidgetStyle
{
	uint8_t                                                                                              UnknownData_0[0x4];                                // 0x0000 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SlateSound
// 0x0014 (0x0014)
struct FSlateSound
{
	class UObject*                                                                                       ResourceObject;                                    // 0x0000 (0x0004)
	uint8_t                                                                                              UnknownData_4[0x10];                               // 0x0004 (0x0010) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ButtonStyle
// 0x0228 (0x022C)
struct FButtonStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          Normal;                                            // 0x0004 (0x0074)
	FSlateBrush                                                                                          Hovered;                                           // 0x0078 (0x0074)
	FSlateBrush                                                                                          Pressed;                                           // 0x00EC (0x0074)
	FSlateBrush                                                                                          Disabled;                                          // 0x0160 (0x0074)
	FMargin                                                                                              NormalPadding;                                     // 0x01D4 (0x0010)
	FMargin                                                                                              PressedPadding;                                    // 0x01E4 (0x0010)
	FSlateSound                                                                                          PressedSlateSound;                                 // 0x01F4 (0x0014)
	FSlateSound                                                                                          HoveredSlateSound;                                 // 0x0208 (0x0014)
	FName                                                                                                PressedSound;                                      // 0x021C (0x0008)
	FName                                                                                                HoveredSound;                                      // 0x0224 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ComboButtonStyle
// 0x0324 (0x0328)
struct FComboButtonStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         ButtonStyle;                                       // 0x0004 (0x022C)
	FSlateBrush                                                                                          DownArrowImage;                                    // 0x0230 (0x0074)
	FSlateBrush                                                                                          MenuBorderBrush;                                   // 0x02A4 (0x0074)
	FMargin                                                                                              MenuBorderPadding;                                 // 0x0318 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ComboBoxStyle
// 0x0360 (0x0364)
struct FComboBoxStyle : public FSlateWidgetStyle
{
	FComboButtonStyle                                                                                    ComboButtonStyle;                                  // 0x0004 (0x0328)
	FSlateSound                                                                                          PressedSlateSound;                                 // 0x032C (0x0014)
	FSlateSound                                                                                          SelectionChangeSlateSound;                         // 0x0340 (0x0014)
	FName                                                                                                PressedSound;                                      // 0x0354 (0x0008)
	FName                                                                                                SelectionChangeSound;                              // 0x035C (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SlateFontInfo
// 0x0028 (0x0028)
struct FSlateFontInfo
{
	class UObject*                                                                                       FontObject;                                        // 0x0000 (0x0004)
	class UObject*                                                                                       FontMaterial;                                      // 0x0004 (0x0004)
	uint8_t                                                                                              UnknownData_8[0x8];                                // 0x0008 (0x0008) MISSED OFFSET
	FName                                                                                                TypefaceFontName;                                  // 0x0010 (0x0008)
	int32_t                                                                                              Size;                                              // 0x0018 (0x0004)
	FName                                                                                                FontName;                                          // 0x001C (0x0008)
	EFontHinting                                                                                         Hinting;                                           // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.EditableTextStyle
// 0x01A0 (0x01A4)
struct FEditableTextStyle : public FSlateWidgetStyle
{
	FSlateFontInfo                                                                                       Font;                                              // 0x0004 (0x0028)
	FSlateColor                                                                                          ColorAndOpacity;                                   // 0x002C (0x001C)
	FSlateBrush                                                                                          BackgroundImageSelected;                           // 0x0048 (0x0074)
	FSlateBrush                                                                                          BackgroundImageComposing;                          // 0x00BC (0x0074)
	FSlateBrush                                                                                          CaretImage;                                        // 0x0130 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ScrollBarStyle
// 0x0414 (0x0418)
struct FScrollBarStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          HorizontalBackgroundImage;                         // 0x0004 (0x0074)
	FSlateBrush                                                                                          VerticalBackgroundImage;                           // 0x0078 (0x0074)
	FSlateBrush                                                                                          VerticalTopSlotImage;                              // 0x00EC (0x0074)
	FSlateBrush                                                                                          HorizontalTopSlotImage;                            // 0x0160 (0x0074)
	FSlateBrush                                                                                          VerticalBottomSlotImage;                           // 0x01D4 (0x0074)
	FSlateBrush                                                                                          HorizontalBottomSlotImage;                         // 0x0248 (0x0074)
	FSlateBrush                                                                                          NormalThumbImage;                                  // 0x02BC (0x0074)
	FSlateBrush                                                                                          HoveredThumbImage;                                 // 0x0330 (0x0074)
	FSlateBrush                                                                                          DraggedThumbImage;                                 // 0x03A4 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.EditableTextBoxStyle
// 0x0694 (0x0698)
struct FEditableTextBoxStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          BackgroundImageNormal;                             // 0x0004 (0x0074)
	FSlateBrush                                                                                          BackgroundImageHovered;                            // 0x0078 (0x0074)
	FSlateBrush                                                                                          BackgroundImageFocused;                            // 0x00EC (0x0074)
	FSlateBrush                                                                                          BackgroundImageReadOnly;                           // 0x0160 (0x0074)
	FMargin                                                                                              Padding;                                           // 0x01D4 (0x0010)
	FSlateFontInfo                                                                                       Font;                                              // 0x01E4 (0x0028)
	FSlateColor                                                                                          ForegroundColor;                                   // 0x020C (0x001C)
	FSlateColor                                                                                          BackgroundColor;                                   // 0x0228 (0x001C)
	FSlateColor                                                                                          ReadOnlyForegroundColor;                           // 0x0244 (0x001C)
	FMargin                                                                                              HScrollBarPadding;                                 // 0x0260 (0x0010)
	FMargin                                                                                              VScrollBarPadding;                                 // 0x0270 (0x0010)
	FScrollBarStyle                                                                                      ScrollBarStyle;                                    // 0x0280 (0x0418)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.TextBlockStyle
// 0x00FC (0x0100)
struct FTextBlockStyle : public FSlateWidgetStyle
{
	FSlateFontInfo                                                                                       Font;                                              // 0x0004 (0x0028)
	FSlateColor                                                                                          ColorAndOpacity;                                   // 0x002C (0x001C)
	FVector2D                                                                                            ShadowOffset;                                      // 0x0048 (0x0008)
	FLinearColor                                                                                         ShadowColorAndOpacity;                             // 0x0050 (0x0010)
	FSlateColor                                                                                          SelectedBackgroundColor;                           // 0x0060 (0x001C)
	FLinearColor                                                                                         HighlightColor;                                    // 0x007C (0x0010)
	FSlateBrush                                                                                          HighlightShape;                                    // 0x008C (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SpinBoxStyle
// 0x0270 (0x0274)
struct FSpinBoxStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          BackgroundBrush;                                   // 0x0004 (0x0074)
	FSlateBrush                                                                                          HoveredBackgroundBrush;                            // 0x0078 (0x0074)
	FSlateBrush                                                                                          ActiveFillBrush;                                   // 0x00EC (0x0074)
	FSlateBrush                                                                                          InactiveFillBrush;                                 // 0x0160 (0x0074)
	FSlateBrush                                                                                          ArrowsImage;                                       // 0x01D4 (0x0074)
	FSlateColor                                                                                          ForegroundColor;                                   // 0x0248 (0x001C)
	FMargin                                                                                              TextPadding;                                       // 0x0264 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.KeyEvent
// 0x0018 (0x0034)
struct FKeyEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x18];                              // 0x001C (0x0018) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.AnalogInputEvent
// 0x0004 (0x0038)
struct FAnalogInputEvent : public FKeyEvent
{
	uint8_t                                                                                              UnknownData_34[0x4];                               // 0x0034 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ControllerEvent
// 0x0014 (0x0030)
struct FControllerEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x14];                              // 0x001C (0x0014) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.FocusEvent
// 0x0008 (0x0008)
struct FFocusEvent
{
	uint8_t                                                                                              UnknownData_0[0x8];                                // 0x0000 (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.CharacterEvent
// 0x0004 (0x0020)
struct FCharacterEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.MotionEvent
// 0x0030 (0x004C)
struct FMotionEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x30];                              // 0x001C (0x0030) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.FontData
// 0x0020 (0x0020)
struct FFontData
{
	FString                                                                                              FontFilename;                                      // 0x0000 (0x000C)
	class UFontBulkData*                                                                                 BulkDataPtr;                                       // 0x000C (0x0004)
	EFontHinting                                                                                         Hinting;                                           // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET
	TArray<uint8_t>                                                                                      FontData;                                          // 0x0014 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.TypefaceEntry
// 0x0028 (0x0028)
struct FTypefaceEntry
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	FFontData                                                                                            Font;                                              // 0x0008 (0x0020)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.Typeface
// 0x000C (0x000C)
struct FTypeface
{
	TArray<FTypefaceEntry>                                                                               Fonts;                                             // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.CompositeSubFont
// 0x001C (0x001C)
struct FCompositeSubFont
{
	FTypeface                                                                                            Typeface;                                          // 0x0000 (0x000C)
	TArray<FInt32Range>                                                                                  CharacterRanges;                                   // 0x000C (0x000C)
	float                                                                                                ScalingFactor;                                     // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.CompositeFont
// 0x001C (0x001C)
struct FCompositeFont
{
	FTypeface                                                                                            DefaultTypeface;                                   // 0x0000 (0x000C)
	TArray<FCompositeSubFont>                                                                            SubTypefaces;                                      // 0x000C (0x000C)
	uint8_t                                                                                              UnknownData_18[0x4];                               // 0x0018 (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.WindowStyle
// 0x0CF8 (0x0CFC)
struct FWindowStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         MinimizeButtonStyle;                               // 0x0004 (0x022C)
	FButtonStyle                                                                                         MaximizeButtonStyle;                               // 0x0230 (0x022C)
	FButtonStyle                                                                                         RestoreButtonStyle;                                // 0x045C (0x022C)
	FButtonStyle                                                                                         CloseButtonStyle;                                  // 0x0688 (0x022C)
	FTextBlockStyle                                                                                      TitleTextStyle;                                    // 0x08B4 (0x0100)
	FSlateBrush                                                                                          ActiveTitleBrush;                                  // 0x09B4 (0x0074)
	FSlateBrush                                                                                          InactiveTitleBrush;                                // 0x0A28 (0x0074)
	FSlateBrush                                                                                          FlashTitleBrush;                                   // 0x0A9C (0x0074)
	FSlateBrush                                                                                          OutlineBrush;                                      // 0x0B10 (0x0074)
	FSlateColor                                                                                          OutlineColor;                                      // 0x0B84 (0x001C)
	FSlateBrush                                                                                          BorderBrush;                                       // 0x0BA0 (0x0074)
	FSlateBrush                                                                                          BackgroundBrush;                                   // 0x0C14 (0x0074)
	FSlateBrush                                                                                          ChildBackgroundBrush;                              // 0x0C88 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ScrollBorderStyle
// 0x00E8 (0x00EC)
struct FScrollBorderStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          TopShadowBrush;                                    // 0x0004 (0x0074)
	FSlateBrush                                                                                          BottomShadowBrush;                                 // 0x0078 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ScrollBoxStyle
// 0x01D0 (0x01D4)
struct FScrollBoxStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          TopShadowBrush;                                    // 0x0004 (0x0074)
	FSlateBrush                                                                                          BottomShadowBrush;                                 // 0x0078 (0x0074)
	FSlateBrush                                                                                          LeftShadowBrush;                                   // 0x00EC (0x0074)
	FSlateBrush                                                                                          RightShadowBrush;                                  // 0x0160 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.DockTabStyle
// 0x0588 (0x058C)
struct FDockTabStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         CloseButtonStyle;                                  // 0x0004 (0x022C)
	FSlateBrush                                                                                          NormalBrush;                                       // 0x0230 (0x0074)
	FSlateBrush                                                                                          ActiveBrush;                                       // 0x02A4 (0x0074)
	FSlateBrush                                                                                          ColorOverlayBrush;                                 // 0x0318 (0x0074)
	FSlateBrush                                                                                          ForegroundBrush;                                   // 0x038C (0x0074)
	FSlateBrush                                                                                          HoveredBrush;                                      // 0x0400 (0x0074)
	FSlateBrush                                                                                          ContentAreaBrush;                                  // 0x0474 (0x0074)
	FSlateBrush                                                                                          TabWellBrush;                                      // 0x04E8 (0x0074)
	FMargin                                                                                              TabPadding;                                        // 0x055C (0x0010)
	float                                                                                                OverlapWidth;                                      // 0x056C (0x0004)
	FSlateColor                                                                                          FlashColor;                                        // 0x0570 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.TableColumnHeaderStyle
// 0x0414 (0x0418)
struct FTableColumnHeaderStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          SortPrimaryAscendingImage;                         // 0x0004 (0x0074)
	FSlateBrush                                                                                          SortPrimaryDescendingImage;                        // 0x0078 (0x0074)
	FSlateBrush                                                                                          SortSecondaryAscendingImage;                       // 0x00EC (0x0074)
	FSlateBrush                                                                                          SortSecondaryDescendingImage;                      // 0x0160 (0x0074)
	FSlateBrush                                                                                          NormalBrush;                                       // 0x01D4 (0x0074)
	FSlateBrush                                                                                          HoveredBrush;                                      // 0x0248 (0x0074)
	FSlateBrush                                                                                          MenuDropdownImage;                                 // 0x02BC (0x0074)
	FSlateBrush                                                                                          MenuDropdownNormalBorderBrush;                     // 0x0330 (0x0074)
	FSlateBrush                                                                                          MenuDropdownHoveredBorderBrush;                    // 0x03A4 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SplitterStyle
// 0x00E8 (0x00EC)
struct FSplitterStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          HandleNormalBrush;                                 // 0x0004 (0x0074)
	FSlateBrush                                                                                          HandleHighlightBrush;                              // 0x0078 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.HeaderRowStyle
// 0x09AC (0x09B0)
struct FHeaderRowStyle : public FSlateWidgetStyle
{
	FTableColumnHeaderStyle                                                                              ColumnStyle;                                       // 0x0004 (0x0418)
	FTableColumnHeaderStyle                                                                              LastColumnStyle;                                   // 0x041C (0x0418)
	FSplitterStyle                                                                                       ColumnSplitterStyle;                               // 0x0834 (0x00EC)
	FSlateBrush                                                                                          BackgroundBrush;                                   // 0x0920 (0x0074)
	FSlateColor                                                                                          ForegroundColor;                                   // 0x0994 (0x001C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.TableRowStyle
// 0x05A8 (0x05AC)
struct FTableRowStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          SelectorFocusedBrush;                              // 0x0004 (0x0074)
	FSlateBrush                                                                                          ActiveHoveredBrush;                                // 0x0078 (0x0074)
	FSlateBrush                                                                                          ActiveBrush;                                       // 0x00EC (0x0074)
	FSlateBrush                                                                                          InactiveHoveredBrush;                              // 0x0160 (0x0074)
	FSlateBrush                                                                                          InactiveBrush;                                     // 0x01D4 (0x0074)
	FSlateBrush                                                                                          EvenRowBackgroundHoveredBrush;                     // 0x0248 (0x0074)
	FSlateBrush                                                                                          EvenRowBackgroundBrush;                            // 0x02BC (0x0074)
	FSlateBrush                                                                                          OddRowBackgroundHoveredBrush;                      // 0x0330 (0x0074)
	FSlateBrush                                                                                          OddRowBackgroundBrush;                             // 0x03A4 (0x0074)
	FSlateColor                                                                                          TextColor;                                         // 0x0418 (0x001C)
	FSlateColor                                                                                          SelectedTextColor;                                 // 0x0434 (0x001C)
	FSlateBrush                                                                                          DropIndicator_Above;                               // 0x0450 (0x0074)
	FSlateBrush                                                                                          DropIndicator_Onto;                                // 0x04C4 (0x0074)
	FSlateBrush                                                                                          DropIndicator_Below;                               // 0x0538 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.InlineTextImageStyle
// 0x0078 (0x007C)
struct FInlineTextImageStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          Image;                                             // 0x0004 (0x0074)
	int16_t                                                                                              Baseline;                                          // 0x0078 (0x0002)
	uint8_t                                                                                              UnknownData_7A[0x2];                               // 0x007A (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SliderStyle
// 0x01D0 (0x01D4)
struct FSliderStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          NormalBarImage;                                    // 0x0004 (0x0074)
	FSlateBrush                                                                                          DisabledBarImage;                                  // 0x0078 (0x0074)
	FSlateBrush                                                                                          NormalThumbImage;                                  // 0x00EC (0x0074)
	FSlateBrush                                                                                          DisabledThumbImage;                                // 0x0160 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.VolumeControlStyle
// 0x0418 (0x041C)
struct FVolumeControlStyle : public FSlateWidgetStyle
{
	FSliderStyle                                                                                         SliderStyle;                                       // 0x0004 (0x01D4)
	FSlateBrush                                                                                          HighVolumeImage;                                   // 0x01D8 (0x0074)
	FSlateBrush                                                                                          MidVolumeImage;                                    // 0x024C (0x0074)
	FSlateBrush                                                                                          LowVolumeImage;                                    // 0x02C0 (0x0074)
	FSlateBrush                                                                                          NoVolumeImage;                                     // 0x0334 (0x0074)
	FSlateBrush                                                                                          MutedImage;                                        // 0x03A8 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.SearchBoxStyle
// 0x08A4 (0x08A8)
struct FSearchBoxStyle : public FSlateWidgetStyle
{
	FEditableTextBoxStyle                                                                                TextBoxStyle;                                      // 0x0004 (0x0698)
	FSlateFontInfo                                                                                       ActiveFontInfo;                                    // 0x069C (0x0028)
	FSlateBrush                                                                                          UpArrowImage;                                      // 0x06C4 (0x0074)
	FSlateBrush                                                                                          DownArrowImage;                                    // 0x0738 (0x0074)
	FSlateBrush                                                                                          GlassImage;                                        // 0x07AC (0x0074)
	FSlateBrush                                                                                          ClearImage;                                        // 0x0820 (0x0074)
	FMargin                                                                                              ImagePadding;                                      // 0x0894 (0x0010)
	bool                                                                                                 bLeftAlignButtons;                                 // 0x08A4 (0x0001)
	uint8_t                                                                                              UnknownData_8A5[0x3];                              // 0x08A5 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ExpandableAreaStyle
// 0x00E8 (0x00EC)
struct FExpandableAreaStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          CollapsedImage;                                    // 0x0004 (0x0074)
	FSlateBrush                                                                                          ExpandedImage;                                     // 0x0078 (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.ProgressBarStyle
// 0x015C (0x0160)
struct FProgressBarStyle : public FSlateWidgetStyle
{
	FSlateBrush                                                                                          BackgroundImage;                                   // 0x0004 (0x0074)
	FSlateBrush                                                                                          FillImage;                                         // 0x0078 (0x0074)
	FSlateBrush                                                                                          MarqueeImage;                                      // 0x00EC (0x0074)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.InlineEditableTextBlockStyle
// 0x0798 (0x079C)
struct FInlineEditableTextBlockStyle : public FSlateWidgetStyle
{
	FEditableTextBoxStyle                                                                                EditableTextBoxStyle;                              // 0x0004 (0x0698)
	FTextBlockStyle                                                                                      TextStyle;                                         // 0x069C (0x0100)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.HyperlinkStyle
// 0x033C (0x0340)
struct FHyperlinkStyle : public FSlateWidgetStyle
{
	FButtonStyle                                                                                         UnderlineStyle;                                    // 0x0004 (0x022C)
	FTextBlockStyle                                                                                      TextStyle;                                         // 0x0230 (0x0100)
	FMargin                                                                                              Padding;                                           // 0x0330 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.CheckBoxStyle
// 0x04B4 (0x04B8)
struct FCheckBoxStyle : public FSlateWidgetStyle
{
	ESlateCheckBoxType                                                                                   CheckBoxType;                                      // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET
	FSlateBrush                                                                                          UncheckedImage;                                    // 0x0008 (0x0074)
	FSlateBrush                                                                                          UncheckedHoveredImage;                             // 0x007C (0x0074)
	FSlateBrush                                                                                          UncheckedPressedImage;                             // 0x00F0 (0x0074)
	FSlateBrush                                                                                          CheckedImage;                                      // 0x0164 (0x0074)
	FSlateBrush                                                                                          CheckedHoveredImage;                               // 0x01D8 (0x0074)
	FSlateBrush                                                                                          CheckedPressedImage;                               // 0x024C (0x0074)
	FSlateBrush                                                                                          UndeterminedImage;                                 // 0x02C0 (0x0074)
	FSlateBrush                                                                                          UndeterminedHoveredImage;                          // 0x0334 (0x0074)
	FSlateBrush                                                                                          UndeterminedPressedImage;                          // 0x03A8 (0x0074)
	FMargin                                                                                              Padding;                                           // 0x041C (0x0010)
	FSlateColor                                                                                          ForegroundColor;                                   // 0x042C (0x001C)
	FSlateColor                                                                                          BorderBackgroundColor;                             // 0x0448 (0x001C)
	FSlateSound                                                                                          CheckedSlateSound;                                 // 0x0464 (0x0014)
	FSlateSound                                                                                          UncheckedSlateSound;                               // 0x0478 (0x0014)
	FSlateSound                                                                                          HoveredSlateSound;                                 // 0x048C (0x0014)
	FName                                                                                                CheckedSound;                                      // 0x04A0 (0x0008)
	FName                                                                                                UncheckedSound;                                    // 0x04A8 (0x0008)
	FName                                                                                                HoveredSound;                                      // 0x04B0 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SlateCore.NavigationEvent
// 0x0004 (0x0020)
struct FNavigationEvent : public FInputEvent
{
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

