#pragma once
#include "FN_Basic.h"

#include "FN_StoreCardReveal_BP_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: StoreCardReveal_BP
*/

// BlueprintGeneratedClass /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C
// 0x0428 (0x0668)
class AStoreCardReveal_BP_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UAudioComponent*                                                                               FastForward_AudioComponent;                        // 0x0244 (0x0004)
	class UStaticMeshComponent*                                                                          CardTemp;                                          // 0x0248 (0x0004)
	class UStaticMeshComponent*                                                                          CardDummyLocExit;                                  // 0x024C (0x0004)
	class UStaticMeshComponent*                                                                          CardDummyLocHide;                                  // 0x0250 (0x0004)
	class UStaticMeshComponent*                                                                          CardDummyLocShow;                                  // 0x0254 (0x0004)
	class UWidgetComponent*                                                                              CardFrontWidget;                                   // 0x0258 (0x0004)
	class UStaticMeshComponent*                                                                          S_VindertechCardGlowMesh;                          // 0x025C (0x0004)
	class UParticleSystemComponent*                                                                      P_CardReveal_Rays_01;                              // 0x0260 (0x0004)
	class UStaticMeshComponent*                                                                          St_VindertechCard_Rays_01;                         // 0x0264 (0x0004)
	class UStaticMeshComponent*                                                                          S_VindertechCard01;                                // 0x0268 (0x0004)
	class UArrowComponent*                                                                               CardRoot;                                          // 0x026C (0x0004)
	class UStaticMeshComponent*                                                                          GroundPlaceholderMesh;                             // 0x0270 (0x0004)
	class USceneComponent*                                                                               GroundRoot;                                        // 0x0274 (0x0004)
	class USceneComponent*                                                                               PinataSceneRoot;                                   // 0x0278 (0x0004)
	float                                                                                                FastForwardPauseTime_NewTrack_0_96BE2F524ACA60752FDC6CB87121F545; // 0x027C (0x0004)
	ETimelineDirection                                                                                   FastForwardPauseTime__Direction_96BE2F524ACA60752FDC6CB87121F545; // 0x0280 (0x0001)
	uint8_t                                                                                              UnknownData_281[0x3];                              // 0x0281 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FastForwardPauseTime;                              // 0x0284 (0x0004)
	float                                                                                                TL_CardMoveToScreenFast_Rotation_2D89CFED4B186F0BFB13A397C37A1EE7; // 0x0288 (0x0004)
	float                                                                                                TL_CardMoveToScreenFast_LerpWorldLoc_2D89CFED4B186F0BFB13A397C37A1EE7; // 0x028C (0x0004)
	ETimelineDirection                                                                                   TL_CardMoveToScreenFast__Direction_2D89CFED4B186F0BFB13A397C37A1EE7; // 0x0290 (0x0001)
	uint8_t                                                                                              UnknownData_291[0x3];                              // 0x0291 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardMoveToScreenFast;                           // 0x0294 (0x0004)
	float                                                                                                TL_CardFlipSlowly_CardFlipSlow_F5F7D15E4851E94A79CD4E93B8E664B3; // 0x0298 (0x0004)
	ETimelineDirection                                                                                   TL_CardFlipSlowly__Direction_F5F7D15E4851E94A79CD4E93B8E664B3; // 0x029C (0x0001)
	uint8_t                                                                                              UnknownData_29D[0x3];                              // 0x029D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardFlipSlowly;                                 // 0x02A0 (0x0004)
	float                                                                                                TL_CardFlipToFront_NewTrack_6_8902A76E45F02B2EAFFF568387C58F2F; // 0x02A4 (0x0004)
	ETimelineDirection                                                                                   TL_CardFlipToFront__Direction_8902A76E45F02B2EAFFF568387C58F2F; // 0x02A8 (0x0001)
	uint8_t                                                                                              UnknownData_2A9[0x3];                              // 0x02A9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardFlipToFront;                                // 0x02AC (0x0004)
	float                                                                                                TL_CardUpgradeFast_RaysFader_949EB8324B003C2943D50781B70022F4; // 0x02B0 (0x0004)
	float                                                                                                TL_CardUpgradeFast_NewTrack_0_949EB8324B003C2943D50781B70022F4; // 0x02B4 (0x0004)
	ETimelineDirection                                                                                   TL_CardUpgradeFast__Direction_949EB8324B003C2943D50781B70022F4; // 0x02B8 (0x0001)
	uint8_t                                                                                              UnknownData_2B9[0x3];                              // 0x02B9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardUpgradeFast;                                // 0x02BC (0x0004)
	float                                                                                                TL_CardUpgrade_RaysFader_D41042154B04955F2C9F4F92369F5E1A; // 0x02C0 (0x0004)
	float                                                                                                TL_CardUpgrade_NewTrack_0_D41042154B04955F2C9F4F92369F5E1A; // 0x02C4 (0x0004)
	ETimelineDirection                                                                                   TL_CardUpgrade__Direction_D41042154B04955F2C9F4F92369F5E1A; // 0x02C8 (0x0001)
	uint8_t                                                                                              UnknownData_2C9[0x3];                              // 0x02C9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardUpgrade;                                    // 0x02CC (0x0004)
	float                                                                                                TL_CardExit_NewTrack_1_5B7343EC450EC02002347D8C37622915; // 0x02D0 (0x0004)
	ETimelineDirection                                                                                   TL_CardExit__Direction_5B7343EC450EC02002347D8C37622915; // 0x02D4 (0x0001)
	uint8_t                                                                                              UnknownData_2D5[0x3];                              // 0x02D5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CardExit;                                       // 0x02D8 (0x0004)
	FVector                                                                                              MeleeWeaponEquipLoc;                               // 0x02DC (0x000C)
	float                                                                                                EquipWeaponDelay;                                  // 0x02E8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_PinataTassels;                                 // 0x02EC (0x0004)
	float                                                                                                Current_Delta;                                     // 0x02F0 (0x0004)
	FVector                                                                                              WorldLocationForMaterial;                          // 0x02F4 (0x000C)
	TArray<class USkeletalMesh*>                                                                         WeaponList;                                        // 0x0300 (0x000C)
	FVector                                                                                              SKMeleeLocation;                                   // 0x030C (0x000C)
	FRotator                                                                                             SKMeleeRotation;                                   // 0x0318 (0x000C)
	bool                                                                                                 Stop;                                              // 0x0324 (0x0001)
	uint8_t                                                                                              UnknownData_325[0x3];                              // 0x0325 (0x0003) MISSED OFFSET
	FVector                                                                                              MeleeWeaponDownLoc;                                // 0x0328 (0x000C)
	FRotator                                                                                             MeleeWeaponEquipRot;                               // 0x0334 (0x000C)
	class UMaterialInstanceDynamic*                                                                      MID_PinataBase;                                    // 0x0340 (0x0004)
	class UV2_Item_Card_C*                                                                               CurrentCard;                                       // 0x0344 (0x0004)
	FVector                                                                                              LiveCardLocBeforeExit;                             // 0x0348 (0x000C)
	bool                                                                                                 PackIsUpgrade1;                                    // 0x0354 (0x0001)
	bool                                                                                                 PackIsUpgrade2;                                    // 0x0355 (0x0001)
	bool                                                                                                 PackIsUpgrade0;                                    // 0x0356 (0x0001)
	bool                                                                                                 HasAttacked1X;                                     // 0x0357 (0x0001)
	bool                                                                                                 HasAttacked2X;                                     // 0x0358 (0x0001)
	bool                                                                                                 HasAttacked3X;                                     // 0x0359 (0x0001)
	uint8_t                                                                                              UnknownData_35A[0x2];                              // 0x035A (0x0002) MISSED OFFSET
	int32_t                                                                                              Random0_2;                                         // 0x035C (0x0004)
	FVector                                                                                              IconPanelMeshALoc;                                 // 0x0360 (0x000C)
	FRotator                                                                                             LiveCardRotBeforeExit;                             // 0x036C (0x000C)
	float                                                                                                ChargeMeleeTime;                                   // 0x0378 (0x0004)
	bool                                                                                                 AbleToAttack;                                      // 0x037C (0x0001)
	bool                                                                                                 CanFastForward;                                    // 0x037D (0x0001)
	bool                                                                                                 LeftMousePressed;                                  // 0x037E (0x0001)
	bool                                                                                                 LeftMouseReleased;                                 // 0x037F (0x0001)
	FRotator                                                                                             PinataSwingStaticRot;                              // 0x0380 (0x000C)
	class UMaterialInstanceDynamic*                                                                      MID_PinataPackType;                                // 0x038C (0x0004)
	bool                                                                                                 Debug_;                                            // 0x0390 (0x0001)
	bool                                                                                                 DebugLevel0_;                                      // 0x0391 (0x0001)
	bool                                                                                                 DebugLevel1_;                                      // 0x0392 (0x0001)
	bool                                                                                                 DebugLevel2_;                                      // 0x0393 (0x0001)
	class UMaterialInstance*                                                                             CardPackUpgrades;                                  // 0x0394 (0x0004)
	class UMaterialInstance*                                                                             CardPackUpgradesT;                                 // 0x0398 (0x0004)
	class UMaterialInstance*                                                                             CardPackCrew;                                      // 0x039C (0x0004)
	class UMaterialInstance*                                                                             CardPackCrewT;                                     // 0x03A0 (0x0004)
	class UMaterialInstance*                                                                             CardPackJackpot;                                   // 0x03A4 (0x0004)
	class UMaterialInstance*                                                                             CardPackJackpotT;                                  // 0x03A8 (0x0004)
	class UMaterialInstance*                                                                             CardPackMeleeWep;                                  // 0x03AC (0x0004)
	class UMaterialInstance*                                                                             CardPackMeleeWepT;                                 // 0x03B0 (0x0004)
	class UMaterialInstance*                                                                             CardPackRangedWep;                                 // 0x03B4 (0x0004)
	class UMaterialInstance*                                                                             CardPackRangedWepT;                                // 0x03B8 (0x0004)
	class UMaterialInstance*                                                                             CardPackTraps;                                     // 0x03BC (0x0004)
	class UMaterialInstance*                                                                             CardPackTrapsT;                                    // 0x03C0 (0x0004)
	class UMaterialInstance*                                                                             CardPackWeapons;                                   // 0x03C4 (0x0004)
	class UMaterialInstance*                                                                             CardPackWeaponsT;                                  // 0x03C8 (0x0004)
	class UMaterialInstance*                                                                             CardPackMaterial;                                  // 0x03CC (0x0004)
	class UMaterialInstance*                                                                             CardPackMaterialT;                                 // 0x03D0 (0x0004)
	class UTexture*                                                                                      CardPackIconTexture;                               // 0x03D4 (0x0004)
	FLinearColor                                                                                         CardPackIconColor;                                 // 0x03D8 (0x0010)
	class UMaterialInstanceDynamic*                                                                      MID_PinataFoil;                                    // 0x03E8 (0x0004)
	class UParticleSystem*                                                                               FallingDebris_Lvl_0;                               // 0x03EC (0x0004)
	class UParticleSystem*                                                                               FallingDebris_Lvl_1;                               // 0x03F0 (0x0004)
	class UParticleSystem*                                                                               Falling_Debris_Lvl_2;                              // 0x03F4 (0x0004)
	class UParticleSystem*                                                                               Explode_Lvl_0;                                     // 0x03F8 (0x0004)
	class UParticleSystem*                                                                               Explode_Lvl_1;                                     // 0x03FC (0x0004)
	class UParticleSystem*                                                                               Explode_Lvl_2;                                     // 0x0400 (0x0004)
	class UParticleSystem*                                                                               Llama_Hit_Lvl_0;                                   // 0x0404 (0x0004)
	class UParticleSystem*                                                                               Llama_Hit_Lvl_1;                                   // 0x0408 (0x0004)
	class UParticleSystem*                                                                               Llama_Upgrade_Lvl_1;                               // 0x040C (0x0004)
	class UParticleSystem*                                                                               Llama_Upgrade_Lvl_2;                               // 0x0410 (0x0004)
	EFortRarity                                                                                          CurrentRarity;                                     // 0x0414 (0x0001)
	EFortRarity                                                                                          TargetRarity;                                      // 0x0415 (0x0001)
	uint8_t                                                                                              UnknownData_416[0x2];                              // 0x0416 (0x0002) MISSED OFFSET
	class UMaterialInstanceDynamic*                                                                      MID_CardRarity;                                    // 0x0418 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_CardFoil;                                      // 0x041C (0x0004)
	FVector                                                                                              PinataSwingStaticLoc;                              // 0x0420 (0x000C)
	FLinearColor                                                                                         Lvl1_Lightray_Color;                               // 0x042C (0x0010)
	FLinearColor                                                                                         Lvl2_Lightray_Color;                               // 0x043C (0x0010)
	class UMaterialInstanceDynamic*                                                                      CardRaysMID;                                       // 0x044C (0x0004)
	FLinearColor                                                                                         Card_Rays_Color;                                   // 0x0450 (0x0010)
	class UMaterialInstance*                                                                             ConfettiMID;                                       // 0x0460 (0x0004)
	FVector                                                                                              PinataHeadGroundLocStart;                          // 0x0464 (0x000C)
	FVector                                                                                              PinataHeadGroundLocEnd;                            // 0x0470 (0x000C)
	FVector                                                                                              PinataHeadGroundLocEndOffset;                      // 0x047C (0x000C)
	class UMaterialInstanceDynamic*                                                                      MID_UpgradeNecklace;                               // 0x0488 (0x0004)
	FVector                                                                                              PinataHeadStartLoc;                                // 0x048C (0x000C)
	FRotator                                                                                             PinataHeadStartRot;                                // 0x0498 (0x000C)
	FRotator                                                                                             PinataHeadGroundRotStart;                          // 0x04A4 (0x000C)
	FRotator                                                                                             PinataHeadPreFallRot;                              // 0x04B0 (0x000C)
	FVector                                                                                              PinataHeadPreFallLoc;                              // 0x04BC (0x000C)
	float                                                                                                PinataDropHeight;                                  // 0x04C8 (0x0004)
	FRotator                                                                                             PinataSwingStaticRotRelative;                      // 0x04CC (0x000C)
	class UMaterialInstanceDynamic*                                                                      MID_PinataEyeLeft;                                 // 0x04D8 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_PinataEyeRight;                                // 0x04DC (0x0004)
	TArray<FVector>                                                                                      WeaponListOffsetLoc;                               // 0x04E0 (0x000C)
	FVector                                                                                              TestWepOffset;                                     // 0x04EC (0x000C)
	class USkeletalMesh*                                                                                 TestWeapon;                                        // 0x04F8 (0x0004)
	TArray<FRotator>                                                                                     WeaponListOffsetRot;                               // 0x04FC (0x000C)
	TArray<FVector>                                                                                      WeaponListOffsetScale;                             // 0x0508 (0x000C)
	FRotator                                                                                             TestWepRot;                                        // 0x0514 (0x000C)
	FVector                                                                                              TestWepScale;                                      // 0x0520 (0x000C)
	int32_t                                                                                              RandomWeaponNumber;                                // 0x052C (0x0004)
	class USoundBase*                                                                                    Sound_Llama_Appear;                                // 0x0530 (0x0004)
	class USoundBase*                                                                                    Sound_CardFlip;                                    // 0x0534 (0x0004)
	class USoundBase*                                                                                    Sound_CurrentWeaponReady;                          // 0x0538 (0x0004)
	class USoundBase*                                                                                    Sound_CurrentWeaponSwing;                          // 0x053C (0x0004)
	class USoundBase*                                                                                    Sound_CurrentWeaponImpact;                         // 0x0540 (0x0004)
	class USoundBase*                                                                                    Sound_ChargeAttackLoop;                            // 0x0544 (0x0004)
	class USoundBase*                                                                                    Sound_Upgrade_Silver;                              // 0x0548 (0x0004)
	class USoundBase*                                                                                    Sound_Upgrade_Gold;                                // 0x054C (0x0004)
	class USoundBase*                                                                                    Sound_Open_Normal;                                 // 0x0550 (0x0004)
	class USoundBase*                                                                                    Sound_Open_Silver;                                 // 0x0554 (0x0004)
	class USoundBase*                                                                                    Sound_Open_Gold;                                   // 0x0558 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_Greet_Current;                        // 0x055C (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_OpenNormal_Current;                   // 0x0560 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_UpgradeSilver_Current;                // 0x0564 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_UpgradeGold_Current;                  // 0x0568 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_OpenSilver_Current;                   // 0x056C (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_OpenGold_Current;                     // 0x0570 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_Hover_Current;                        // 0x0574 (0x0004)
	class USoundBase*                                                                                    Dialog_Llama_Tickle_Current;                       // 0x0578 (0x0004)
	TArray<class USoundBase*>                                                                            Dialog_Llama_Depressed_Greet_Array;                // 0x057C (0x000C)
	TArray<class USoundBase*>                                                                            Weapon_Ready_Sound_Array;                          // 0x0588 (0x000C)
	TArray<class USoundBase*>                                                                            Weapon_Swing_Sound_Array;                          // 0x0594 (0x000C)
	TArray<class USoundBase*>                                                                            Weapon_Impact_Sound_Array;                         // 0x05A0 (0x000C)
	class USoundBase*                                                                                    Sound_CardFlyAtPlayer;                             // 0x05AC (0x0004)
	class USoundBase*                                                                                    Sound_CardPutAway;                                 // 0x05B0 (0x0004)
	class USoundBase*                                                                                    Sound_Store_Card_Summary;                          // 0x05B4 (0x0004)
	class USoundBase*                                                                                    Sound_Store_CardUpgrade_Blue;                      // 0x05B8 (0x0004)
	class USoundBase*                                                                                    Sound_Store_CardUpgrade_Green;                     // 0x05BC (0x0004)
	class USoundBase*                                                                                    Sound_Store_CardUpgrade_Purple;                    // 0x05C0 (0x0004)
	class USoundBase*                                                                                    Sound_Store_CardUpgrade_Gold;                      // 0x05C4 (0x0004)
	class USoundBase*                                                                                    Sound_Store_CardUpgrade_Platinum;                  // 0x05C8 (0x0004)
	class USoundBase*                                                                                    Sound_SweepUp;                                     // 0x05CC (0x0004)
	TArray<class USoundBase*>                                                                            Dialog_Llama_Mob_Greet_Array;                      // 0x05D0 (0x000C)
	TArray<class USoundBase*>                                                                            Dialog_Llama_Greet_Array_Current;                  // 0x05DC (0x000C)
	class USoundBase*                                                                                    Sound_PinataSwing;                                 // 0x05E8 (0x0004)
	float                                                                                                VO_Delay;                                          // 0x05EC (0x0004)
	class AFort_Entry_Music_Controller_BP_C*                                                             Fort_Entry_Music_Controller;                       // 0x05F0 (0x0004)
	bool                                                                                                 KillHover;                                         // 0x05F4 (0x0001)
	bool                                                                                                 GettingReadyToStrike;                              // 0x05F5 (0x0001)
	uint8_t                                                                                              UnknownData_5F6[0x2];                              // 0x05F6 (0x0002) MISSED OFFSET
	class USoundBase*                                                                                    Dialog_Llama_PreHit_Current;                       // 0x05F8 (0x0004)
	class USoundBase*                                                                                    Sound_Music_Drop;                                  // 0x05FC (0x0004)
	class USoundBase*                                                                                    Sound_Music_Open;                                  // 0x0600 (0x0004)
	TArray<class USoundBase*>                                                                            Greet_ARRAY;                                       // 0x0604 (0x000C)
	class USoundBase*                                                                                    GreetGenericSound;                                 // 0x0610 (0x0004)
	class USoundBase*                                                                                    GreetSledgehammerSound;                            // 0x0614 (0x0004)
	class USoundBase*                                                                                    GreetBaseballBat_Sound;                            // 0x0618 (0x0004)
	class USoundBase*                                                                                    GreetAxeSound;                                     // 0x061C (0x0004)
	class USoundBase*                                                                                    HockeyStickGreet_Sound;                            // 0x0620 (0x0004)
	class USoundBase*                                                                                    Garden_Rake_Greet_Sound;                           // 0x0624 (0x0004)
	class USoundBase*                                                                                    Greet_Garden_Hoe_Sound;                            // 0x0628 (0x0004)
	class USoundBase*                                                                                    Greet_Scythe_Sound;                                // 0x062C (0x0004)
	class USoundBase*                                                                                    GreetPickaxe_Sound;                                // 0x0630 (0x0004)
	class USoundBase*                                                                                    Greet_Pitchfork_Sound;                             // 0x0634 (0x0004)
	class USoundBase*                                                                                    Greet_Sword_Sound;                                 // 0x0638 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_CardGlow;                                      // 0x063C (0x0004)
	float                                                                                                TimeHeldDown;                                      // 0x0640 (0x0004)
	FVector                                                                                              WorldLocationForEye;                               // 0x0644 (0x000C)
	FCard                                                                                                CardData;                                          // 0x0650 (0x000C)
	bool                                                                                                 SpecialCardPause;                                  // 0x065C (0x0001)
	bool                                                                                                 RareCard;                                          // 0x065D (0x0001)
	bool                                                                                                 NewCard;                                           // 0x065E (0x0001)
	bool                                                                                                 NewAndRareCard;                                    // 0x065F (0x0001)
	class ATVPostProcessBP_C*                                                                            TVPPEffect;                                        // 0x0660 (0x0004)
	bool                                                                                                 FastForwardIsON;                                   // 0x0664 (0x0001)
	bool                                                                                                 DEBUGRandomUpgradePause;                           // 0x0665 (0x0001)
	bool                                                                                                 EnableMouseInput;                                  // 0x0666 (0x0001)
	bool                                                                                                 DisableMouseInput_0;                               // 0x0667 (0x0001)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:UserConstructionScript
	void TL_CardMoveToScreenFast__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardMoveToScreenFast__FinishedFunc
	void TL_CardMoveToScreenFast__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardMoveToScreenFast__UpdateFunc
	void TL_CardExit__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardExit__FinishedFunc
	void TL_CardExit__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardExit__UpdateFunc
	void TL_CardFlipSlowly__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardFlipSlowly__FinishedFunc
	void TL_CardFlipSlowly__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardFlipSlowly__UpdateFunc
	void TL_CardUpgrade__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardUpgrade__FinishedFunc
	void TL_CardUpgrade__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardUpgrade__UpdateFunc
	void TL_CardFlipToFront__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardFlipToFront__FinishedFunc
	void TL_CardFlipToFront__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardFlipToFront__UpdateFunc
	void TL_CardUpgradeFast__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardUpgradeFast__FinishedFunc
	void TL_CardUpgradeFast__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TL-CardUpgradeFast__UpdateFunc
	void FastForwardPauseTime__FinishedFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:FastForwardPauseTime__FinishedFunc
	void FastForwardPauseTime__UpdateFunc(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:FastForwardPauseTime__UpdateFunc
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_3(FKey Key); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_3
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_2(FKey Key); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_2
	void InitiatePinata(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:InitiatePinata
	void OnStoreStateChanged(EFortStoreState NewStoreState); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:OnStoreStateChanged
	void StartPackOpen(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:StartPackOpen
	void CardEnterStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardEnterStart
	void PackDestroyStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:PackDestroyStart
	void CardFlipStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardFlipStart
	void CardExitStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardExitStart
	void TurnOffFastForward(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TurnOffFastForward
	void CardBackRevealStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardBackRevealStart
	void CardFrontRevealStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardFrontRevealStart
	void TurnOnFastForward(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:TurnOnFastForward
	void EnableMouseToFF(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:EnableMouseToFF
	void FastForwardPaused(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:FastForwardPaused
	void ReceiveBeginPlay(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:ReceiveBeginPlay
	void CardPackStoreStart(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:CardPackStoreStart
	void SpecialCardPauseAbort(); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:SpecialCardPauseAbort
	void ExecuteUbergraph_StoreCardReveal_BP(int32_t EntryPoint); // Function /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.StoreCardReveal_BP_C:ExecuteUbergraph_StoreCardReveal_BP
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.PLACEHOLDER-CLASS__V2_ItemCardFront_C_162
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__V2_ItemCardFront_C_162
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.PLACEHOLDER-CLASS__TVPostProcessBP_C_163
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_163
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.PLACEHOLDER-CLASS__V2_Item_Card_C_164
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__V2_Item_Card_C_164
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Store/Cards/Blueprints/StoreCardReveal_BP.PLACEHOLDER-CLASS__Fort_Entry_Music_Controller_BP_C_165
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__Fort_Entry_Music_Controller_BP_C_165
{
public:
	static class UClass* StaticClass();
};

