#pragma once
#include "FN_Basic.h"

#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_SlateCore_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Slate
*/

// Class /Script/Slate.ButtonWidgetStyle
// 0x022C (0x024C)
class UButtonWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FButtonStyle                                                                                         ButtonStyle;                                       // 0x0020 (0x022C)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.CheckBoxWidgetStyle
// 0x04B8 (0x04D8)
class UCheckBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FCheckBoxStyle                                                                                       CheckBoxStyle;                                     // 0x0020 (0x04B8)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.ComboBoxWidgetStyle
// 0x0364 (0x0384)
class UComboBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FComboBoxStyle                                                                                       ComboBoxStyle;                                     // 0x0020 (0x0364)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.ComboButtonWidgetStyle
// 0x0328 (0x0348)
class UComboButtonWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FComboButtonStyle                                                                                    ComboButtonStyle;                                  // 0x0020 (0x0328)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.EditableTextBoxWidgetStyle
// 0x0698 (0x06B8)
class UEditableTextBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FEditableTextBoxStyle                                                                                EditableTextBoxStyle;                              // 0x0020 (0x0698)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.EditableTextWidgetStyle
// 0x01A4 (0x01C4)
class UEditableTextWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FEditableTextStyle                                                                                   EditableTextStyle;                                 // 0x0020 (0x01A4)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.ProgressWidgetStyle
// 0x0160 (0x0180)
class UProgressWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FProgressBarStyle                                                                                    ProgressBarStyle;                                  // 0x0020 (0x0160)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.ScrollBarWidgetStyle
// 0x0418 (0x0438)
class UScrollBarWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FScrollBarStyle                                                                                      ScrollBarStyle;                                    // 0x0020 (0x0418)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.ScrollBoxWidgetStyle
// 0x01D4 (0x01F4)
class UScrollBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FScrollBoxStyle                                                                                      ScrollBoxStyle;                                    // 0x0020 (0x01D4)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.SpinBoxWidgetStyle
// 0x0274 (0x0294)
class USpinBoxWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FSpinBoxStyle                                                                                        SpinBoxStyle;                                      // 0x0020 (0x0274)
public:
	static class UClass* StaticClass();
};

// Class /Script/Slate.TextBlockWidgetStyle
// 0x0100 (0x0120)
class UTextBlockWidgetStyle : public USlateWidgetStyleContainerBase
{
public:
	FTextBlockStyle                                                                                      TextBlockStyle;                                    // 0x0020 (0x0100)
public:
	static class UClass* StaticClass();
};

