#pragma once
#include "FN_Basic.h"

#include "FN_S_HB_OnboardingCloudCover_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: S_HB_OnboardingCloudCover
*/

// BlueprintGeneratedClass /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C
// 0x0108 (0x0348)
class AS_HB_OnboardingCloudCover_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UAudioComponent*                                                                               StormSounds;                                       // 0x0244 (0x0004)
	class UParticleSystemComponent*                                                                      SwirlPS;                                           // 0x0248 (0x0004)
	class UParticleSystemComponent*                                                                      ActivatePhase1;                                    // 0x024C (0x0004)
	class UParticleSystemComponent*                                                                      ActivatePhase2;                                    // 0x0250 (0x0004)
	class UParticleSystemComponent*                                                                      Lightning_05;                                      // 0x0254 (0x0004)
	class UParticleSystemComponent*                                                                      Lightning_04;                                      // 0x0258 (0x0004)
	class UParticleSystemComponent*                                                                      Lightning_03;                                      // 0x025C (0x0004)
	class UParticleSystemComponent*                                                                      Lightning_02;                                      // 0x0260 (0x0004)
	class UParticleSystemComponent*                                                                      Lightning_01;                                      // 0x0264 (0x0004)
	class USphereComponent*                                                                              HeroBuildingBCollision;                            // 0x0268 (0x0004)
	class USphereComponent*                                                                              HeroBuildingACollision;                            // 0x026C (0x0004)
	class USphereComponent*                                                                              Phase2_Collision;                                  // 0x0270 (0x0004)
	class USphereComponent*                                                                              Phase1_Collision;                                  // 0x0274 (0x0004)
	class UStaticMeshComponent*                                                                          SwirlEdge_Fade_04;                                 // 0x0278 (0x0004)
	class UStaticMeshComponent*                                                                          EdgeFade_03;                                       // 0x027C (0x0004)
	class UStaticMeshComponent*                                                                          EdgeFade_02;                                       // 0x0280 (0x0004)
	class UStaticMeshComponent*                                                                          EdgeFade_01;                                       // 0x0284 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl06_Phase02;                                   // 0x0288 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl05_TOP_Phase02;                               // 0x028C (0x0004)
	class UStaticMeshComponent*                                                                          Swirl04_Phase02;                                   // 0x0290 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl03_Phase02;                                   // 0x0294 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl02_Phase02;                                   // 0x0298 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl01_TOP_Phase02;                               // 0x029C (0x0004)
	class UStaticMeshComponent*                                                                          CloudMajor;                                        // 0x02A0 (0x0004)
	class UStaticMeshComponent*                                                                          SwirldEdge;                                        // 0x02A4 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl07_Phase01;                                   // 0x02A8 (0x0004)
	class UStaticMeshComponent*                                                                          Swirl03_Top_Phase01;                               // 0x02AC (0x0004)
	class UStaticMeshComponent*                                                                          Swirl01_Top_Phase01;                               // 0x02B0 (0x0004)
	class UStaticMeshComponent*                                                                          CloudHero;                                         // 0x02B4 (0x0004)
	class USceneComponent*                                                                               Scene1;                                            // 0x02B8 (0x0004)
	float                                                                                                Timeline_0_AtlasWarmup_732098ED4B33C11B4D86E0A29FB74A5E; // 0x02BC (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_732098ED4B33C11B4D86E0A29FB74A5E; // 0x02C0 (0x0001)
	uint8_t                                                                                              UnknownData_2C1[0x3];                              // 0x02C1 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x02C4 (0x0004)
	float                                                                                                Control_Clouds_Phase_01_AlphaScale_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02C8 (0x0004)
	float                                                                                                Control_Clouds_Phase_01_ErodeAlpha_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02CC (0x0004)
	float                                                                                                Control_Clouds_Phase_01_ContrastLow_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02D0 (0x0004)
	ETimelineDirection                                                                                   Control_Clouds_Phase_01__Direction_C48C72CA42026F0D8C3086BDF4C03DF2; // 0x02D4 (0x0001)
	uint8_t                                                                                              UnknownData_2D5[0x3];                              // 0x02D5 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Control_Clouds_Phase_01;                           // 0x02D8 (0x0004)
	FVector                                                                                              Control_Clouds_Phase02_ScaleNormal_875904894700C4C178BB4892C88FB0C4; // 0x02DC (0x000C)
	float                                                                                                Control_Clouds_Phase02_GlobalFade_875904894700C4C178BB4892C88FB0C4; // 0x02E8 (0x0004)
	float                                                                                                Control_Clouds_Phase02_AlphaScale_875904894700C4C178BB4892C88FB0C4; // 0x02EC (0x0004)
	float                                                                                                Control_Clouds_Phase02_Erode_Alpha_875904894700C4C178BB4892C88FB0C4; // 0x02F0 (0x0004)
	float                                                                                                Control_Clouds_Phase02_Swirl_05_Top_875904894700C4C178BB4892C88FB0C4; // 0x02F4 (0x0004)
	float                                                                                                Control_Clouds_Phase02_Swirl_01_Top_875904894700C4C178BB4892C88FB0C4; // 0x02F8 (0x0004)
	float                                                                                                Control_Clouds_Phase02_FadeSwirls_875904894700C4C178BB4892C88FB0C4; // 0x02FC (0x0004)
	ETimelineDirection                                                                                   Control_Clouds_Phase02__Direction_875904894700C4C178BB4892C88FB0C4; // 0x0300 (0x0001)
	uint8_t                                                                                              UnknownData_301[0x3];                              // 0x0301 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Control_Clouds_Phase02;                            // 0x0304 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl03_Top_Phase01_MID;                           // 0x0308 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl01_Top_Phase01_MID;                           // 0x030C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl07_Phase01_MID;                               // 0x0310 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl06_Phase02_MID;                               // 0x0314 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl05__TOP_Phase02_MID;                          // 0x0318 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl04_Phase02_MID;                               // 0x031C (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl03_Phase02_MID;                               // 0x0320 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl02_Phase02_MID;                               // 0x0324 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Swirl01_TOP_Phase02_MID;                           // 0x0328 (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudMajor_MID;                                    // 0x032C (0x0004)
	class UMaterialInstanceDynamic*                                                                      CloudHero_MID;                                     // 0x0330 (0x0004)
	class UMaterialInstanceDynamic*                                                                      EdgeFade_01_MID;                                   // 0x0334 (0x0004)
	class UMaterialInstanceDynamic*                                                                      EdgeFade_02_MID;                                   // 0x0338 (0x0004)
	class UMaterialInstanceDynamic*                                                                      EdgeFade_03_MID;                                   // 0x033C (0x0004)
	class UMaterialInstanceDynamic*                                                                      EdgeFade_04_MID;                                   // 0x0340 (0x0004)
	class UMaterialInstanceDynamic*                                                                      SwirlEdgeFade_MID;                                 // 0x0344 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:UserConstructionScript
	void Control_Clouds_Phase_01__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Control_Clouds_Phase_01__FinishedFunc
	void Control_Clouds_Phase_01__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Control_Clouds_Phase_01__UpdateFunc
	void Control_Clouds_Phase02__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Control_Clouds_Phase02__FinishedFunc
	void Control_Clouds_Phase02__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Control_Clouds_Phase02__UpdateFunc
	void Timeline_0__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:Timeline_0__UpdateFunc
	void ReceiveBeginPlay(); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:ReceiveBeginPlay
	void HandleClientEvent_OnboardingBuildingsStage1(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:HandleClientEvent_OnboardingBuildingsStage1
	void HandleClientEvent_OnboardingRevealHeroBuildings(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:HandleClientEvent_OnboardingRevealHeroBuildings
	void HandleClientEvent_OnboardingBuildingsStage2(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:HandleClientEvent_OnboardingBuildingsStage2
	void HandleClientEvent_OnboardingRevealAllBuildings(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:HandleClientEvent_OnboardingRevealAllBuildings
	void BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:BndEvt__Lightning_02_K2Node_ComponentBoundEvent_45_ParticleSpawnSignature__DelegateSignature
	void BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:BndEvt__Lightning_03_K2Node_ComponentBoundEvent_48_ParticleSpawnSignature__DelegateSignature
	void BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:BndEvt__Lightning_01_K2Node_ComponentBoundEvent_52_ParticleSpawnSignature__DelegateSignature
	void BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature(FName EventName, float EmitterTime, FVector Location, FVector Velocity); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:BndEvt__Lightning_05_K2Node_ComponentBoundEvent_537_ParticleSpawnSignature__DelegateSignature
	void ExecuteUbergraph_S_HB_OnboardingCloudCover(int32_t EntryPoint); // Function /Game/Environments/Homebase/Blueprints/Onboarding/S_HB_OnboardingCloudCover.S_HB_OnboardingCloudCover_C:ExecuteUbergraph_S_HB_OnboardingCloudCover
public:
	static class UClass* StaticClass();
};

