#pragma once
#include "FN_Basic.h"

#include "FN_StoreWeaponMaster_BP_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: StoreWeaponMaster_BP
*/

// BlueprintGeneratedClass /Game/FrontEnd/Store/Weapons/Blueprints/Master/StoreWeaponMaster_BP.StoreWeaponMaster_BP_C
// 0x00FC (0x033C)
class AStoreWeaponMaster_BP_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UStaticMeshComponent*                                                                          WeaponHiddenLocation;                              // 0x0244 (0x0004)
	class USkeletalMeshComponent*                                                                        SKMeleeWeapon;                                     // 0x0248 (0x0004)
	class UStaticMeshComponent*                                                                          MeleeWeaponDefaultPosition;                        // 0x024C (0x0004)
	class UStaticMeshComponent*                                                                          WeaponRoot;                                        // 0x0250 (0x0004)
	class USceneComponent*                                                                               PinataSceneRoot;                                   // 0x0254 (0x0004)
	FVector                                                                                              MeleeWeaponEquipLoc;                               // 0x0258 (0x000C)
	FVector                                                                                              SKMeleeLocation;                                   // 0x0264 (0x000C)
	FRotator                                                                                             SKMeleeRotation;                                   // 0x0270 (0x000C)
	FVector                                                                                              MeleeWeaponDownLoc;                                // 0x027C (0x000C)
	FRotator                                                                                             MeleeWeaponEquipRot;                               // 0x0288 (0x000C)
	TAssetPtr<USoundBase>                                                                                SoundWeaponReady;                                  // 0x0294 (0x0018)
	class USoundBase*                                                                                    SoundCurrentWeaponReady;                           // 0x02AC (0x0004)
	TAssetPtr<USoundBase>                                                                                SoundWeaponSwing;                                  // 0x02B0 (0x0018)
	class USoundBase*                                                                                    SoundCurrentWeaponSwing;                           // 0x02C8 (0x0004)
	TAssetPtr<USoundBase>                                                                                SoundWeaponImpact;                                 // 0x02CC (0x0018)
	class USoundBase*                                                                                    SoundCurrentWeaponImpact;                          // 0x02E4 (0x0004)
	TAssetPtr<USoundBase>                                                                                SoundWeaponGreet;                                  // 0x02E8 (0x0018)
	class USoundBase*                                                                                    SoundCurrentWeaponGreet;                           // 0x0300 (0x0004)
	class USkeletalMeshComponent*                                                                        WeaponObject;                                      // 0x0304 (0x0004)
	TAssetPtr<USkeletalMesh>                                                                             WeaponAssetID;                                     // 0x0308 (0x0018)
	bool                                                                                                 Debug;                                             // 0x0320 (0x0001)
	uint8_t                                                                                              UnknownData_321[0x3];                              // 0x0321 (0x0003) MISSED OFFSET
	FVector                                                                                              WeaponOffsetLoc;                                   // 0x0324 (0x000C)
	FRotator                                                                                             WeaponOffsetRot;                                   // 0x0330 (0x000C)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/Store/Weapons/Blueprints/Master/StoreWeaponMaster_BP.StoreWeaponMaster_BP_C:UserConstructionScript
	void ReceiveBeginPlay(); // Function /Game/FrontEnd/Store/Weapons/Blueprints/Master/StoreWeaponMaster_BP.StoreWeaponMaster_BP_C:ReceiveBeginPlay
	void ReceiveTick(float DeltaSeconds); // Function /Game/FrontEnd/Store/Weapons/Blueprints/Master/StoreWeaponMaster_BP.StoreWeaponMaster_BP_C:ReceiveTick
	void ExecuteUbergraph_StoreWeaponMaster_BP(int32_t EntryPoint); // Function /Game/FrontEnd/Store/Weapons/Blueprints/Master/StoreWeaponMaster_BP.StoreWeaponMaster_BP_C:ExecuteUbergraph_StoreWeaponMaster_BP
public:
	static class UClass* StaticClass();
};

