#pragma once
#include "FN_Basic.h"

#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: SlateCore
*/

// Class /Script/SlateCore.FontBulkData
// 0x0064 (0x0080)
class UFontBulkData : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x64];                              // 0x001C (0x0064) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/SlateCore.FontProviderInterface
// 0x0000 (0x001C)
class UFontProviderInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/SlateCore.SlateTypes
// 0x0000 (0x001C)
class USlateTypes : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/SlateCore.SlateWidgetStyleContainerInterface
// 0x0000 (0x001C)
class USlateWidgetStyleContainerInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/SlateCore.SlateWidgetStyleContainerBase
// 0x0004 (0x0020)
class USlateWidgetStyleContainerBase : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x4];                               // 0x001C (0x0004) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/SlateCore.SlateWidgetStyleAsset
// 0x0004 (0x0020)
class USlateWidgetStyleAsset : public UObject
{
public:
	class USlateWidgetStyleContainerBase*                                                                CustomStyle;                                       // 0x001C (0x0004)
public:
	static class UClass* StaticClass();
};

