#pragma once
#include "FN_Basic.h"

#include "FN_StoreCamera_Blueprint_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: StoreCamera_Blueprint
*/

// BlueprintGeneratedClass /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C
// 0x0058 (0x0660)
class AStoreCamera_Blueprint_C : public AFortCameraBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	class UStaticMeshComponent*                                                                          Mesh_DarkenBG;                                     // 0x060C (0x0004)
	class UCameraComponent*                                                                              CameraPlaceholderGround;                           // 0x0610 (0x0004)
	float                                                                                                Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9; // 0x0614 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9; // 0x0618 (0x0001)
	uint8_t                                                                                              UnknownData_619[0x3];                              // 0x0619 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x061C (0x0004)
	FVector                                                                                              CameraGroundLoc;                                   // 0x0620 (0x000C)
	FRotator                                                                                             CameraGroundRot;                                   // 0x062C (0x000C)
	FVector                                                                                              CameraOriginalLoc;                                 // 0x0638 (0x000C)
	FRotator                                                                                             CameraOriginalRot;                                 // 0x0644 (0x000C)
	bool                                                                                                 CameraInStartPos;                                  // 0x0650 (0x0001)
	bool                                                                                                 MouseDown;                                         // 0x0651 (0x0001)
	uint8_t                                                                                              UnknownData_652[0x2];                              // 0x0652 (0x0002) MISSED OFFSET
	class AStorePinataMaster_BP_C*                                                                       PinataInLevel;                                     // 0x0654 (0x0004)
	class ADayPhaseLightingAndFog_C*                                                                     WorldLighting;                                     // 0x0658 (0x0004)
	class AStoreCardReveal_BP_C*                                                                         CardRevealInLevel;                                 // 0x065C (0x0004)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:UserConstructionScript
	void Timeline_0__FinishedFunc(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:Timeline_0__UpdateFunc
	void OnActivated(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:OnActivated
	void OnDeactivated(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:OnDeactivated
	void OpeningCameraTransition(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:OpeningCameraTransition
	void ResetCamera(); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:ResetCamera
	void DarkenBGVisibility(bool Enable); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:DarkenBGVisibility
	void ExecuteUbergraph_StoreCamera_Blueprint(int32_t EntryPoint); // Function /Game/FrontEnd/Cameras/StoreCamera_Blueprint.StoreCamera_Blueprint_C:ExecuteUbergraph_StoreCamera_Blueprint
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/StoreCamera_Blueprint.PLACEHOLDER-CLASS__DayPhaseLightingAndFog_C_159
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__DayPhaseLightingAndFog_C_159
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/StoreCamera_Blueprint.PLACEHOLDER-CLASS__StorePinataMaster_BP_C_160
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__StorePinataMaster_BP_C_160
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/StoreCamera_Blueprint.PLACEHOLDER-CLASS__StoreCardReveal_BP_C_161
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__StoreCardReveal_BP_C_161
{
public:
	static class UClass* StaticClass();
};

