#pragma once
#include "FN_Basic.h"

#include "FN_Slate_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_InputCore_enums.h"
#include "FN_InputCore_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Slate
*/

// ScriptStruct /Script/Slate.Anchors
// 0x0010 (0x0010)
struct FAnchors
{
	FVector2D                                                                                            Minimum;                                           // 0x0000 (0x0008)
	FVector2D                                                                                            Maximum;                                           // 0x0008 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Slate.InputChord
// 0x0014 (0x0014)
struct FInputChord
{
	FKey                                                                                                 Key;                                               // 0x0000 (0x0010)
	uint8_t                                                                                              bShift : 1;                                        // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bCtrl : 1;                                         // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              bAlt : 1;                                          // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x04]
	uint8_t                                                                                              bCmd : 1;                                          // 0x0010 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x08]
	uint8_t                                                                                              UnknownData_11[0x3];                               // 0x0011 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

