#pragma once
#include "FN_Basic.h"

#include "FN_SK_MachineGun_Clip_Skeleton_AnimBlueprint_parameters.h"
#include "FN_AnimGraphRuntime_enums.h"
#include "FN_AnimGraphRuntime_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: SK_MachineGun_Clip_Skeleton_AnimBlueprint
*/

// AnimBlueprintGeneratedClass /Game/Weapons/FORT_Rifles/Mesh/SK_MachineGun_Clip_Skeleton_AnimBlueprint.SK_MachineGun_Clip_Skeleton_AnimBlueprint_C
// 0x0098 (0x03A8)
class USK_MachineGun_Clip_Skeleton_AnimBlueprint_C : public UAnimInstance
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0310 (0x0004)
	FAnimNode_Root                                                                                       AnimGraphNode_Root_3869FE004A7A40326F179A99947D40FD; // 0x0314 (0x002C)
	FAnimNode_Slot                                                                                       AnimGraphNode_Slot_42C4DC6D490B221E6A9F9A92B3FEA82E; // 0x0340 (0x0044)
	FAnimNode_RefPose                                                                                    AnimGraphNode_LocalRefPose_844915D14C4D660AA45FB1B5C63743BF; // 0x0384 (0x0024)
public:
	void ExecuteUbergraph_SK_MachineGun_Clip_Skeleton_AnimBlueprint(int32_t EntryPoint); // Function /Game/Weapons/FORT_Rifles/Mesh/SK_MachineGun_Clip_Skeleton_AnimBlueprint.SK_MachineGun_Clip_Skeleton_AnimBlueprint_C:ExecuteUbergraph_SK_MachineGun_Clip_Skeleton_AnimBlueprint
public:
	static class UClass* StaticClass();
};

