#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: SessionMessages
*/

// ScriptStruct /Script/SessionMessages.SessionServiceLogUnsubscribe
// 0x0001 (0x0001)
struct FSessionServiceLogUnsubscribe
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SessionMessages.SessionServiceLogSubscribe
// 0x0001 (0x0001)
struct FSessionServiceLogSubscribe
{
	uint8_t                                                                                              UnknownData_0[0x1];                                // 0x0000 (0x0001) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SessionMessages.SessionServiceLog
// 0x0030 (0x0030)
struct FSessionServiceLog
{
	FName                                                                                                Category;                                          // 0x0000 (0x0008)
	FString                                                                                              Data;                                              // 0x0008 (0x000C)
	FGuid                                                                                                InstanceId;                                        // 0x0014 (0x0010)
	double                                                                                               TimeSeconds;                                       // 0x0024 (0x0008)
	uint8_t                                                                                              Verbosity;                                         // 0x002C (0x0001)
	uint8_t                                                                                              UnknownData_2D[0x3];                               // 0x002D (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SessionMessages.SessionServicePong
// 0x0074 (0x0074)
struct FSessionServicePong
{
	bool                                                                                                 Authorized;                                        // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FString                                                                                              BuildDate;                                         // 0x0004 (0x000C)
	FString                                                                                              DeviceName;                                        // 0x0010 (0x000C)
	FGuid                                                                                                InstanceId;                                        // 0x001C (0x0010)
	FString                                                                                              InstanceName;                                      // 0x002C (0x000C)
	bool                                                                                                 IsConsoleBuild;                                    // 0x0038 (0x0001)
	uint8_t                                                                                              UnknownData_39[0x3];                               // 0x0039 (0x0003) MISSED OFFSET
	FString                                                                                              PlatformName;                                      // 0x003C (0x000C)
	FGuid                                                                                                SessionId;                                         // 0x0048 (0x0010)
	FString                                                                                              SessionName;                                       // 0x0058 (0x000C)
	FString                                                                                              SessionOwner;                                      // 0x0064 (0x000C)
	bool                                                                                                 Standalone;                                        // 0x0070 (0x0001)
	uint8_t                                                                                              UnknownData_71[0x3];                               // 0x0071 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/SessionMessages.SessionServicePing
// 0x000C (0x000C)
struct FSessionServicePing
{
	FString                                                                                              UserName;                                          // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

