#pragma once
#include "FN_Basic.h"

#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Serialization
*/

// ScriptStruct /Script/Serialization.StructSerializerNumericTestStruct
// 0x002C (0x002C)
struct FStructSerializerNumericTestStruct
{
	int8_t                                                                                               Int8;                                              // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x1];                                // 0x0001 (0x0001) MISSED OFFSET
	int16_t                                                                                              Int16;                                             // 0x0002 (0x0002)
	int32_t                                                                                              Int32;                                             // 0x0004 (0x0004)
	int64_t                                                                                              Int64;                                             // 0x0008 (0x0008)
	uint8_t                                                                                              UInt8;                                             // 0x0010 (0x0001)
	uint8_t                                                                                              UnknownData_11[0x1];                               // 0x0011 (0x0001) MISSED OFFSET
	uint16_t                                                                                             UInt16;                                            // 0x0012 (0x0002)
	uint32_t                                                                                             UInt32;                                            // 0x0014 (0x0004)
	uint64_t                                                                                             UInt64;                                            // 0x0018 (0x0008)
	float                                                                                                Float;                                             // 0x0020 (0x0004)
	double                                                                                               Double;                                            // 0x0024 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerBooleanTestStruct
// 0x0008 (0x0008)
struct FStructSerializerBooleanTestStruct
{
	bool                                                                                                 BoolFalse;                                         // 0x0000 (0x0001)
	bool                                                                                                 BoolTrue;                                          // 0x0001 (0x0001)
	uint8_t                                                                                              UnknownData_2[0x2];                                // 0x0002 (0x0002) MISSED OFFSET
	uint32_t                                                                                             Bitfield;                                          // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerObjectTestStruct
// 0x0008 (0x0008)
struct FStructSerializerObjectTestStruct
{
	class UClass*                                                                                        Class;                                             // 0x0000 (0x0004)
	class UObject*                                                                                       ObjectPtr;                                         // 0x0004 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerBuiltinTestStruct
// 0x0048 (0x0048)
struct FStructSerializerBuiltinTestStruct
{
	FGuid                                                                                                Guid;                                              // 0x0000 (0x0010)
	FName                                                                                                Name;                                              // 0x0010 (0x0008)
	FString                                                                                              String;                                            // 0x0018 (0x000C)
	FRotator                                                                                             Rotator;                                           // 0x0024 (0x000C)
	FText                                                                                                TEXT;                                              // 0x0030 (0x000C)
	FVector                                                                                              Vector;                                            // 0x003C (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerArrayTestStruct
// 0x0034 (0x0034)
struct FStructSerializerArrayTestStruct
{
	TArray<int32_t>                                                                                      Int32Array;                                        // 0x0000 (0x000C)
	int32_t                                                                                              StaticSingleElement;                               // 0x000C (0x0004)
	int32_t                                                                                              StaticInt32Array[3];                               // 0x0010 (0x000C)
	float                                                                                                StaticFloatArray[3];                               // 0x001C (0x000C)
	TArray<FVector>                                                                                      VectorArray;                                       // 0x0028 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerMapTestStruct
// 0x0078 (0x0078)
struct FStructSerializerMapTestStruct
{
	TMap<int32_t, FString>                                                                               IntToStr;                                          // 0x0000 (0x003C)
	TMap<FString, FVector>                                                                               StrToVec;                                          // 0x003C (0x003C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/Serialization.StructSerializerTestStruct
// 0x0130 (0x0130)
struct FStructSerializerTestStruct
{
	FStructSerializerNumericTestStruct                                                                   Numerics;                                          // 0x0000 (0x002C)
	FStructSerializerBooleanTestStruct                                                                   Booleans;                                          // 0x002C (0x0008)
	FStructSerializerObjectTestStruct                                                                    Objects;                                           // 0x0034 (0x0008)
	FStructSerializerBuiltinTestStruct                                                                   Builtins;                                          // 0x003C (0x0048)
	FStructSerializerArrayTestStruct                                                                     Arrays;                                            // 0x0084 (0x0034)
	FStructSerializerMapTestStruct                                                                       Maps;                                              // 0x00B8 (0x0078)

	static class UScriptStruct* StaticStruct();
};

