#pragma once
#include "FN_Basic.h"

#include "FN_SlateContentCalloutMenu_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: SlateContentCalloutMenu
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/SlateContentCalloutMenu.SlateContentCalloutMenu_C
// 0x000D (0x01C5)
class USlateContentCalloutMenu_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UFortLegacySlateBridgeWidget*                                                                  _Slate_Widget__Menu_Content;                       // 0x01BC (0x0004)
	class USizeBox*                                                                                      SizeBoxContent;                                    // 0x01C0 (0x0004)
	EFortLegacySlateWidget                                                                               SlateWidgetType;                                   // 0x01C4 (0x0001)
public:
	void Get_Size_Box(class USizeBox* Size_Box); // Function /Game/UI/Global_Elements/SlateContentCalloutMenu.SlateContentCalloutMenu_C:Get Size Box
	void Construct(); // Function /Game/UI/Global_Elements/SlateContentCalloutMenu.SlateContentCalloutMenu_C:Construct
	void ExecuteUbergraph_SlateContentCalloutMenu(int32_t EntryPoint); // Function /Game/UI/Global_Elements/SlateContentCalloutMenu.SlateContentCalloutMenu_C:ExecuteUbergraph_SlateContentCalloutMenu
public:
	static class UClass* StaticClass();
};

