#pragma once
#include "FN_Basic.h"

#include "FN_Tooltip_CoreStat_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_HeroCoreStat_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Tooltip_CoreStat
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/Tooltip-CoreStat.Tooltip-CoreStat_C
// 0x02F0 (0x04A8)
class UTooltip_CoreStat_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        ImageStatIcon;                                     // 0x01BC (0x0004)
	class UImage*                                                                                        ImageStatShadow;                                   // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    TextStatDesc;                                      // 0x01C4 (0x0004)
	class UTextBlock*                                                                                    TextStatLabel;                                     // 0x01C8 (0x0004)
	class UTextBlock*                                                                                    TextStatValue;                                     // 0x01CC (0x0004)
	FHeroCoreStat                                                                                        Data;                                              // 0x01D0 (0x02D4)
	float                                                                                                Value;                                             // 0x04A4 (0x0004)
public:
	void Update(FHeroCoreStat Data, float Value); // Function /Game/UI/Global_Elements/Tooltip-CoreStat.Tooltip-CoreStat_C:Update
	void Construct(); // Function /Game/UI/Global_Elements/Tooltip-CoreStat.Tooltip-CoreStat_C:Construct
	void ExecuteUbergraph_Tooltip_CoreStat(int32_t EntryPoint); // Function /Game/UI/Global_Elements/Tooltip-CoreStat.Tooltip-CoreStat_C:ExecuteUbergraph_Tooltip-CoreStat
public:
	static class UClass* StaticClass();
};

