#pragma once
#include "FN_Basic.h"

#include "FN_TopLevel_TabControls_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: TopLevel_TabControls
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C
// 0x004C (0x02B4)
class UTopLevel_TabControls_C : public UFortActionHandlerPanel
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0268 (0x0004)
	class UWidgetAnimation*                                                                              QuestCountPulse;                                   // 0x026C (0x0004)
	class UButtonIconText_C*                                                                             _Button__Friends;                                  // 0x0270 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Menu;                                     // 0x0274 (0x0004)
	class UButtonIconText_C*                                                                             _Button_Journal;                                   // 0x0278 (0x0004)
	class UMenuAnchor*                                                                                   _Menu_Anchor__Friends_List;                        // 0x027C (0x0004)
	class UMenuAnchor*                                                                                   _Menu_Anchor__Journal;                             // 0x0280 (0x0004)
	class UMenuAnchor*                                                                                   _MenuAnchor__Main_Menu;                            // 0x0284 (0x0004)
	class UBorder*                                                                                       BorderOuterFrame;                                  // 0x0288 (0x0004)
	class UImage*                                                                                        Image_1045;                                        // 0x028C (0x0004)
	int32_t                                                                                              ActiveIndex;                                       // 0x0290 (0x0004)
	class USoundBase*                                                                                    Sound_ConfigClicked;                               // 0x0294 (0x0004)
	class UFortBaseButton*                                                                               CurrentSelectedButton;                             // 0x0298 (0x0004)
	class UFortBaseButton*                                                                               Context;                                           // 0x029C (0x0004)
	bool                                                                                                 ShowFriends;                                       // 0x02A0 (0x0001)
	bool                                                                                                 ShowJournal;                                       // 0x02A1 (0x0001)
	uint8_t                                                                                              UnknownData_2A2[0x2];                              // 0x02A2 (0x0002) MISSED OFFSET
	int32_t                                                                                              QuestCount_Int;                                    // 0x02A4 (0x0004)
	FText                                                                                                FriendsButton_ToolTipText;                         // 0x02A8 (0x000C)
public:
	class UWidget* Menu_ToolTipWidget(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:Menu_ToolTipWidget
	class UWidget* Friends_ToolTipWidget(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:Friends_ToolTipWidget
	class UWidget* Journal_ToolTipWidget(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:Journal_ToolTipWidget
	void GetTotalQuestCount(int32_t outQuestCount); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:GetTotalQuestCount
	void SetQuestCountIndicator(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:SetQuestCountIndicator
	void InitializeFriendAndJournal(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:InitializeFriendAndJournal
	void SelectButtonAndMenuAnchor(class UFortBaseButton* Button, class UMenuAnchor* MenuAnchor, bool FocusMenu); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:SelectButtonAndMenuAnchor
	class UWidget* OnGetJournal(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OnGetJournal
	void UpdateFriendButtonState(EFortUIFeatureState FeatureState); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:UpdateFriendButtonState
	void OpenMainMenu(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OpenMainMenu
	void HandleMainMenuClose(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandleMainMenuClose
	void HandleMenuAnchorChanged(class UButtonIconText_C* Menu_Button, bool Is_Open); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandleMenuAnchorChanged
	class UWidget* OnGetMainMenu(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OnGetMainMenu
	class UWidget* OnGetFriendsList(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OnGetFriendsList
	void OnHandleAction(FEventReply Result, bool bPassThrough); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OnHandleAction
	void ClearActiveTab(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:ClearActiveTab
	void Construct(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:Construct
	void On_Social_Feature_Changed_Copy(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:On Social Feature Changed_Copy
	void OnSocialUpdate(TArray<class UFortSocialItem*> SocialItems); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:OnSocialUpdate
	void HandlePartyTransitionComplete(EFortPartyTransition PartyTransition); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandlePartyTransitionComplete
	void HandlePartyTransitionStarted(EFortPartyTransition PartyTransition); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandlePartyTransitionStarted
	void BndEvt___MenuAnchor__Main_Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[MenuAnchor] Main Menu_K2Node_ComponentBoundEvent_871_OnMenuOpenChangedEvent__DelegateSignature
	void BndEvt___Menu_Anchor__Friends_List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Menu Anchor] Friends List_K2Node_ComponentBoundEvent_879_OnMenuOpenChangedEvent__DelegateSignature
	void BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button] Friends_K2Node_ComponentBoundEvent_1106_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button] Menu_K2Node_ComponentBoundEvent_1392_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button] Menu_K2Node_ComponentBoundEvent_1128_FortSelectedStateChanged__DelegateSignature
	void BndEvt___Button__Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button] Friends_K2Node_ComponentBoundEvent_1225_FortSelectedStateChanged__DelegateSignature
	void BndEvt___Menu_Anchor__Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Menu Anchor] Journal_K2Node_ComponentBoundEvent_256_OnMenuOpenChangedEvent__DelegateSignature
	void BndEvt___Button_Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature(class UFortBaseButton* Button, bool SELECTED); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button]Journal_K2Node_ComponentBoundEvent_267_FortSelectedStateChanged__DelegateSignature
	void BndEvt___Button_Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:BndEvt__[Button]Journal_K2Node_ComponentBoundEvent_281_FortBaseButtonClicked__DelegateSignature
	void HandleQuestUpdated(); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandleQuestUpdated
	void HandleClientEvent_OpenQuestJournal(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandleClientEvent_OpenQuestJournal
	void HandleClientEvent_OpenNewsScreen(class UObject* EventSource, class UObject* EventFocus, FFortClientEvent ClientEvent); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:HandleClientEvent_OpenNewsScreen
	void ExecuteUbergraph_TopLevel_TabControls(int32_t EntryPoint); // Function /Game/UI/Global_Elements/TopLevel-TabControls.TopLevel-TabControls_C:ExecuteUbergraph_TopLevel-TabControls
public:
	static class UClass* StaticClass();
};

