#pragma once
#include "FN_Basic.h"

#include "FN_TVPostProcessBP_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: TVPostProcessBP
*/

// BlueprintGeneratedClass /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C
// 0x0128 (0x0368)
class ATVPostProcessBP_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UBillboardComponent*                                                                           Billboard;                                         // 0x0244 (0x0004)
	class UPostProcessComponent*                                                                         just_distorted_location_switch_post;               // 0x0248 (0x0004)
	class UPostProcessComponent*                                                                         Full_screen_tv_post;                               // 0x024C (0x0004)
	float                                                                                                Jitter_Timeline_use_solid_color_3FCD803A4A5E86474EA128B9EDBED56E; // 0x0250 (0x0004)
	float                                                                                                Jitter_Timeline_LerpImageAndScreen_3FCD803A4A5E86474EA128B9EDBED56E; // 0x0254 (0x0004)
	float                                                                                                Jitter_Timeline_Noise_Distortion_Amount_3FCD803A4A5E86474EA128B9EDBED56E; // 0x0258 (0x0004)
	float                                                                                                Jitter_Timeline_Screen_Modulation_3FCD803A4A5E86474EA128B9EDBED56E; // 0x025C (0x0004)
	ETimelineDirection                                                                                   Jitter_Timeline__Direction_3FCD803A4A5E86474EA128B9EDBED56E; // 0x0260 (0x0001)
	uint8_t                                                                                              UnknownData_261[0x3];                              // 0x0261 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Jitter_Timeline;                                   // 0x0264 (0x0004)
	float                                                                                                Timeline_0_use_solid_color_8A3EF030490EDBCB14E0EE98F27A0CEB; // 0x0268 (0x0004)
	float                                                                                                Timeline_0_LerpImageAndScreen_8A3EF030490EDBCB14E0EE98F27A0CEB; // 0x026C (0x0004)
	float                                                                                                Timeline_0_Noise_Distortion_Amount_8A3EF030490EDBCB14E0EE98F27A0CEB; // 0x0270 (0x0004)
	float                                                                                                Timeline_0_Screen_Modulation_8A3EF030490EDBCB14E0EE98F27A0CEB; // 0x0274 (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_8A3EF030490EDBCB14E0EE98F27A0CEB; // 0x0278 (0x0001)
	uint8_t                                                                                              UnknownData_279[0x3];                              // 0x0279 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x027C (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_SolidBackgroundModulation_8B52FB0849C47C5870E31DBE0A87A563; // 0x0280 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Additive_screen_modulation_8B52FB0849C47C5870E31DBE0A87A563; // 0x0284 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_ReplacementAlpha_8B52FB0849C47C5870E31DBE0A87A563; // 0x0288 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Vpos_8B52FB0849C47C5870E31DBE0A87A563; // 0x028C (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Hpos_8B52FB0849C47C5870E31DBE0A87A563; // 0x0290 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Noise_Distortion_Amount_8B52FB0849C47C5870E31DBE0A87A563; // 0x0294 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Screen_Bend_Amount_8B52FB0849C47C5870E31DBE0A87A563; // 0x0298 (0x0004)
	float                                                                                                Camera_StartTheMonitor_Text_Timeline_Screen_Modulation_8B52FB0849C47C5870E31DBE0A87A563; // 0x029C (0x0004)
	ETimelineDirection                                                                                   Camera_StartTheMonitor_Text_Timeline__Direction_8B52FB0849C47C5870E31DBE0A87A563; // 0x02A0 (0x0001)
	uint8_t                                                                                              UnknownData_2A1[0x3];                              // 0x02A1 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Camera_StartTheMonitor_Text_Timeline;              // 0x02A4 (0x0004)
	float                                                                                                FadeOut_blendweight_D40D454F4B32910AAC407D9AB580EA07; // 0x02A8 (0x0004)
	float                                                                                                FadeOut_Fading_D40D454F4B32910AAC407D9AB580EA07;   // 0x02AC (0x0004)
	float                                                                                                FadeOut_Effect_translucency_D40D454F4B32910AAC407D9AB580EA07; // 0x02B0 (0x0004)
	float                                                                                                FadeOut_Kill_effect_amount_D40D454F4B32910AAC407D9AB580EA07; // 0x02B4 (0x0004)
	ETimelineDirection                                                                                   FadeOut__Direction_D40D454F4B32910AAC407D9AB580EA07; // 0x02B8 (0x0001)
	uint8_t                                                                                              UnknownData_2B9[0x3];                              // 0x02B9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FadeOut;                                           // 0x02BC (0x0004)
	float                                                                                                Switch_between_cameras_use_solid_color_E4FB35CD487A51ED1632BFAD49D21E03; // 0x02C0 (0x0004)
	float                                                                                                Switch_between_cameras_LerpImageAndScreen_E4FB35CD487A51ED1632BFAD49D21E03; // 0x02C4 (0x0004)
	float                                                                                                Switch_between_cameras_Noise_Distortion_Amount_E4FB35CD487A51ED1632BFAD49D21E03; // 0x02C8 (0x0004)
	float                                                                                                Switch_between_cameras_Screen_Modulation_E4FB35CD487A51ED1632BFAD49D21E03; // 0x02CC (0x0004)
	ETimelineDirection                                                                                   Switch_between_cameras__Direction_E4FB35CD487A51ED1632BFAD49D21E03; // 0x02D0 (0x0001)
	uint8_t                                                                                              UnknownData_2D1[0x3];                              // 0x02D1 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Switch_between_cameras;                            // 0x02D4 (0x0004)
	float                                                                                                Switch_to_static_use_solid_color_010BC5074AA9D38B1E815EB7DA97273B; // 0x02D8 (0x0004)
	float                                                                                                Switch_to_static_ShowScreenStatic_010BC5074AA9D38B1E815EB7DA97273B; // 0x02DC (0x0004)
	float                                                                                                Switch_to_static_Noise_Distortion_Amount_010BC5074AA9D38B1E815EB7DA97273B; // 0x02E0 (0x0004)
	float                                                                                                Switch_to_static_Screen_Modulation_010BC5074AA9D38B1E815EB7DA97273B; // 0x02E4 (0x0004)
	ETimelineDirection                                                                                   Switch_to_static__Direction_010BC5074AA9D38B1E815EB7DA97273B; // 0x02E8 (0x0001)
	uint8_t                                                                                              UnknownData_2E9[0x3];                              // 0x02E9 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Switch_to_static;                                  // 0x02EC (0x0004)
	float                                                                                                Switch_to_live_use_solid_color_DFB267304061CE3644C3E1B38972E94E; // 0x02F0 (0x0004)
	float                                                                                                Switch_to_live_LerpImageAndScreen_DFB267304061CE3644C3E1B38972E94E; // 0x02F4 (0x0004)
	float                                                                                                Switch_to_live_Noise_Distortion_Amount_DFB267304061CE3644C3E1B38972E94E; // 0x02F8 (0x0004)
	float                                                                                                Switch_to_live_Screen_Modulation_DFB267304061CE3644C3E1B38972E94E; // 0x02FC (0x0004)
	ETimelineDirection                                                                                   Switch_to_live__Direction_DFB267304061CE3644C3E1B38972E94E; // 0x0300 (0x0001)
	uint8_t                                                                                              UnknownData_301[0x3];                              // 0x0301 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Switch_to_live;                                    // 0x0304 (0x0004)
	float                                                                                                Show_the_troll_HideTroll_060EDD8E4EDBC900E7D2F29D7A26DBF0; // 0x0308 (0x0004)
	float                                                                                                Show_the_troll_use_solid_color_060EDD8E4EDBC900E7D2F29D7A26DBF0; // 0x030C (0x0004)
	float                                                                                                Show_the_troll_Noise_Distortion_Amount_060EDD8E4EDBC900E7D2F29D7A26DBF0; // 0x0310 (0x0004)
	ETimelineDirection                                                                                   Show_the_troll__Direction_060EDD8E4EDBC900E7D2F29D7A26DBF0; // 0x0314 (0x0001)
	uint8_t                                                                                              UnknownData_315[0x3];                              // 0x0315 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Show_the_troll;                                    // 0x0318 (0x0004)
	float                                                                                                StartScreen_Replacement_randomization_676222D64F5268BA3215E5B98CEFBE8A; // 0x031C (0x0004)
	float                                                                                                StartScreen_ReplacementAlpha_676222D64F5268BA3215E5B98CEFBE8A; // 0x0320 (0x0004)
	float                                                                                                StartScreen_Vpos_676222D64F5268BA3215E5B98CEFBE8A; // 0x0324 (0x0004)
	float                                                                                                StartScreen_Hpos_676222D64F5268BA3215E5B98CEFBE8A; // 0x0328 (0x0004)
	float                                                                                                StartScreen_Noise_Distortion_Amount_676222D64F5268BA3215E5B98CEFBE8A; // 0x032C (0x0004)
	float                                                                                                StartScreen_Screen_Bend_Amount_676222D64F5268BA3215E5B98CEFBE8A; // 0x0330 (0x0004)
	float                                                                                                StartScreen_Screen_Modulation_676222D64F5268BA3215E5B98CEFBE8A; // 0x0334 (0x0004)
	ETimelineDirection                                                                                   StartScreen__Direction_676222D64F5268BA3215E5B98CEFBE8A; // 0x0338 (0x0001)
	uint8_t                                                                                              UnknownData_339[0x3];                              // 0x0339 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            StartScreen;                                       // 0x033C (0x0004)
	bool                                                                                                 GrabNewColorBool;                                  // 0x0340 (0x0001)
	bool                                                                                                 increase_distortion_;                              // 0x0341 (0x0001)
	uint8_t                                                                                              UnknownData_342[0x2];                              // 0x0342 (0x0002) MISSED OFFSET
	float                                                                                                AdditionalDistortionAmount;                        // 0x0344 (0x0004)
	bool                                                                                                 Show_troll;                                        // 0x0348 (0x0001)
	uint8_t                                                                                              UnknownData_349[0x3];                              // 0x0349 (0x0003) MISSED OFFSET
	int32_t                                                                                              Troll_counter;                                     // 0x034C (0x0004)
	bool                                                                                                 NewVar;                                            // 0x0350 (0x0001)
	bool                                                                                                 Camera_hasnt_switched_to_live_yet;                 // 0x0351 (0x0001)
	uint8_t                                                                                              UnknownData_352[0x2];                              // 0x0352 (0x0002) MISSED OFFSET
	float                                                                                                FluctuatingDisplaySceneValue;                      // 0x0354 (0x0004)
	float                                                                                                Ideal_Display_scene_min_value;                     // 0x0358 (0x0004)
	float                                                                                                Ideal_display_scene_max_value;                     // 0x035C (0x0004)
	bool                                                                                                 SkipDos;                                           // 0x0360 (0x0001)
	bool                                                                                                 DisableOnStartup;                                  // 0x0361 (0x0001)
	bool                                                                                                 NewVar_0;                                          // 0x0362 (0x0001)
	uint8_t                                                                                              UnknownData_363[0x1];                              // 0x0363 (0x0001) MISSED OFFSET
	float                                                                                                PreviousSceneModulation;                           // 0x0364 (0x0004)
public:
	void RandomizeTheColor(float Use_Bluescreen, float Probablility_modulator, float Use_Flat_Blue, float MaxColorPerChannelValue, bool Control_replacement_alpha); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:RandomizeTheColor
	void UserConstructionScript(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:UserConstructionScript
	void StartScreen__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:StartScreen__FinishedFunc
	void StartScreen__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:StartScreen__UpdateFunc
	void Switch_to_static__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch to static__FinishedFunc
	void Switch_to_static__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch to static__UpdateFunc
	void Switch_between_cameras__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch between cameras__FinishedFunc
	void Switch_between_cameras__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch between cameras__UpdateFunc
	void Switch_between_cameras__Switch_Camera_Position__EventFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch between cameras__Switch Camera Position__EventFunc
	void Show_the_troll__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Show the troll__FinishedFunc
	void Show_the_troll__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Show the troll__UpdateFunc
	void Switch_to_live__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch to live__FinishedFunc
	void Switch_to_live__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Switch to live__UpdateFunc
	void FadeOut__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:FadeOut__FinishedFunc
	void FadeOut__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:FadeOut__UpdateFunc
	void Camera_StartTheMonitor_Text_Timeline__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_StartTheMonitor_Text_Timeline__FinishedFunc
	void Camera_StartTheMonitor_Text_Timeline__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_StartTheMonitor_Text_Timeline__UpdateFunc
	void Timeline_0__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Timeline_0__UpdateFunc
	void Timeline_0__Switch_Camera_Position__EventFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Timeline_0__Switch Camera Position__EventFunc
	void Jitter_Timeline__FinishedFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Jitter Timeline__FinishedFunc
	void Jitter_Timeline__UpdateFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Jitter Timeline__UpdateFunc
	void Jitter_Timeline__Switch_Camera_Position__EventFunc(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Jitter Timeline__Switch Camera Position__EventFunc
	void ReceiveBeginPlay(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:ReceiveBeginPlay
	void ReceiveTick(float DeltaSeconds); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:ReceiveTick
	void Camera_TransitionToLiveVideo(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_TransitionToLiveVideo
	void Camera_SwitchBetweenLocations(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_SwitchBetweenLocations
	void Camera_InitializePost(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_InitializePost
	void Camera_TriggerTheTroll(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_TriggerTheTroll
	void Camera_TransitionToLiveStatic(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_TransitionToLiveStatic
	void Camera_TurnOffThePostProcess(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_TurnOffThePostProcess
	void Camera_DebugEvents(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_DebugEvents
	void Camera_StartTheMonitor_Text(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_StartTheMonitor_Text
	void Camera_DosTextFinished(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_DosTextFinished
	void Camera_ReturningPlayerInitializeWithLiveVideo(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_ReturningPlayerInitializeWithLiveVideo
	void Camera_SwitchBetweenLocations_AfterPostProcessDisappears(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_SwitchBetweenLocations_AfterPostProcessDisappears
	void Camera_LoadAndWait(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_LoadAndWait
	void Camera_Sequence_Start_StaticWhoomp(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_Sequence_Start_StaticWhoomp
	void WriteOutLoading(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:WriteOutLoading
	void SequenceFinished(FString SequenceName); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:SequenceFinished
	void Camera_DisableEffects(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:Camera_DisableEffects
	void FastForwardPostProcess(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:FastForwardPostProcess
	void JitterTheScreen(); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:JitterTheScreen
	void ExecuteUbergraph_TVPostProcessBP(int32_t EntryPoint); // Function /Game/Environments/Homebase/Blueprints/TVPostProcessBP.TVPostProcessBP_C:ExecuteUbergraph_TVPostProcessBP
public:
	static class UClass* StaticClass();
};

