#pragma once
#include "FN_Basic.h"

#include "FN_Trap_Floor_Launcher_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Trap_Floor_Launcher
*/

// BlueprintGeneratedClass /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C
// 0x0068 (0x0A58)
class ATrap_Floor_Launcher_C : public ABuildingTrapFloor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x09F0 (0x0004)
	class UBoxComponent*                                                                                 Trigger;                                           // 0x09F4 (0x0004)
	class UStaticMeshComponent*                                                                          Base_Mesh;                                         // 0x09F8 (0x0004)
	class UStaticMeshComponent*                                                                          Jump_Mesh;                                         // 0x09FC (0x0004)
	class USceneComponent*                                                                               Scene1;                                            // 0x0A00 (0x0004)
	float                                                                                                Fire_Z_movement_2F056E1A487C3C63C6B6C0920DFEF7E6;  // 0x0A04 (0x0004)
	ETimelineDirection                                                                                   Fire__Direction_2F056E1A487C3C63C6B6C0920DFEF7E6;  // 0x0A08 (0x0001)
	uint8_t                                                                                              UnknownData_A09[0x3];                              // 0x0A09 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Fire;                                              // 0x0A0C (0x0004)
	float                                                                                                SpikeUP;                                           // 0x0A10 (0x0004)
	int32_t                                                                                              DustParticleIndex;                                 // 0x0A14 (0x0004)
	int32_t                                                                                              FireSoundIndex;                                    // 0x0A18 (0x0004)
	int32_t                                                                                              ReloadBeginSoundIndex;                             // 0x0A1C (0x0004)
	int32_t                                                                                              ReloadEndSoundIndex;                               // 0x0A20 (0x0004)
	int32_t                                                                                              Explode_Sound;                                     // 0x0A24 (0x0004)
	int32_t                                                                                              Explode_Effect;                                    // 0x0A28 (0x0004)
	float                                                                                                Glow_Amount;                                       // 0x0A2C (0x0004)
	int32_t                                                                                              Place_Sound;                                       // 0x0A30 (0x0004)
	float                                                                                                JumpPad_Movement;                                  // 0x0A34 (0x0004)
	FVector                                                                                              Init_Position;                                     // 0x0A38 (0x000C)
	class USoundCue*                                                                                     Trap_Placed_Sound;                                 // 0x0A44 (0x0004)
	class USoundCue*                                                                                     Trap_Active_Sound;                                 // 0x0A48 (0x0004)
	class USoundCue*                                                                                     Trap_Fire_Sound;                                   // 0x0A4C (0x0004)
	class USoundCue*                                                                                     Trap_Reload_Sound;                                 // 0x0A50 (0x0004)
	class USoundCue*                                                                                     Trap_Explode_Sound;                                // 0x0A54 (0x0004)
public:
	void SetFloorPosition(float NewFloorPosition); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:SetFloorPosition
	void UserConstructionScript(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:UserConstructionScript
	void Fire__FinishedFunc(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:Fire__FinishedFunc
	void Fire__UpdateFunc(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:Fire__UpdateFunc
	void OnReloadEnd(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:OnReloadEnd
	void OnPlaced(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:OnPlaced
	void OnFinishedBuilding(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:OnFinishedBuilding
	void OnOutOfDurability(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:OnOutOfDurability
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:GameplayCue.Abilities.Activation.Traps.ActivateTrap
	void ExecuteUbergraph_Trap_Floor_Launcher(int32_t EntryPoint); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Launcher.Trap_Floor_Launcher_C:ExecuteUbergraph_Trap_Floor_Launcher
public:
	static class UClass* StaticClass();
};

