#pragma once
#include "FN_Basic.h"

#include "FN_Tooltip_Item_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Tooltip_Item
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C
// 0x00C4 (0x027C)
class UTooltip_Item_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UBorder*                                                                                       _Border__Tier;                                     // 0x01BC (0x0004)
	class UHorizontalBox*                                                                                _Horizontal_Box__Level;                            // 0x01C0 (0x0004)
	class UHorizontalBox*                                                                                _Horizontal_Box__SecondaryType;                    // 0x01C4 (0x0004)
	class UHorizontalBox*                                                                                _Horizontal_Box__TertiaryType;                     // 0x01C8 (0x0004)
	class UImage*                                                                                        _Image__SecondaryType;                             // 0x01CC (0x0004)
	class UImage*                                                                                        _Image__TertiaryType;                              // 0x01D0 (0x0004)
	class UImage*                                                                                        _Image__Tier;                                      // 0x01D4 (0x0004)
	class UTextBlock*                                                                                    _Text__Item_Name;                                  // 0x01D8 (0x0004)
	class UTextBlock*                                                                                    _Text__Level;                                      // 0x01DC (0x0004)
	class UTextBlock*                                                                                    _Text__PrimaryType;                                // 0x01E0 (0x0004)
	class UTextBlock*                                                                                    _Text__Rarity_Name;                                // 0x01E4 (0x0004)
	class UTextBlock*                                                                                    _Text__SecondaryType;                              // 0x01E8 (0x0004)
	class UTextBlock*                                                                                    _Text__TertiaryType;                               // 0x01EC (0x0004)
	class UVerticalBox*                                                                                  _Vertical_Box__Stats;                              // 0x01F0 (0x0004)
	class UVerticalBox*                                                                                  _VerticalBox__Content;                             // 0x01F4 (0x0004)
	FText                                                                                                HeaderText;                                        // 0x01F8 (0x000C)
	class USlateBrushAsset*                                                                              Icon_Brush;                                        // 0x0204 (0x0004)
	class UFortItem*                                                                                     Item;                                              // 0x0208 (0x0004)
	FFortRarityItemData                                                                                  Rarity_Data;                                       // 0x020C (0x0070)
public:
	void Build_Durability(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Durability
	void Build_Consumable_Stats(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Consumable Stats
	void Build_Trap_Stats(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Trap Stats
	void Build_Alteration_Info(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Alteration Info
	void Build_Worker_Stats(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Worker Stats
	void Build_Weapon_DPS_Stat(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Weapon DPS Stat
	void Get_Scaled_Stat__float_(float Base_Stat, float Scaling, int32_t Level, float Scaled_Stat); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Scaled Stat (float)
	void Build_Base_Weapon_Stats(FFortBaseWeaponStats Data); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Base Weapon Stats
	void Build_Melee_Weapon_Stats(FFortMeleeWeaponStats Data); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Melee Weapon Stats
	void Build_Ranged_Weapon_Stats(FFortRangedWeaponStats Data); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Ranged Weapon Stats
	void Build_Basic_Info(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Basic Info
	void Build_Weapon_Stats(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Build Weapon Stats
	void Set_Item_Data(class UFortItem* Item); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Set Item Data
	ESlateVisibility Get_Tooltip_Header_Text_Visibility(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Tooltip Header Text Visibility
	ESlateVisibility Get_Tooltip_Header_Icon_Visibility(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Tooltip Header Icon Visibility
	ESlateVisibility Get_Tooltip_Header_Visibility(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Tooltip Header Visibility
	void Update(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Update
	FLinearColor Get_Theme_Color__Normal_(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Theme Color [Normal]
	FSlateBrush Get_Icon_Brush(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Get Icon Brush
	void Construct(); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:Construct
	void ExecuteUbergraph_Tooltip_Item(int32_t EntryPoint); // Function /Game/UI/Global_Elements/Tooltip-Item.Tooltip-Item_C:ExecuteUbergraph_Tooltip-Item
public:
	static class UClass* StaticClass();
};

