#pragma once
#include "FN_Basic.h"

#include "FN_TracerGeneric_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: TracerGeneric
*/

// BlueprintGeneratedClass /Game/Weapons/Tracers/TracerGeneric.TracerGeneric_C
// 0x0014 (0x02B8)
class ATracerGeneric_C : public AFortTracerBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x02A4 (0x0004)
	float                                                                                                Speed_Mult;                                        // 0x02A8 (0x0004)
	float                                                                                                Speed_Mult_StartDist;                              // 0x02AC (0x0004)
	float                                                                                                Speed_Mult_EndDist;                                // 0x02B0 (0x0004)
	float                                                                                                MaxSpeed_Mult;                                     // 0x02B4 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Weapons/Tracers/TracerGeneric.TracerGeneric_C:UserConstructionScript
	void OnInitTracerDistance(float Distance); // Function /Game/Weapons/Tracers/TracerGeneric.TracerGeneric_C:OnInitTracerDistance
	void ExecuteUbergraph_TracerGeneric(int32_t EntryPoint); // Function /Game/Weapons/Tracers/TracerGeneric.TracerGeneric_C:ExecuteUbergraph_TracerGeneric
public:
	static class UClass* StaticClass();
};

