#pragma once
#include "FN_Basic.h"

#include "FN_Trap_Floor_Spikes_Wood_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Trap_Floor_Spikes_Wood
*/

// BlueprintGeneratedClass /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C
// 0x0020 (0x0A10)
class ATrap_Floor_Spikes_Wood_C : public ABuildingTrapFloor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x09F0 (0x0004)
	class UBoxComponent*                                                                                 Trigger;                                           // 0x09F4 (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x09F8 (0x0004)
	class USoundCue*                                                                                     Place_Trap_Sound;                                  // 0x09FC (0x0004)
	class USoundCue*                                                                                     Trap_Active_Sound;                                 // 0x0A00 (0x0004)
	class USoundCue*                                                                                     Trap_Fire_Sound;                                   // 0x0A04 (0x0004)
	class USoundCue*                                                                                     Reload_Sound;                                      // 0x0A08 (0x0004)
	class USoundCue*                                                                                     Trap_Explode_Sound;                                // 0x0A0C (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:UserConstructionScript
	void OnPlaced(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:OnPlaced
	void OnFinishedBuilding(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:OnFinishedBuilding
	void OnOutOfDurability(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:OnOutOfDurability
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:GameplayCue.Abilities.Activation.Traps.ActivateTrap
	void ExecuteUbergraph_Trap_Floor_Spikes_Wood(int32_t EntryPoint); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Spikes_Wood.Trap_Floor_Spikes_Wood_C:ExecuteUbergraph_Trap_Floor_Spikes_Wood
public:
	static class UClass* StaticClass();
};

