#pragma once
#include "FN_Basic.h"

#include "FN_TheaterCamera_Blueprint_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: TheaterCamera_Blueprint
*/

// BlueprintGeneratedClass /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C
// 0x00D1 (0x06D9)
class ATheaterCamera_Blueprint_C : public AFortTheaterCamera
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	class USkyLightComponent*                                                                            SkyLight;                                          // 0x060C (0x0004)
	class UArrowComponent*                                                                               Arrow;                                             // 0x0610 (0x0004)
	class UDirectionalLightComponent*                                                                    DirectionalLight;                                  // 0x0614 (0x0004)
	class USceneComponent*                                                                               SceneLightsRoot;                                   // 0x0618 (0x0004)
	class UStaticMeshComponent*                                                                          MeshMonitorScreenShadow;                           // 0x061C (0x0004)
	class UStaticMeshComponent*                                                                          MeshMonitorScreen;                                 // 0x0620 (0x0004)
	class UStaticMeshComponent*                                                                          MeshMonitorFrame;                                  // 0x0624 (0x0004)
	class UTextRenderComponent*                                                                          TextMISSION;                                       // 0x0628 (0x0004)
	class UTextRenderComponent*                                                                          Thirdtext;                                         // 0x062C (0x0004)
	class UTextRenderComponent*                                                                          Secondtext;                                        // 0x0630 (0x0004)
	class UTextRenderComponent*                                                                          Maintext;                                          // 0x0634 (0x0004)
	float                                                                                                FocusTimeline_Float_Curve_ADC98EA5D14E24EC78DD4F80C5102578; // 0x0638 (0x0004)
	ETimelineDirection                                                                                   FocusTimeline__Direction_ADC98EA5D14E24EC78DD4F80C5102578; // 0x063C (0x0001)
	uint8_t                                                                                              UnknownData_63D[0x3];                              // 0x063D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            FocusTimeline;                                     // 0x0640 (0x0004)
	bool                                                                                                 MouseDown;                                         // 0x0644 (0x0001)
	uint8_t                                                                                              UnknownData_645[0xB];                              // 0x0645 (0x000B) MISSED OFFSET
	FTransform                                                                                           InitialPosition;                                   // 0x0650 (0x0030)
	float                                                                                                LerpPos;                                           // 0x0680 (0x0004)
	class ADayPhaseLightingAndFog_C*                                                                     WorldLighting;                                     // 0x0684 (0x0004)
	float                                                                                                WorldLocSnapSize;                                  // 0x0688 (0x0004)
	class AWriteOutTextToTheScreen_C*                                                                    Write_Text_Out_To_Screen_BP;                       // 0x068C (0x0004)
	float                                                                                                CameraDefaultLoc;                                  // 0x0690 (0x0004)
	float                                                                                                CameraLerp;                                        // 0x0694 (0x0004)
	float                                                                                                ZoomAmountPerMouseWheelUnit;                       // 0x0698 (0x0004)
	float                                                                                                MinCameraHeight;                                   // 0x069C (0x0004)
	float                                                                                                MaxCameraHeight;                                   // 0x06A0 (0x0004)
	bool                                                                                                 PauseMouseInput;                                   // 0x06A4 (0x0001)
	uint8_t                                                                                              UnknownData_6A5[0x3];                              // 0x06A5 (0x0003) MISSED OFFSET
	class ABP_Hex_Outpost_C*                                                                             Outpost;                                           // 0x06A8 (0x0004)
	FVector                                                                                              OutpostWorldLoc;                                   // 0x06AC (0x000C)
	float                                                                                                CameraOffsetX;                                     // 0x06B8 (0x0004)
	float                                                                                                CameraOffsetY;                                     // 0x06BC (0x0004)
	bool                                                                                                 InitialTheaterCameraDelay;                         // 0x06C0 (0x0001)
	uint8_t                                                                                              UnknownData_6C1[0x3];                              // 0x06C1 (0x0003) MISSED OFFSET
	float                                                                                                CameraMovementSpeed;                               // 0x06C4 (0x0004)
	FVector                                                                                              NewLoc;                                            // 0x06C8 (0x000C)
	class AFortTheaterMapTile*                                                                           TargetTile;                                        // 0x06D4 (0x0004)
	bool                                                                                                 IsEnteringTheater;                                 // 0x06D8 (0x0001)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:UserConstructionScript
	void FocusTimeline__FinishedFunc(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:FocusTimeline__FinishedFunc
	void FocusTimeline__UpdateFunc(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:FocusTimeline__UpdateFunc
	void InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11(FKey Key); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:InpActEvt_MouseScrollUp_UniqueObjectNameForCooking_11
	void InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10(FKey Key); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:InpActEvt_MouseScrollDown_UniqueObjectNameForCooking_10
	void OnActivated(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:OnActivated
	void OnDeactivated(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:OnDeactivated
	void SetTileFocus(class AFortTheaterMapTile* TargetTile); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:SetTileFocus
	void ReceiveTick(float DeltaSeconds); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:ReceiveTick
	void OnDragBegin(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:OnDragBegin
	void OnDragEnd(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:OnDragEnd
	void SetEnteringTheaterZoom(); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:SetEnteringTheaterZoom
	void ExecuteUbergraph_TheaterCamera_Blueprint(int32_t EntryPoint); // Function /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.TheaterCamera_Blueprint_C:ExecuteUbergraph_TheaterCamera_Blueprint
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.PLACEHOLDER-CLASS__BP_Hex_Outpost_C_130
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__BP_Hex_Outpost_C_130
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.PLACEHOLDER-CLASS__DayPhaseLightingAndFog_C_131
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__DayPhaseLightingAndFog_C_131
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.PLACEHOLDER-CLASS__TVPostProcessBP_C_132
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_132
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/TheaterCamera_Blueprint.PLACEHOLDER-CLASS__WriteOutTextToTheScreen_C_133
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__WriteOutTextToTheScreen_C_133
{
public:
	static class UClass* StaticClass();
};

