#pragma once
#include "FN_Basic.h"

#include "FN_Trap_Wall_Spikes_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Trap_Wall_Spikes
*/

// BlueprintGeneratedClass /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C
// 0x001C (0x0A0C)
class ATrap_Wall_Spikes_C : public ABuildingTrapWall
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x09F0 (0x0004)
	class UBoxComponent*                                                                                 TriggerComponent;                                  // 0x09F4 (0x0004)
	class USceneComponent*                                                                               Root;                                              // 0x09F8 (0x0004)
	class USoundCue*                                                                                     Activate_Sound_Cue;                                // 0x09FC (0x0004)
	class USoundCue*                                                                                     Placed_Sound_Cue;                                  // 0x0A00 (0x0004)
	class USoundCue*                                                                                     Explode_Sound_Cue;                                 // 0x0A04 (0x0004)
	class USoundCue*                                                                                     Trap_Fire_Sound_Cue;                               // 0x0A08 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:UserConstructionScript
	void OnPlaced(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:OnPlaced
	void OnFinishedBuilding(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:OnFinishedBuilding
	void OnReloadEnd(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:OnReloadEnd
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:GameplayCue.Abilities.Activation.Traps.ActivateTrap
	void OnOutOfDurability(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:OnOutOfDurability
	void ExecuteUbergraph_Trap_Wall_Spikes(int32_t EntryPoint); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Wall_Spikes.Trap_Wall_Spikes_C:ExecuteUbergraph_Trap_Wall_Spikes
public:
	static class UClass* StaticClass();
};

