#pragma once
#include "FN_Basic.h"

#include "FN_Tooltip_Custom_S_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Tooltip_Custom_S
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C
// 0x0038 (0x01F0)
class UTooltip_Custom_S_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        _hr_;                                              // 0x01BC (0x0004)
	class UHorizontalBox*                                                                                Body_HBox;                                         // 0x01C0 (0x0004)
	class UNamedSlot*                                                                                    Content_Slot;                                      // 0x01C4 (0x0004)
	class UHorizontalBox*                                                                                Header_HBox;                                       // 0x01C8 (0x0004)
	class UImage*                                                                                        Icon_Header;                                       // 0x01CC (0x0004)
	class USpacer*                                                                                       Spacer_Header;                                     // 0x01D0 (0x0004)
	class USpacer*                                                                                       Spacer_Icon;                                       // 0x01D4 (0x0004)
	class UTextBlock*                                                                                    Text_Header;                                       // 0x01D8 (0x0004)
	FText                                                                                                HeaderText;                                        // 0x01DC (0x000C)
	class USlateBrushAsset*                                                                              Icon_Brush;                                        // 0x01E8 (0x0004)
	class UUserWidget*                                                                                   ContentWidget;                                     // 0x01EC (0x0004)
public:
	FSlateBrush Get_Icon_Brush(); // Function /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C:Get Icon Brush
	FText Get_Header_Text(); // Function /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C:Get Header Text
	FText Get_Body_Text(); // Function /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C:Get Body Text
	void Construct(); // Function /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C:Construct
	void ExecuteUbergraph_Tooltip_Custom_S(int32_t EntryPoint); // Function /Game/UI/Global_Elements/Tooltip-Custom-S.Tooltip-Custom-S_C:ExecuteUbergraph_Tooltip-Custom-S
public:
	static class UClass* StaticClass();
};

