#pragma once
#include "FN_Basic.h"

#include "FN_TopLevelRibbon_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: TopLevelRibbon
*/

// WidgetBlueprintGeneratedClass /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C
// 0x003C (0x0280)
class UTopLevelRibbon_C : public UFortUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0244 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Feedback;                                 // 0x0248 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Log_Out;                                  // 0x024C (0x0004)
	class UButtonIconText_C*                                                                             _Button__Options;                                  // 0x0250 (0x0004)
	class UButtonIconText_C*                                                                             _Button__Quit;                                     // 0x0254 (0x0004)
	class UImage*                                                                                        _Image__Switch_Action;                             // 0x0258 (0x0004)
	class UVerticalBox*                                                                                  _Vertical_Box__FrontEnd_Options;                   // 0x025C (0x0004)
	class ULeaveButton_C*                                                                                ButtonLeave;                                       // 0x0260 (0x0004)
	class UImage*                                                                                        Image_234;                                         // 0x0264 (0x0004)
	class UButtonIconText_C*                                                                             News_Button;                                       // 0x0268 (0x0004)
	class UOutpost_CanEditPanel_C*                                                                       Outpost_CanEditPanel;                              // 0x026C (0x0004)
	class UOverlay*                                                                                      OutpostSettings_Overlay;                           // 0x0270 (0x0004)
	struct FUTopLevelRibbon_C_OnClosed__DelegateSignature                                                OnClosed;                                          // 0x0274 (0x000C)
public:
	void SetupButtons(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:SetupButtons
	void GetFrontEndOptionsVisibility(ESlateVisibility Visibility); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:GetFrontEndOptionsVisibility
	void BindDelegates(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BindDelegates
	void ShowRateExperience(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:ShowRateExperience
	void ShowFeedback(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:ShowFeedback
	void ShowGameOptions(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:ShowGameOptions
	void LeavePartyAndGame(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:LeavePartyAndGame
	void OnTimedOut_79E55F534B88358E4441C485A4E14D6E(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnTimedOut_79E55F534B88358E4441C485A4E14D6E
	void OnDeclined_79E55F534B88358E4441C485A4E14D6E(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnDeclined_79E55F534B88358E4441C485A4E14D6E
	void OnConfirmed_79E55F534B88358E4441C485A4E14D6E(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnConfirmed_79E55F534B88358E4441C485A4E14D6E
	void OnTimedOut_5265A9FE464FA87840004EB001876A10(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnTimedOut_5265A9FE464FA87840004EB001876A10
	void OnDeclined_5265A9FE464FA87840004EB001876A10(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnDeclined_5265A9FE464FA87840004EB001876A10
	void OnConfirmed_5265A9FE464FA87840004EB001876A10(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnConfirmed_5265A9FE464FA87840004EB001876A10
	void Construct(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:Construct
	void BndEvt___Button__Feedback_K2Node_ComponentBoundEvent_1732_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BndEvt__[Button] Feedback_K2Node_ComponentBoundEvent_1732_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Log_Out_K2Node_ComponentBoundEvent_2079_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BndEvt__[Button] Log Out_K2Node_ComponentBoundEvent_2079_FortBaseButtonClicked__DelegateSignature
	void BndEvt___Button__Quit_K2Node_ComponentBoundEvent_2092_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BndEvt__[Button] Quit_K2Node_ComponentBoundEvent_2092_FortBaseButtonClicked__DelegateSignature
	void BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_2469_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_2469_FortBaseButtonClicked__DelegateSignature
	void OnLeaveClicked(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnLeaveClicked
	void BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_632_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:BndEvt__ButtonIconText_K2Node_ComponentBoundEvent_632_FortBaseButtonClicked__DelegateSignature
	void ExecuteUbergraph_TopLevelRibbon(int32_t EntryPoint); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:ExecuteUbergraph_TopLevelRibbon
	void OnClosed__DelegateSignature(); // Function /Game/UI/Main/TopLevelRibbon.TopLevelRibbon_C:OnClosed__DelegateSignature
public:
	static class UClass* StaticClass();
};

