#pragma once
#include "FN_Basic.h"

#include "FN_Trap_Floor_Health_Master_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: Trap_Floor_Health_Master
*/

// BlueprintGeneratedClass /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C
// 0x0058 (0x0A48)
class ATrap_Floor_Health_Master_C : public ABuildingTrapFloor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x09F0 (0x0004)
	class URotatingMovementComponent*                                                                    RotatingMovement;                                  // 0x09F4 (0x0004)
	class UStaticMeshComponent*                                                                          Pickup_Mesh;                                       // 0x09F8 (0x0004)
	class UParticleSystemComponent*                                                                      P_Floor_Heal_Active;                               // 0x09FC (0x0004)
	class UPointLightComponent*                                                                          PointLight;                                        // 0x0A00 (0x0004)
	class UParticleSystemComponent*                                                                      JumpParticleEffect;                                // 0x0A04 (0x0004)
	class UBoxComponent*                                                                                 Trigger;                                           // 0x0A08 (0x0004)
	class USceneComponent*                                                                               Scene1;                                            // 0x0A0C (0x0004)
	class USoundCue*                                                                                     Trap_Placed_Sound;                                 // 0x0A10 (0x0004)
	class USoundCue*                                                                                     Trap_Active_Sound;                                 // 0x0A14 (0x0004)
	class USoundCue*                                                                                     Trap_Fire_Sound;                                   // 0x0A18 (0x0004)
	class USoundCue*                                                                                     Trap_Reload_Sound;                                 // 0x0A1C (0x0004)
	class USoundCue*                                                                                     Trap_Explode_Sound;                                // 0x0A20 (0x0004)
	class UMaterialInstanceDynamic*                                                                      Glow_mat;                                          // 0x0A24 (0x0004)
	float                                                                                                Charge_Value;                                      // 0x0A28 (0x0004)
	TArray<class AActor*>                                                                                Player_Touching_Array;                             // 0x0A2C (0x000C)
	class AFortPlayerPawn*                                                                               Active_Player;                                     // 0x0A38 (0x0004)
	class UStaticMesh*                                                                                   Pickup_Mesh_Override;                              // 0x0A3C (0x0004)
	class UMaterialInterface*                                                                            Pickup_Material_Override;                          // 0x0A40 (0x0004)
	float                                                                                                Numb_of_Charges;                                   // 0x0A44 (0x0004)
public:
	bool BP_ShouldTrigger(TArray<class AActor*> TouchingActors) const; // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:BP_ShouldTrigger
	void Active_FX(bool Active); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:Active_FX
	void OnRep_Charge_Value(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnRep_Charge_Value
	void UserConstructionScript(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:UserConstructionScript
	void OnReloadEnd(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnReloadEnd
	void OnPlaced(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnPlaced
	void OnFinishedBuilding(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnFinishedBuilding
	void GameplayCue_Abilities_Activation_Traps_ReloadBegin(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:GameplayCue.Abilities.Activation.Traps.ReloadBegin
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, FGameplayCueParameters Parameters); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:GameplayCue.Abilities.Activation.Traps.ActivateTrap
	void OnOutOfDurability(); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnOutOfDurability
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_288_ComponentBeginOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:BndEvt__Trigger_K2Node_ComponentBoundEvent_288_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_306_ComponentEndOverlapSignature__DelegateSignature(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:BndEvt__Trigger_K2Node_ComponentBoundEvent_306_ComponentEndOverlapSignature__DelegateSignature
	void OnDamaged_Event_0(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, FVector HitLocation, class UPrimitiveComponent* FHitComponent, FName BoneName, FVector Momentum); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:OnDamaged_Event_0
	void ExecuteUbergraph_Trap_Floor_Health_Master(int32_t EntryPoint); // Function /Game/Building/ActorBlueprints/Trap/Blueprints/Trap_Floor_Health_Master.Trap_Floor_Health_Master_C:ExecuteUbergraph_Trap_Floor_Health_Master
public:
	static class UClass* StaticClass();
};

