#pragma once
#include "FN_Basic.h"

#include "FN_UdpMessaging_structs.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: UdpMessaging
*/

// Class /Script/UdpMessaging.UdpMessagingSettings
// 0x0054 (0x0070)
class UUdpMessagingSettings : public UObject
{
public:
	bool                                                                                                 EnableTransport;                                   // 0x001C (0x0001)
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET
	FString                                                                                              UnicastEndpoint;                                   // 0x0020 (0x000C)
	FString                                                                                              MulticastEndpoint;                                 // 0x002C (0x000C)
	uint8_t                                                                                              MulticastTimeToLive;                               // 0x0038 (0x0001)
	uint8_t                                                                                              UnknownData_39[0x3];                               // 0x0039 (0x0003) MISSED OFFSET
	TArray<FString>                                                                                      StaticEndpoints;                                   // 0x003C (0x000C)
	bool                                                                                                 EnableTunnel;                                      // 0x0048 (0x0001)
	uint8_t                                                                                              UnknownData_49[0x3];                               // 0x0049 (0x0003) MISSED OFFSET
	FString                                                                                              TunnelUnicastEndpoint;                             // 0x004C (0x000C)
	FString                                                                                              TunnelMulticastEndpoint;                           // 0x0058 (0x000C)
	TArray<FString>                                                                                      RemoteTunnelEndpoints;                             // 0x0064 (0x000C)
public:
	static class UClass* StaticClass();
};

