#pragma once
#include "FN_Basic.h"

#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_MovieScene_classes.h"
#include "FN_MovieSceneTracks_enums.h"
#include "FN_MovieSceneTracks_structs.h"
#include "FN_MovieSceneTracks_classes.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"
#include "FN_SlateCore_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: UMG
*/

// Class /Script/UMG.AsyncTaskDownloadImage
// 0x0018 (0x0034)
class UAsyncTaskDownloadImage : public UBlueprintAsyncActionBase
{
public:
	struct FUMG_DownloadImageDelegate__DelegateSignature                                                 OnSuccess;                                         // 0x001C (0x000C)
	struct FUMG_DownloadImageDelegate__DelegateSignature                                                 OnFail;                                            // 0x0028 (0x000C)
public:
	static class UAsyncTaskDownloadImage* DownloadImage(FString URL); // Function /Script/UMG.AsyncTaskDownloadImage:DownloadImage
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.DragDropOperation
// 0x0044 (0x0060)
class UDragDropOperation : public UObject
{
public:
	FString                                                                                              Tag;                                               // 0x001C (0x000C)
	class UObject*                                                                                       Payload;                                           // 0x0028 (0x0004)
	class UWidget*                                                                                       DefaultDragVisual;                                 // 0x002C (0x0004)
	EDragPivot                                                                                           Pivot;                                             // 0x0030 (0x0001)
	uint8_t                                                                                              UnknownData_31[0x3];                               // 0x0031 (0x0003) MISSED OFFSET
	FVector2D                                                                                            Offset;                                            // 0x0034 (0x0008)
	struct FUMG_OnDragDropMulticast__DelegateSignature                                                   OnDrop;                                            // 0x003C (0x000C)
	struct FUMG_OnDragDropMulticast__DelegateSignature                                                   OnDragCancelled;                                   // 0x0048 (0x000C)
	struct FUMG_OnDragDropMulticast__DelegateSignature                                                   OnDragged;                                         // 0x0054 (0x000C)
public:
	void Drop(FPointerEvent PointerEvent); // Function /Script/UMG.DragDropOperation:Drop
	void Dragged(FPointerEvent PointerEvent); // Function /Script/UMG.DragDropOperation:Dragged
	void DragCancelled(FPointerEvent PointerEvent); // Function /Script/UMG.DragDropOperation:DragCancelled
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.MovieScene2DTransformSection
// 0x0250 (0x0280)
class UMovieScene2DTransformSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           Translation[2];                                    // 0x0034 (0x00A8)
	FRichCurve                                                                                           Rotation;                                          // 0x00DC (0x0054)
	FRichCurve                                                                                           Scale[2];                                          // 0x0130 (0x00A8)
	FRichCurve                                                                                           Shear[2];                                          // 0x01D8 (0x00A8)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.MovieScene2DTransformTrack
// 0x0000 (0x003C)
class UMovieScene2DTransformTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.MovieSceneMarginSection
// 0x0154 (0x0184)
class UMovieSceneMarginSection : public UMovieSceneSection
{
public:
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
	FRichCurve                                                                                           TopCurve;                                          // 0x0034 (0x0054)
	FRichCurve                                                                                           LeftCurve;                                         // 0x0088 (0x0054)
	FRichCurve                                                                                           RightCurve;                                        // 0x00DC (0x0054)
	FRichCurve                                                                                           BottomCurve;                                       // 0x0130 (0x0054)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.MovieSceneMarginTrack
// 0x0000 (0x003C)
class UMovieSceneMarginTrack : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.NamedSlotInterface
// 0x0000 (0x001C)
class UNamedSlotInterface : public UInterface
{
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.PropertyBinding
// 0x001C (0x0038)
class UPropertyBinding : public UObject
{
public:
	TWeakObjectPtr<class UObject>                                                                        SourceObject;                                      // 0x001C (0x0008)
	FDynamicPropertyPath                                                                                 SourcePath;                                        // 0x0024 (0x000C)
	FName                                                                                                DestinationProperty;                               // 0x0030 (0x0008)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.BoolBinding
// 0x0000 (0x0038)
class UBoolBinding : public UPropertyBinding
{
public:
	bool GetValue() const; // Function /Script/UMG.BoolBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.BrushBinding
// 0x0004 (0x003C)
class UBrushBinding : public UPropertyBinding
{
public:
	uint8_t                                                                                              UnknownData_38[0x4];                               // 0x0038 (0x0004) MISSED OFFSET
public:
	FSlateBrush GetValue() const; // Function /Script/UMG.BrushBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.CheckedStateBinding
// 0x0004 (0x003C)
class UCheckedStateBinding : public UPropertyBinding
{
public:
	uint8_t                                                                                              UnknownData_38[0x4];                               // 0x0038 (0x0004) MISSED OFFSET
public:
	ECheckBoxState GetValue() const; // Function /Script/UMG.CheckedStateBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ColorBinding
// 0x0004 (0x003C)
class UColorBinding : public UPropertyBinding
{
public:
	uint8_t                                                                                              UnknownData_38[0x4];                               // 0x0038 (0x0004) MISSED OFFSET
public:
	FSlateColor GetSlateValue() const; // Function /Script/UMG.ColorBinding:GetSlateValue
	FLinearColor GetLinearValue() const; // Function /Script/UMG.ColorBinding:GetLinearValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.FloatBinding
// 0x0000 (0x0038)
class UFloatBinding : public UPropertyBinding
{
public:
	float GetValue() const; // Function /Script/UMG.FloatBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.Int32Binding
// 0x0000 (0x0038)
class UInt32Binding : public UPropertyBinding
{
public:
	int32_t GetValue() const; // Function /Script/UMG.Int32Binding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.MouseCursorBinding
// 0x0000 (0x0038)
class UMouseCursorBinding : public UPropertyBinding
{
public:
	EMouseCursor GetValue() const; // Function /Script/UMG.MouseCursorBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.TextBinding
// 0x0004 (0x003C)
class UTextBinding : public UPropertyBinding
{
public:
	uint8_t                                                                                              UnknownData_38[0x4];                               // 0x0038 (0x0004) MISSED OFFSET
public:
	FText GetTextValue() const; // Function /Script/UMG.TextBinding:GetTextValue
	FString GetStringValue() const; // Function /Script/UMG.TextBinding:GetStringValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.VisibilityBinding
// 0x0000 (0x0038)
class UVisibilityBinding : public UPropertyBinding
{
public:
	ESlateVisibility GetValue() const; // Function /Script/UMG.VisibilityBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.WidgetBinding
// 0x0000 (0x0038)
class UWidgetBinding : public UPropertyBinding
{
public:
	class UWidget* GetValue() const; // Function /Script/UMG.WidgetBinding:GetValue
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.RichTextBlockDecorator
// 0x0008 (0x0024)
class URichTextBlockDecorator : public UObject
{
public:
	bool                                                                                                 bReveal;                                           // 0x001C (0x0001)
	uint8_t                                                                                              UnknownData_1D[0x3];                               // 0x001D (0x0003) MISSED OFFSET
	int32_t                                                                                              RevealedIndex;                                     // 0x0020 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.SlateBlueprintLibrary
// 0x0000 (0x001C)
class USlateBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:
	static void LocalToViewport(class UObject* WorldContextObject, FGeometry Geometry, FVector2D LocalCoordinate, FVector2D PixelPosition, FVector2D ViewportPosition); // Function /Script/UMG.SlateBlueprintLibrary:LocalToViewport
	static FVector2D LocalToAbsolute(FGeometry Geometry, FVector2D LocalCoordinate); // Function /Script/UMG.SlateBlueprintLibrary:LocalToAbsolute
	static bool IsUnderLocation(FGeometry Geometry, FVector2D AbsoluteCoordinate); // Function /Script/UMG.SlateBlueprintLibrary:IsUnderLocation
	static FVector2D GetLocalSize(FGeometry Geometry); // Function /Script/UMG.SlateBlueprintLibrary:GetLocalSize
	static void AbsoluteToViewport(class UObject* WorldContextObject, FVector2D AbsoluteDesktopCoordinate, FVector2D PixelPosition, FVector2D ViewportPosition); // Function /Script/UMG.SlateBlueprintLibrary:AbsoluteToViewport
	static FVector2D AbsoluteToLocal(FGeometry Geometry, FVector2D AbsoluteCoordinate); // Function /Script/UMG.SlateBlueprintLibrary:AbsoluteToLocal
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.SlateDataSheet
// 0x0404 (0x0420)
class USlateDataSheet : public UObject
{
public:
	class UTexture2D*                                                                                    DataTexture;                                       // 0x001C (0x0004)
	uint8_t                                                                                              UnknownData_20[0x400];                             // 0x0020 (0x0400) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.SlateVectorArtData
// 0x002C (0x0048)
class USlateVectorArtData : public UObject
{
public:
	TArray<FSlateMeshVertex>                                                                             VertexData;                                        // 0x001C (0x000C)
	TArray<uint32_t>                                                                                     IndexData;                                         // 0x0028 (0x000C)
	class UMaterialInterface*                                                                            Material;                                          // 0x0034 (0x0004)
	FVector2D                                                                                            ExtentMin;                                         // 0x0038 (0x0008)
	FVector2D                                                                                            ExtentMax;                                         // 0x0040 (0x0008)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.UMGSequencePlayer
// 0x00A8 (0x00C4)
class UUMGSequencePlayer : public UObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x10];                              // 0x001C (0x0010) MISSED OFFSET
	class UWidgetAnimation*                                                                              Animation;                                         // 0x002C (0x0004)
	uint8_t                                                                                              UnknownData_30[0x94];                              // 0x0030 (0x0094) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.Visual
// 0x0000 (0x001C)
class UVisual : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.PanelSlot
// 0x0008 (0x0024)
class UPanelSlot : public UVisual
{
public:
	class UPanelWidget*                                                                                  Parent;                                            // 0x001C (0x0004)
	class UWidget*                                                                                       Content;                                           // 0x0020 (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.BorderSlot
// 0x001C (0x0040)
class UBorderSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0xA];                               // 0x0036 (0x000A) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.BorderSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.BorderSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.BorderSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ButtonSlot
// 0x001C (0x0040)
class UButtonSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0xA];                               // 0x0036 (0x000A) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.ButtonSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.ButtonSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.ButtonSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.CanvasPanelSlot
// 0x0034 (0x0058)
class UCanvasPanelSlot : public UPanelSlot
{
public:
	FAnchorData                                                                                          LayoutData;                                        // 0x0024 (0x0028)
	bool                                                                                                 bAutoSize;                                         // 0x004C (0x0001)
	uint8_t                                                                                              UnknownData_4D[0x3];                               // 0x004D (0x0003) MISSED OFFSET
	int32_t                                                                                              ZOrder;                                            // 0x0050 (0x0004)
	uint8_t                                                                                              UnknownData_54[0x4];                               // 0x0054 (0x0004) MISSED OFFSET
public:
	void SetZOrder(int32_t InZOrder); // Function /Script/UMG.CanvasPanelSlot:SetZOrder
	void SetSize(FVector2D InSize); // Function /Script/UMG.CanvasPanelSlot:SetSize
	void SetPosition(FVector2D InPosition); // Function /Script/UMG.CanvasPanelSlot:SetPosition
	void SetOffsets(FMargin InOffset); // Function /Script/UMG.CanvasPanelSlot:SetOffsets
	void SetMinimum(FVector2D InMinimumAnchors); // Function /Script/UMG.CanvasPanelSlot:SetMinimum
	void SetMaximum(FVector2D InMaximumAnchors); // Function /Script/UMG.CanvasPanelSlot:SetMaximum
	void SetLayout(FAnchorData InLayoutData); // Function /Script/UMG.CanvasPanelSlot:SetLayout
	void SetAutoSize(bool InbAutoSize); // Function /Script/UMG.CanvasPanelSlot:SetAutoSize
	void SetAnchors(FAnchors InAnchors); // Function /Script/UMG.CanvasPanelSlot:SetAnchors
	void SetAlignment(FVector2D InAlignment); // Function /Script/UMG.CanvasPanelSlot:SetAlignment
	int32_t GetZOrder() const; // Function /Script/UMG.CanvasPanelSlot:GetZOrder
	FVector2D GetSize() const; // Function /Script/UMG.CanvasPanelSlot:GetSize
	FVector2D GetPosition() const; // Function /Script/UMG.CanvasPanelSlot:GetPosition
	FMargin GetOffsets() const; // Function /Script/UMG.CanvasPanelSlot:GetOffsets
	FAnchorData GetLayout() const; // Function /Script/UMG.CanvasPanelSlot:GetLayout
	bool GetAutoSize() const; // Function /Script/UMG.CanvasPanelSlot:GetAutoSize
	FAnchors GetAnchors() const; // Function /Script/UMG.CanvasPanelSlot:GetAnchors
	FVector2D GetAlignment() const; // Function /Script/UMG.CanvasPanelSlot:GetAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.GridSlot
// 0x0024 (0x0048)
class UGridSlot : public UPanelSlot
{
public:
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0024 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0025 (0x0001)
	uint8_t                                                                                              UnknownData_26[0x2];                               // 0x0026 (0x0002) MISSED OFFSET
	int32_t                                                                                              Row;                                               // 0x0028 (0x0004)
	int32_t                                                                                              RowSpan;                                           // 0x002C (0x0004)
	int32_t                                                                                              Column;                                            // 0x0030 (0x0004)
	int32_t                                                                                              ColumnSpan;                                        // 0x0034 (0x0004)
	int32_t                                                                                              Layer;                                             // 0x0038 (0x0004)
	FVector2D                                                                                            Nudge;                                             // 0x003C (0x0008)
	uint8_t                                                                                              UnknownData_44[0x4];                               // 0x0044 (0x0004) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.GridSlot:SetVerticalAlignment
	void SetRowSpan(int32_t InRowSpan); // Function /Script/UMG.GridSlot:SetRowSpan
	void SetRow(int32_t InRow); // Function /Script/UMG.GridSlot:SetRow
	void SetLayer(int32_t InLayer); // Function /Script/UMG.GridSlot:SetLayer
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.GridSlot:SetHorizontalAlignment
	void SetColumnSpan(int32_t InColumnSpan); // Function /Script/UMG.GridSlot:SetColumnSpan
	void SetColumn(int32_t InColumn); // Function /Script/UMG.GridSlot:SetColumn
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.HorizontalBoxSlot
// 0x0020 (0x0044)
class UHorizontalBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	FSlateChildSize                                                                                      Size;                                              // 0x0034 (0x0008)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x003C (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x003D (0x0001)
	uint8_t                                                                                              UnknownData_3E[0x6];                               // 0x003E (0x0006) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.HorizontalBoxSlot:SetVerticalAlignment
	void SetSize(FSlateChildSize InSize); // Function /Script/UMG.HorizontalBoxSlot:SetSize
	void SetPadding(FMargin InPadding); // Function /Script/UMG.HorizontalBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.HorizontalBoxSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.OverlaySlot
// 0x0018 (0x003C)
class UOverlaySlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0x6];                               // 0x0036 (0x0006) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.OverlaySlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.OverlaySlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.OverlaySlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.SafeZoneSlot
// 0x0014 (0x0038)
class USafeZoneSlot : public UPanelSlot
{
public:
	bool                                                                                                 bIsTitleSafe;                                      // 0x0024 (0x0001)
	EHorizontalAlignment                                                                                 HAlign;                                            // 0x0025 (0x0001)
	EVerticalAlignment                                                                                   VAlign;                                            // 0x0026 (0x0001)
	uint8_t                                                                                              UnknownData_27[0x1];                               // 0x0027 (0x0001) MISSED OFFSET
	FMargin                                                                                              Padding;                                           // 0x0028 (0x0010)
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ScaleBoxSlot
// 0x001C (0x0040)
class UScaleBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0xA];                               // 0x0036 (0x000A) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.ScaleBoxSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.ScaleBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.ScaleBoxSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ScrollBoxSlot
// 0x0018 (0x003C)
class UScrollBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	uint8_t                                                                                              UnknownData_35[0x7];                               // 0x0035 (0x0007) MISSED OFFSET
public:
	void SetPadding(FMargin InPadding); // Function /Script/UMG.ScrollBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.ScrollBoxSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.SizeBoxSlot
// 0x001C (0x0040)
class USizeBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0xA];                               // 0x0036 (0x000A) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.SizeBoxSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.SizeBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.SizeBoxSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.UniformGridSlot
// 0x0010 (0x0034)
class UUniformGridSlot : public UPanelSlot
{
public:
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0024 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0025 (0x0001)
	uint8_t                                                                                              UnknownData_26[0x2];                               // 0x0026 (0x0002) MISSED OFFSET
	int32_t                                                                                              Row;                                               // 0x0028 (0x0004)
	int32_t                                                                                              Column;                                            // 0x002C (0x0004)
	uint8_t                                                                                              UnknownData_30[0x4];                               // 0x0030 (0x0004) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.UniformGridSlot:SetVerticalAlignment
	void SetRow(int32_t InRow); // Function /Script/UMG.UniformGridSlot:SetRow
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.UniformGridSlot:SetHorizontalAlignment
	void SetColumn(int32_t InColumn); // Function /Script/UMG.UniformGridSlot:SetColumn
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.VerticalBoxSlot
// 0x0020 (0x0044)
class UVerticalBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	FSlateChildSize                                                                                      Size;                                              // 0x0034 (0x0008)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x003C (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x003D (0x0001)
	uint8_t                                                                                              UnknownData_3E[0x6];                               // 0x003E (0x0006) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.VerticalBoxSlot:SetVerticalAlignment
	void SetSize(FSlateChildSize InSize); // Function /Script/UMG.VerticalBoxSlot:SetSize
	void SetPadding(FMargin InPadding); // Function /Script/UMG.VerticalBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.VerticalBoxSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.WidgetSwitcherSlot
// 0x0018 (0x003C)
class UWidgetSwitcherSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x0034 (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x0035 (0x0001)
	uint8_t                                                                                              UnknownData_36[0x6];                               // 0x0036 (0x0006) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.WidgetSwitcherSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.WidgetSwitcherSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.WidgetSwitcherSlot:SetHorizontalAlignment
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.WrapBoxSlot
// 0x0020 (0x0044)
class UWrapBoxSlot : public UPanelSlot
{
public:
	FMargin                                                                                              Padding;                                           // 0x0024 (0x0010)
	bool                                                                                                 bFillEmptySpace;                                   // 0x0034 (0x0001)
	uint8_t                                                                                              UnknownData_35[0x3];                               // 0x0035 (0x0003) MISSED OFFSET
	float                                                                                                FillSpanWhenLessThan;                              // 0x0038 (0x0004)
	EHorizontalAlignment                                                                                 HorizontalAlignment;                               // 0x003C (0x0001)
	EVerticalAlignment                                                                                   VerticalAlignment;                                 // 0x003D (0x0001)
	uint8_t                                                                                              UnknownData_3E[0x6];                               // 0x003E (0x0006) MISSED OFFSET
public:
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // Function /Script/UMG.WrapBoxSlot:SetVerticalAlignment
	void SetPadding(FMargin InPadding); // Function /Script/UMG.WrapBoxSlot:SetPadding
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // Function /Script/UMG.WrapBoxSlot:SetHorizontalAlignment
	void SetFillSpanWhenLessThan(float InFillSpanWhenLessThan); // Function /Script/UMG.WrapBoxSlot:SetFillSpanWhenLessThan
	void SetFillEmptySpace(bool InbFillEmptySpace); // Function /Script/UMG.WrapBoxSlot:SetFillEmptySpace
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.Widget
// 0x00B4 (0x00D0)
class UWidget : public UVisual
{
public:
	bool                                                                                                 bIsVariable;                                       // 0x001C (0x0001)
	bool                                                                                                 bCreatedByConstructionScript;                      // 0x001D (0x0001)
	uint8_t                                                                                              UnknownData_1E[0x2];                               // 0x001E (0x0002) MISSED OFFSET
	class UPanelSlot*                                                                                    Slot;                                              // 0x0020 (0x0004)
	bool                                                                                                 bIsEnabled;                                        // 0x0024 (0x0001)
	uint8_t                                                                                              UnknownData_25[0x3];                               // 0x0025 (0x0003) MISSED OFFSET
	struct FUWidget_GetBool__DelegateSignature                                                           bIsEnabledDelegate;                                // 0x0028 (0x0010)
	FText                                                                                                ToolTipText;                                       // 0x0038 (0x000C)
	struct FUWidget_GetText__DelegateSignature                                                           ToolTipTextDelegate;                               // 0x0044 (0x0010)
	class UWidget*                                                                                       ToolTipWidget;                                     // 0x0054 (0x0004)
	struct FUWidget_GetWidget__DelegateSignature                                                         ToolTipWidgetDelegate;                             // 0x0058 (0x0010)
	ESlateVisibility                                                                                     Visiblity;                                         // 0x0068 (0x0001)
	ESlateVisibility                                                                                     Visibility;                                        // 0x0069 (0x0001)
	uint8_t                                                                                              UnknownData_6A[0x2];                               // 0x006A (0x0002) MISSED OFFSET
	struct FUWidget_GetSlateVisibility__DelegateSignature                                                VisibilityDelegate;                                // 0x006C (0x0010)
	uint8_t                                                                                              bOverride_Cursor : 1;                              // 0x007C (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              UnknownData_7D[0x3];                               // 0x007D (0x0003) MISSED OFFSET
	EMouseCursor                                                                                         Cursor;                                            // 0x0080 (0x0001)
	bool                                                                                                 bIsVolatile;                                       // 0x0081 (0x0001)
	uint8_t                                                                                              UnknownData_82[0x2];                               // 0x0082 (0x0002) MISSED OFFSET
	FWidgetTransform                                                                                     RenderTransform;                                   // 0x0084 (0x001C)
	FVector2D                                                                                            RenderTransformPivot;                              // 0x00A0 (0x0008)
	class UWidgetNavigation*                                                                             Navigation;                                        // 0x00A8 (0x0004)
	uint8_t                                                                                              UnknownData_AC[0x18];                              // 0x00AC (0x0018) MISSED OFFSET
	TArray<class UPropertyBinding*>                                                                      NativeBindings;                                    // 0x00C4 (0x000C)
public:
	void SetVisibility(ESlateVisibility InVisibility); // Function /Script/UMG.Widget:SetVisibility
	void SetUserFocus(class APlayerController* PlayerController); // Function /Script/UMG.Widget:SetUserFocus
	void SetToolTipText(FText InToolTipText); // Function /Script/UMG.Widget:SetToolTipText
	void SetToolTip(class UWidget* Widget); // Function /Script/UMG.Widget:SetToolTip
	void SetRenderTranslation(FVector2D Translation); // Function /Script/UMG.Widget:SetRenderTranslation
	void SetRenderTransformPivot(FVector2D Pivot); // Function /Script/UMG.Widget:SetRenderTransformPivot
	void SetRenderTransform(FWidgetTransform InTransform); // Function /Script/UMG.Widget:SetRenderTransform
	void SetRenderShear(FVector2D Shear); // Function /Script/UMG.Widget:SetRenderShear
	void SetRenderScale(FVector2D Scale); // Function /Script/UMG.Widget:SetRenderScale
	void SetRenderAngle(float Angle); // Function /Script/UMG.Widget:SetRenderAngle
	void SetKeyboardFocus(); // Function /Script/UMG.Widget:SetKeyboardFocus
	void SetIsEnabled(bool bInIsEnabled); // Function /Script/UMG.Widget:SetIsEnabled
	void SetCursor(EMouseCursor InCursor); // Function /Script/UMG.Widget:SetCursor
	void ResetCursor(); // Function /Script/UMG.Widget:ResetCursor
	void RemoveFromParent(); // Function /Script/UMG.Widget:RemoveFromParent
	FEventReply OnReply__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:OnReply__DelegateSignature
	FEventReply OnPointerEvent__DelegateSignature(FGeometry MyGeometry, FPointerEvent MouseEvent); // DelegateFunction /Script/UMG.Widget:OnPointerEvent__DelegateSignature
	bool IsVisible() const; // Function /Script/UMG.Widget:IsVisible
	bool IsHovered() const; // Function /Script/UMG.Widget:IsHovered
	void InvalidateLayoutAndVolatility(); // Function /Script/UMG.Widget:InvalidateLayoutAndVolatility
	bool HasUserFocusedDescendants(class APlayerController* PlayerController) const; // Function /Script/UMG.Widget:HasUserFocusedDescendants
	bool HasUserFocus(class APlayerController* PlayerController) const; // Function /Script/UMG.Widget:HasUserFocus
	bool HasMouseCapture() const; // Function /Script/UMG.Widget:HasMouseCapture
	bool HasKeyboardFocus() const; // Function /Script/UMG.Widget:HasKeyboardFocus
	bool HasFocusedDescendants() const; // Function /Script/UMG.Widget:HasFocusedDescendants
	bool HasAnyUserFocus() const; // Function /Script/UMG.Widget:HasAnyUserFocus
	class UWidget* GetWidget__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetWidget__DelegateSignature
	ESlateVisibility GetVisibility() const; // Function /Script/UMG.Widget:GetVisibility
	FText GetText__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetText__DelegateSignature
	ESlateVisibility GetSlateVisibility__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetSlateVisibility__DelegateSignature
	FSlateColor GetSlateColor__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetSlateColor__DelegateSignature
	FSlateBrush GetSlateBrush__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetSlateBrush__DelegateSignature
	class UPanelWidget* GetParent() const; // Function /Script/UMG.Widget:GetParent
	EMouseCursor GetMouseCursor__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetMouseCursor__DelegateSignature
	FLinearColor GetLinearColor__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetLinearColor__DelegateSignature
	bool GetIsEnabled() const; // Function /Script/UMG.Widget:GetIsEnabled
	int32_t GetInt32__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetInt32__DelegateSignature
	float GetFloat__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetFloat__DelegateSignature
	FVector2D GetDesiredSize() const; // Function /Script/UMG.Widget:GetDesiredSize
	ECheckBoxState GetCheckBoxState__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetCheckBoxState__DelegateSignature
	bool GetBool__DelegateSignature(); // DelegateFunction /Script/UMG.Widget:GetBool__DelegateSignature
	class UWidget* GenerateWidgetForString__DelegateSignature(FString Item); // DelegateFunction /Script/UMG.Widget:GenerateWidgetForString__DelegateSignature
	class UWidget* GenerateWidgetForObject__DelegateSignature(class UObject* Item); // DelegateFunction /Script/UMG.Widget:GenerateWidgetForObject__DelegateSignature
	void ForceVolatile(bool bForce); // Function /Script/UMG.Widget:ForceVolatile
	void ForceLayoutPrepass(); // Function /Script/UMG.Widget:ForceLayoutPrepass
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.CircularThrobber
// 0x008C (0x015C)
class UCircularThrobber : public UWidget
{
public:
	int32_t                                                                                              NumberOfPieces;                                    // 0x00D0 (0x0004)
	float                                                                                                Period;                                            // 0x00D4 (0x0004)
	float                                                                                                Radius;                                            // 0x00D8 (0x0004)
	class USlateBrushAsset*                                                                              PieceImage;                                        // 0x00DC (0x0004)
	FSlateBrush                                                                                          Image;                                             // 0x00E0 (0x0074)
	uint8_t                                                                                              UnknownData_154[0x8];                              // 0x0154 (0x0008) MISSED OFFSET
public:
	void SetRadius(float InRadius); // Function /Script/UMG.CircularThrobber:SetRadius
	void SetPeriod(float InPeriod); // Function /Script/UMG.CircularThrobber:SetPeriod
	void SetNumberOfPieces(int32_t InNumberOfPieces); // Function /Script/UMG.CircularThrobber:SetNumberOfPieces
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ComboBox
// 0x0024 (0x00F4)
class UComboBox : public UWidget
{
public:
	TArray<class UObject*>                                                                               Items;                                             // 0x00D0 (0x000C)
	struct FUWidget_GenerateWidgetForObject__DelegateSignature                                           OnGenerateWidgetEvent;                             // 0x00DC (0x0010)
	uint8_t                                                                                              UnknownData_EC[0x8];                               // 0x00EC (0x0008) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.ComboBoxString
// 0x03E0 (0x04B0)
class UComboBoxString : public UWidget
{
public:
	TArray<FString>                                                                                      DefaultOptions;                                    // 0x00D0 (0x000C)
	FString                                                                                              SelectedOption;                                    // 0x00DC (0x000C)
	FComboBoxStyle                                                                                       WidgetStyle;                                       // 0x00E8 (0x0364)
	FMargin                                                                                              ContentPadding;                                    // 0x044C (0x0010)
	float                                                                                                MaxListHeight;                                     // 0x045C (0x0004)
	bool                                                                                                 HasDownArrow;                                      // 0x0460 (0x0001)
	uint8_t                                                                                              UnknownData_461[0x3];                              // 0x0461 (0x0003) MISSED OFFSET
	struct FUWidget_GenerateWidgetForString__DelegateSignature                                           OnGenerateWidgetEvent;                             // 0x0464 (0x0010)
	struct FUComboBoxString_OnSelectionChangedEvent__DelegateSignature                                   OnSelectionChanged;                                // 0x0474 (0x000C)
	struct FUComboBoxString_OnOpeningEvent__DelegateSignature                                            OnOpening;                                         // 0x0480 (0x000C)
	uint8_t                                                                                              UnknownData_48C[0x24];                             // 0x048C (0x0024) MISSED OFFSET
public:
	void SetSelectedOption(FString Option); // Function /Script/UMG.ComboBoxString:SetSelectedOption
	bool RemoveOption(FString Option); // Function /Script/UMG.ComboBoxString:RemoveOption
	void RefreshOptions(); // Function /Script/UMG.ComboBoxString:RefreshOptions
	void OnSelectionChangedEvent__DelegateSignature(FString SelectedItem, ESelectInfo SelectionType); // DelegateFunction /Script/UMG.ComboBoxString:OnSelectionChangedEvent__DelegateSignature
	void OnOpeningEvent__DelegateSignature(); // DelegateFunction /Script/UMG.ComboBoxString:OnOpeningEvent__DelegateSignature
	FString GetSelectedOption() const; // Function /Script/UMG.ComboBoxString:GetSelectedOption
	int32_t GetOptionCount() const; // Function /Script/UMG.ComboBoxString:GetOptionCount
	FString GetOptionAtIndex(int32_t INDEX) const; // Function /Script/UMG.ComboBoxString:GetOptionAtIndex
	int32_t FindOptionIndex(FString Option) const; // Function /Script/UMG.ComboBoxString:FindOptionIndex
	void ClearSelection(); // Function /Script/UMG.ComboBoxString:ClearSelection
	void ClearOptions(); // Function /Script/UMG.ComboBoxString:ClearOptions
	void AddOption(FString Option); // Function /Script/UMG.ComboBoxString:AddOption
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.EditableText
// 0x0260 (0x0330)
class UEditableText : public UWidget
{
public:
	FText                                                                                                TEXT;                                              // 0x00D0 (0x000C)
	struct FUWidget_GetText__DelegateSignature                                                           TextDelegate;                                      // 0x00DC (0x0010)
	FText                                                                                                HintText;                                          // 0x00EC (0x000C)
	struct FUWidget_GetText__DelegateSignature                                                           HintTextDelegate;                                  // 0x00F8 (0x0010)
	FEditableTextStyle                                                                                   WidgetStyle;                                       // 0x0108 (0x01A4)
	class USlateWidgetStyleAsset*                                                                        Style;                                             // 0x02AC (0x0004)
	class USlateBrushAsset*                                                                              BackgroundImageSelected;                           // 0x02B0 (0x0004)
	class USlateBrushAsset*                                                                              BackgroundImageComposing;                          // 0x02B4 (0x0004)
	class USlateBrushAsset*                                                                              CaretImage;                                        // 0x02B8 (0x0004)
	FSlateFontInfo                                                                                       Font;                                              // 0x02BC (0x0028)
	FSlateColor                                                                                          ColorAndOpacity;                                   // 0x02E4 (0x001C)
	bool                                                                                                 IsReadOnly;                                        // 0x0300 (0x0001)
	bool                                                                                                 IsPassword;                                        // 0x0301 (0x0001)
	uint8_t                                                                                              UnknownData_302[0x2];                              // 0x0302 (0x0002) MISSED OFFSET
	float                                                                                                MinimumDesiredWidth;                               // 0x0304 (0x0004)
	bool                                                                                                 IsCaretMovedWhenGainFocus;                         // 0x0308 (0x0001)
	bool                                                                                                 SelectAllTextWhenFocused;                          // 0x0309 (0x0001)
	bool                                                                                                 RevertTextOnEscape;                                // 0x030A (0x0001)
	bool                                                                                                 ClearKeyboardFocusOnCommit;                        // 0x030B (0x0001)
	bool                                                                                                 SelectAllTextOnCommit;                             // 0x030C (0x0001)
	bool                                                                                                 AllowContextMenu;                                  // 0x030D (0x0001)
	EVirtualKeyboardType                                                                                 KeyboardType;                                      // 0x030E (0x0001)
	uint8_t                                                                                              UnknownData_30F[0x1];                              // 0x030F (0x0001) MISSED OFFSET
	struct FUEditableText_OnEditableTextChangedEvent__DelegateSignature                                  OnTextChanged;                                     // 0x0310 (0x000C)
	struct FUEditableText_OnEditableTextCommittedEvent__DelegateSignature                                OnTextCommitted;                                   // 0x031C (0x000C)
	uint8_t                                                                                              UnknownData_328[0x8];                              // 0x0328 (0x0008) MISSED OFFSET
public:
	void SetText(FText InText); // Function /Script/UMG.EditableText:SetText
	void SetIsReadOnly(bool InbIsReadyOnly); // Function /Script/UMG.EditableText:SetIsReadOnly
	void SetIsPassword(bool InbIsPassword); // Function /Script/UMG.EditableText:SetIsPassword
	void SetHintText(FText InHintText); // Function /Script/UMG.EditableText:SetHintText
	void OnEditableTextCommittedEvent__DelegateSignature(FText TEXT, ETextCommit CommitMethod); // DelegateFunction /Script/UMG.EditableText:OnEditableTextCommittedEvent__DelegateSignature
	void OnEditableTextChangedEvent__DelegateSignature(FText TEXT); // DelegateFunction /Script/UMG.EditableText:OnEditableTextChangedEvent__DelegateSignature
	FText GetText() const; // Function /Script/UMG.EditableText:GetText
public:
	static class UClass* StaticClass();
};

// Class /Script/UMG.EditableTextBox
// 0x076C (0x083C)
class UEditableTextBox : public UWidget
{
public:
	FText                                                                                                TEXT;                                              // 0x00D0 (0x000C)
	struct FUWidget_GetText__DelegateSignature                                                           TextDelegate;                                      // 0x00DC (0x0010)
	FEditableTextBoxStyle                                                                                WidgetStyle;                                       // 0x00EC (0x0698)
	class USlateWidgetStyleAsset*                                                                        Style;                                             // 0x0784 (0x0004)
	FText                                                                                                HintText;                                          // 0x0788 (0x000C)
	struct FUWidget_GetText__DelegateSignature                                                           HintTextDelegate;                                  // 0x0794 (0x0010)
	FSlateFontInfo                                                                                       Font;                                              // 0x07A4 (0x0028)
	FLinearColor                                                                                         ForegroundColor;                                   // 0x07CC (0x0010)
	FLinearColor                                                                                         BackgroundColor;                                   // 0x07DC (0x0010)
	FLinearColor                                                                                         ReadOnlyForegroundColor;                           // 0x07EC (0x0010)
	bool                                                                                                 IsReadOnly;                                        // 0x07FC (0x0001)
	bool                                                                                                 IsPassword;                                        // 0x07FD (0x0001)
	uint8_t                                                                                              UnknownData_7FE[0x2];                              // 0x07FE (0x0002) MISSED OFFSET
	float                                                                                                MinimumDesiredWidth;                               // 0x0800 (0x0004)
	FMargin                                                                                              Padding;                                           // 0x0804 (0x0010)
	bool                                                                                                 IsCaretMovedWhenGainFocus;                         // 0x0814 (0x0001)
	bool                                                                                                 SelectAllTextWhenFocused;                          // 0x0815 (0x0001)
	bool                                                                                                 RevertTextOnEscape;                                // 0x0816 (0x0001)
	bool                                                                                                 ClearKeyboardFocusOnCommit;                        // 0x0817 (0x0001)
	bool                                                                                                 SelectAllTextOnCommit;                             // 0x0818 (0x0001)
	bool                                                                                                 AllowContextMenu;                                  // 0x0819 (0x0001)
	EVirtualKeyboardType                                                                                 KeyboardType;                                      // 0x081A (0x0001)
	uint8_t                                                                                              UnknownData_81B[0x1];                              // 0x081B (0x0001) MISSED OFFSET
