#pragma once
#include "FN_Basic.h"

#include "FN_UIManager_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_FortniteUI_classes.h"
#include "FN_ModalQueueEntry_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: UIManager
*/

// WidgetBlueprintGeneratedClass /game/UI/Global_Elements/UIManager.UIManager_C
// 0x0044 (0x0394)
class UUIManager_C : public UFortUIManagerWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0350 (0x0004)
	class ULightBox_C*                                                                                   _LightBox__Modal;                                  // 0x0354 (0x0004)
	class UButton*                                                                                       CancelCurrencyStore_Button;                        // 0x0358 (0x0004)
	class UConfirmationWindow_C*                                                                         ConfirmationWindow;                                // 0x035C (0x0004)
	class UErrorDialogBP_C*                                                                              Error_Dialog;                                      // 0x0360 (0x0004)
	class UImage*                                                                                        Image_583;                                         // 0x0364 (0x0004)
	class UNotificationWindow_C*                                                                         NotificationWindow;                                // 0x0368 (0x0004)
	class UPopupFrame_C*                                                                                 PopupFrame;                                        // 0x036C (0x0004)
	class UNamedSlot*                                                                                    State_Content_Layer;                               // 0x0370 (0x0004)
	class UCircularThrobber*                                                                             Throbber;                                          // 0x0374 (0x0004)
	class UTutorialOverlay_C*                                                                            TutorialOverlay;                                   // 0x0378 (0x0004)
	class UNamedSlot*                                                                                    Web_Layer;                                         // 0x037C (0x0004)
	class UBorder*                                                                                       WebContent;                                        // 0x0380 (0x0004)
	class UFortActionHandlerPanel*                                                                       ModalWidget;                                       // 0x0384 (0x0004)
	TArray<FModalQueueEntry>                                                                             ModalQueue;                                        // 0x0388 (0x000C)
public:
	void HandleModalContentCleared(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:HandleModalContentCleared
	bool IsStateContentChildShowing(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:IsStateContentChildShowing
	void DismissPurchaseWidget(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:DismissPurchaseWidget
	void DisplayPurchaseWidget(class UWidget* Web_Widget, FString OfferId); // Function /game/UI/Global_Elements/UIManager.UIManager_C:DisplayPurchaseWidget
	void BindDelegates(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:BindDelegates
	void ShowNextModalWidget(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:ShowNextModalWidget
	void QueueActionPanelInModalLayer(class UFortActionHandlerPanel* InActionHandlerPanel, EHorizontalAlignment InHorizontalAlignment, EVerticalAlignment InVerticalAlignment); // Function /game/UI/Global_Elements/UIManager.UIManager_C:QueueActionPanelInModalLayer
	void ClearModalLayer(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:ClearModalLayer
	void ClearLayers(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:ClearLayers
	void ShowActionPanelInModalLayer(class UFortActionHandlerPanel* InActionHandlerPanel, EHorizontalAlignment InHorizontalAlignment, EVerticalAlignment InVerticalAlignment); // Function /game/UI/Global_Elements/UIManager.UIManager_C:ShowActionPanelInModalLayer
	void DisplayOKButtonConfirmation(FText Header, FText Message); // Function /game/UI/Global_Elements/UIManager.UIManager_C:DisplayOKButtonConfirmation
	void Construct(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:Construct
	void KillConfirmation(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:KillConfirmation
	void UpdateStateWidgetContent(class UFortUIStateWidget* StateWidget); // Function /game/UI/Global_Elements/UIManager.UIManager_C:UpdateStateWidgetContent
	void OnShowConfirmation(FFortDialogDescription Description); // Function /game/UI/Global_Elements/UIManager.UIManager_C:OnShowConfirmation
	void DisplayStateContent(bool bDisplay); // Function /game/UI/Global_Elements/UIManager.UIManager_C:DisplayStateContent
	void OnStateStarted(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:OnStateStarted
	void Destruct(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:Destruct
	void BndEvt__CancelCurrencyStore_Button_K2Node_ComponentBoundEvent_489_OnButtonClickedEvent__DelegateSignature(); // Function /game/UI/Global_Elements/UIManager.UIManager_C:BndEvt__CancelCurrencyStore_Button_K2Node_ComponentBoundEvent_489_OnButtonClickedEvent__DelegateSignature
	void DisplayErrorDialog(FFortErrorInfo Info); // Function /game/UI/Global_Elements/UIManager.UIManager_C:DisplayErrorDialog
	void ExecuteUbergraph_UIManager(int32_t EntryPoint); // Function /game/UI/Global_Elements/UIManager.UIManager_C:ExecuteUbergraph_UIManager
public:
	static class UClass* StaticClass();
};

