#pragma once
#include "FN_Basic.h"

#include "FN_UMG_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_MovieScene_enums.h"
#include "FN_MovieScene_structs.h"
#include "FN_MovieSceneTracks_enums.h"
#include "FN_MovieSceneTracks_structs.h"
#include "FN_Slate_enums.h"
#include "FN_Slate_structs.h"
#include "FN_SlateCore_enums.h"
#include "FN_SlateCore_structs.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: UMG
*/

// ScriptStruct /Script/UMG.EventReply
// 0x0060 (0x0060)
struct FEventReply
{
	uint8_t                                                                                              UnknownData_0[0x60];                               // 0x0000 (0x0060) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.WidgetTransform
// 0x001C (0x001C)
struct FWidgetTransform
{
	FVector2D                                                                                            Translation;                                       // 0x0000 (0x0008)
	FVector2D                                                                                            Scale;                                             // 0x0008 (0x0008)
	FVector2D                                                                                            Shear;                                             // 0x0010 (0x0008)
	float                                                                                                Angle;                                             // 0x0018 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.ShapedTextOptions
// 0x0008 (0x0008)
struct FShapedTextOptions
{
	uint8_t                                                                                              bOverride_TextShapingMethod : 1;                   // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x01]
	uint8_t                                                                                              bOverride_TextFlowDirection : 1;                   // 0x0000 (0x0001) [BITFIELD] [ByteOffset: 0x00] [Mask: 0x02]
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	ETextShapingMethod                                                                                   TextShapingMethod;                                 // 0x0004 (0x0001)
	ETextFlowDirection                                                                                   TextFlowDirection;                                 // 0x0005 (0x0001)
	uint8_t                                                                                              UnknownData_6[0x2];                                // 0x0006 (0x0002) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.PaintContext
// 0x001C (0x001C)
struct FPaintContext
{
	uint8_t                                                                                              UnknownData_0[0x1C];                               // 0x0000 (0x001C) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.NamedSlotBinding
// 0x000C (0x000C)
struct FNamedSlotBinding
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	class UWidget*                                                                                       Content;                                           // 0x0008 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.PropertyPathSegment
// 0x0014 (0x0014)
struct FPropertyPathSegment
{
	FName                                                                                                Name;                                              // 0x0000 (0x0008)
	int32_t                                                                                              ArrayIndex;                                        // 0x0008 (0x0004)
	class UStruct*                                                                                       Struct;                                            // 0x000C (0x0004)
	class UField*                                                                                        Field;                                             // 0x0010 (0x0004)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.DynamicPropertyPath
// 0x000C (0x000C)
struct FDynamicPropertyPath
{
	TArray<FPropertyPathSegment>                                                                         Segments;                                          // 0x0000 (0x000C)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.SlateChildSize
// 0x0008 (0x0008)
struct FSlateChildSize
{
	float                                                                                                Value;                                             // 0x0000 (0x0004)
	ESlateSizeRule                                                                                       SizeRule;                                          // 0x0004 (0x0001)
	uint8_t                                                                                              UnknownData_5[0x3];                                // 0x0005 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.SlateMeshVertex
// 0x003C (0x003C)
struct FSlateMeshVertex
{
	FVector2D                                                                                            Position;                                          // 0x0000 (0x0008)
	FColor                                                                                               Color;                                             // 0x0008 (0x0004)
	FVector2D                                                                                            UV0;                                               // 0x000C (0x0008)
	FVector2D                                                                                            UV1;                                               // 0x0014 (0x0008)
	FVector2D                                                                                            UV2;                                               // 0x001C (0x0008)
	FVector2D                                                                                            UV3;                                               // 0x0024 (0x0008)
	FVector2D                                                                                            UV4;                                               // 0x002C (0x0008)
	FVector2D                                                                                            UV5;                                               // 0x0034 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.AnchorData
// 0x0028 (0x0028)
struct FAnchorData
{
	FMargin                                                                                              Offsets;                                           // 0x0000 (0x0010)
	FAnchors                                                                                             Anchors;                                           // 0x0010 (0x0010)
	FVector2D                                                                                            Alignment;                                         // 0x0020 (0x0008)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.WidgetAnimationBinding
// 0x0020 (0x0020)
struct FWidgetAnimationBinding
{
	FName                                                                                                WidgetName;                                        // 0x0000 (0x0008)
	FName                                                                                                SlotWidgetName;                                    // 0x0008 (0x0008)
	FGuid                                                                                                AnimationGuid;                                     // 0x0010 (0x0010)

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.DelegateRuntimeBinding
// 0x002C (0x002C)
struct FDelegateRuntimeBinding
{
	FString                                                                                              ObjectName;                                        // 0x0000 (0x000C)
	FName                                                                                                PropertyName;                                      // 0x000C (0x0008)
	FName                                                                                                FunctionName;                                      // 0x0014 (0x0008)
	FDynamicPropertyPath                                                                                 SourcePath;                                        // 0x001C (0x000C)
	EBindingKind                                                                                         Kind;                                              // 0x0028 (0x0001)
	uint8_t                                                                                              UnknownData_29[0x3];                               // 0x0029 (0x0003) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

// ScriptStruct /Script/UMG.WidgetNavigationData
// 0x0014 (0x0014)
struct FWidgetNavigationData
{
	EUINavigationRule                                                                                    Rule;                                              // 0x0000 (0x0001)
	uint8_t                                                                                              UnknownData_1[0x3];                                // 0x0001 (0x0003) MISSED OFFSET
	FName                                                                                                WidgetToFocus;                                     // 0x0004 (0x0008)
	uint8_t                                                                                              UnknownData_C[0x8];                                // 0x000C (0x0008) MISSED OFFSET

	static class UScriptStruct* StaticStruct();
};

