#pragma once
#include "FN_Basic.h"

#include "FN_V2_Item_Card_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: V2_Item_Card
*/

// WidgetBlueprintGeneratedClass /Game/UI/Store/V2_Item_Card.V2_Item_Card_C
// 0x0046 (0x01FE)
class UV2_Item_Card_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UWidgetAnimation*                                                                              Scale;                                             // 0x01BC (0x0004)
	class UWidgetAnimation*                                                                              FlyUp;                                             // 0x01C0 (0x0004)
	class UWidgetAnimation*                                                                              FlyUpand_Down;                                     // 0x01C4 (0x0004)
	class UWidgetAnimation*                                                                              Flydown;                                           // 0x01C8 (0x0004)
	class UWidgetAnimation*                                                                              Reset;                                             // 0x01CC (0x0004)
	class UTextBlock*                                                                                    Bonus_Text;                                        // 0x01D0 (0x0004)
	class UImage*                                                                                        Card;                                              // 0x01D4 (0x0004)
	class UScaleBox*                                                                                     Card_ScaleBox;                                     // 0x01D8 (0x0004)
	class UImage*                                                                                        Foil_Image;                                        // 0x01DC (0x0004)
	class UImage*                                                                                        Image_252;                                         // 0x01E0 (0x0004)
	class USizeBox*                                                                                      StackCounter;                                      // 0x01E4 (0x0004)
	class UTextBlock*                                                                                    StackCounterText;                                  // 0x01E8 (0x0004)
	class UV2_ItemCardFront_C*                                                                           V2_ItemCardFront;                                  // 0x01EC (0x0004)
	FCard                                                                                                CardData;                                          // 0x01F0 (0x000C)
	bool                                                                                                 bIsOn3DCard;                                       // 0x01FC (0x0001)
	bool                                                                                                 bIsFront;                                          // 0x01FD (0x0001)
public:
	void Draw_Card(); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:Draw_Card
	class UWidget* Get_CardOverlay_ToolTipWidget_1(); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:Get_CardOverlay_ToolTipWidget_1
	void ShowCardBack(); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:ShowCardBack
	void ShowCardFront(); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:ShowCardFront
	void Initialize_Card(FCard inCard, bool isOn3DCard, bool isFront); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:Initialize_Card
	void Construct(); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:Construct
	void OnFortStoreStateChanged(EFortStoreState NewStoreState); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:OnFortStoreStateChanged
	void OnMouseEnter(FGeometry MyGeometry, FPointerEvent MouseEvent); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:OnMouseEnter
	void OnMouseLeave(FPointerEvent MouseEvent); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:OnMouseLeave
	void ExecuteUbergraph_V2_Item_Card(int32_t EntryPoint); // Function /Game/UI/Store/V2_Item_Card.V2_Item_Card_C:ExecuteUbergraph_V2_Item_Card
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Store/V2_Item_Card.PLACEHOLDER-CLASS__V2_ItemCardFront_C_166
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__V2_ItemCardFront_C_166
{
public:
	static class UClass* StaticClass();
};

