#pragma once
#include "FN_Basic.h"

#include "FN_V2_ItemCardFront_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: V2_ItemCardFront
*/

// WidgetBlueprintGeneratedClass /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C
// 0x0031 (0x01E9)
class UV2_ItemCardFront_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UScaleBox*                                                                                     Card_ScaleBox;                                     // 0x01BC (0x0004)
	class UTextBlock*                                                                                    Item_Textfield;                                    // 0x01C0 (0x0004)
	class UItem_C*                                                                                       Item_Widget2;                                      // 0x01C4 (0x0004)
	class UBorder*                                                                                       Mask;                                              // 0x01C8 (0x0004)
	class UBorder*                                                                                       NamePlate_Border;                                  // 0x01CC (0x0004)
	class UTextBlock*                                                                                    Rarity_Textfield;                                  // 0x01D0 (0x0004)
	class USizeBox*                                                                                      StackCounter;                                      // 0x01D4 (0x0004)
	class UTextBlock*                                                                                    StackCounterText;                                  // 0x01D8 (0x0004)
	FCard                                                                                                CardData;                                          // 0x01DC (0x000C)
	EFortRarity                                                                                          CurrentRarity;                                     // 0x01E8 (0x0001)
public:
	class UWidget* Get_CardOverlay_ToolTipWidget_1(); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:Get_CardOverlay_ToolTipWidget_1
	void Draw_Card(); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:Draw_Card
	void Initialize_Card(FCard inCard); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:Initialize_Card
	void Construct(); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:Construct
	void OnFortStoreStateChanged(EFortStoreState NewStoreState); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:OnFortStoreStateChanged
	void ExecuteUbergraph_V2_ItemCardFront(int32_t EntryPoint); // Function /Game/UI/Store/V2_ItemCardFront.V2_ItemCardFront_C:ExecuteUbergraph_V2_ItemCardFront
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/UI/Store/V2_ItemCardFront.PLACEHOLDER-CLASS__Item_C_167
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__Item_C_167
{
public:
	static class UClass* StaticClass();
};

