#pragma once
#include "FN_Basic.h"

#include "FN_VersionInfo_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteUI_enums.h"
#include "FN_FortniteUI_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: VersionInfo
*/

// WidgetBlueprintGeneratedClass /Game/UI/Global_Elements/VersionInfo.VersionInfo_C
// 0x0090 (0x0248)
class UVersionInfo_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UTextBlock*                                                                                    _Text__Backend_Name;                               // 0x01BC (0x0004)
	class UTextBlock*                                                                                    _Text__Branch;                                     // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    _Text__Build;                                      // 0x01C4 (0x0004)
	class UTextBlock*                                                                                    _Text__Build_Date;                                 // 0x01C8 (0x0004)
	class UTextBlock*                                                                                    _Text__Changelist;                                 // 0x01CC (0x0004)
	class UTextBlock*                                                                                    _Text__Server_Date;                                // 0x01D0 (0x0004)
	class UTextBlock*                                                                                    _Text__Version;                                    // 0x01D4 (0x0004)
	FFortBackendVersion                                                                                  Data;                                              // 0x01D8 (0x0070)
public:
	void Update(FFortBackendVersion In_Data); // Function /Game/UI/Global_Elements/VersionInfo.VersionInfo_C:Update
	void Construct(); // Function /Game/UI/Global_Elements/VersionInfo.VersionInfo_C:Construct
	void ExecuteUbergraph_VersionInfo(int32_t EntryPoint); // Function /Game/UI/Global_Elements/VersionInfo.VersionInfo_C:ExecuteUbergraph_VersionInfo
public:
	static class UClass* StaticClass();
};

