#pragma once
#include "FN_Basic.h"

#include "FN_VectorVM_enums.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_CoreUObject_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: VectorVM
*/

// Class /Script/VectorVM.NiagaraDataObject
// 0x0000 (0x001C)
class UNiagaraDataObject : public UObject
{
public:
	static class UClass* StaticClass();
};

// Class /Script/VectorVM.NiagaraCurveDataObject
// 0x0004 (0x0020)
class UNiagaraCurveDataObject : public UNiagaraDataObject
{
public:
	class UCurveVector*                                                                                  CurveObj;                                          // 0x001C (0x0004)
public:
	static class UClass* StaticClass();
};

// Class /Script/VectorVM.NiagaraSparseVolumeDataObject
// 0x0018 (0x0034)
class UNiagaraSparseVolumeDataObject : public UNiagaraDataObject
{
public:
	uint8_t                                                                                              UnknownData_1C[0x18];                              // 0x001C (0x0018) MISSED OFFSET
public:
	static class UClass* StaticClass();
};

