#pragma once
#include "FN_Basic.h"

#include "FN_VaultCamera_Blueprint_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: VaultCamera_Blueprint
*/

// BlueprintGeneratedClass /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C
// 0x001C (0x0624)
class AVaultCamera_Blueprint_C : public AFortCameraBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	class APartyCharacterPlacementHelper_C*                                                              CachedPawn;                                        // 0x060C (0x0004)
	bool                                                                                                 MouseDown;                                         // 0x0610 (0x0001)
	uint8_t                                                                                              UnknownData_611[0x3];                              // 0x0611 (0x0003) MISSED OFFSET
	class AVaultCamera_Blueprint_C*                                                                      VaultActor;                                        // 0x0614 (0x0004)
	class AB_Pickups_C*                                                                                  VaultMesh;                                         // 0x0618 (0x0004)
	float                                                                                                OldTimeofDay;                                      // 0x061C (0x0004)
	float                                                                                                OldTimeofDaySpeed;                                 // 0x0620 (0x0004)
public:
	void UserConstructionScript(); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:UserConstructionScript
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39(FKey Key); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_39
	void InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38(FKey Key); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:InpActEvt_RightMouseButton_UniqueObjectNameForCooking_38
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37(FKey Key); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_37
	void InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36(FKey Key); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:InpActEvt_LeftMouseButton_UniqueObjectNameForCooking_36
	void ReceiveTick(float DeltaSeconds); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:ReceiveTick
	void OnActivated(); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:OnActivated
	void OnDeactivated(); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:OnDeactivated
	void ExecuteUbergraph_VaultCamera_Blueprint(int32_t EntryPoint); // Function /Game/FrontEnd/Cameras/VaultCamera_Blueprint.VaultCamera_Blueprint_C:ExecuteUbergraph_VaultCamera_Blueprint
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/VaultCamera_Blueprint.PLACEHOLDER-CLASS__B_Pickups_C_174
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__B_Pickups_C_174
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/VaultCamera_Blueprint.PLACEHOLDER-CLASS__TVPostProcessBP_C_175
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_175
{
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/FrontEnd/Cameras/VaultCamera_Blueprint.PLACEHOLDER-CLASS__PartyCharacterPlacementHelper_C_176
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__PartyCharacterPlacementHelper_C_176
{
public:
	static class UClass* StaticClass();
};

