#pragma once
#include "FN_Basic.h"

#include "FN_WM_Camera_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: WM_Camera
*/

// BlueprintGeneratedClass /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C
// 0x0098 (0x06A0)
class AWM_Camera_C : public AFortCameraBase
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0608 (0x0004)
	float                                                                                                TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1; // 0x060C (0x0004)
	ETimelineDirection                                                                                   TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1; // 0x0610 (0x0001)
	uint8_t                                                                                              UnknownData_611[0x3];                              // 0x0611 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CameraDeactivateAnim;                           // 0x0614 (0x0004)
	float                                                                                                TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B; // 0x0618 (0x0004)
	ETimelineDirection                                                                                   TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B; // 0x061C (0x0001)
	uint8_t                                                                                              UnknownData_61D[0x3];                              // 0x061D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            TL_CameraActivateAnim;                             // 0x0620 (0x0004)
	float                                                                                                CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0624 (0x0004)
	float                                                                                                CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0628 (0x0004)
	float                                                                                                CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x062C (0x0004)
	ETimelineDirection                                                                                   CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0630 (0x0001)
	uint8_t                                                                                              UnknownData_631[0x3];                              // 0x0631 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            CameraNoise;                                       // 0x0634 (0x0004)
	float                                                                                                OldTimeofDay;                                      // 0x0638 (0x0004)
	float                                                                                                OldTimeofDaySpeed;                                 // 0x063C (0x0004)
	FTransform                                                                                           InitialPosition;                                   // 0x0640 (0x0030)
	FTransform                                                                                           ZoomPosition;                                      // 0x0670 (0x0030)
public:
	void UserConstructionScript(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:UserConstructionScript
	void CameraNoise__FinishedFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:CameraNoise__FinishedFunc
	void CameraNoise__UpdateFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:CameraNoise__UpdateFunc
	void TL_CameraActivateAnim__FinishedFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:TL_CameraActivateAnim__FinishedFunc
	void TL_CameraActivateAnim__UpdateFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:TL_CameraActivateAnim__UpdateFunc
	void TL_CameraDeactivateAnim__FinishedFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:TL_CameraDeactivateAnim__FinishedFunc
	void TL_CameraDeactivateAnim__UpdateFunc(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:TL_CameraDeactivateAnim__UpdateFunc
	void OnActivated(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:OnActivated
	void OnDeactivated(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:OnDeactivated
	void CameraWiggle(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:CameraWiggle
	void CameraActivateAnim(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:CameraActivateAnim
	void ReceiveBeginPlay(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:ReceiveBeginPlay
	void StopWiggle(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:StopWiggle
	void CameraDeactivateAnim(); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:CameraDeactivateAnim
	void ExecuteUbergraph_WM_Camera(int32_t EntryPoint); // Function /Game/Environments/WorldMap/Blueprints/WM_Camera.WM_Camera_C:ExecuteUbergraph_WM_Camera
public:
	static class UClass* StaticClass();
};

// LinkerPlaceholderClass /Game/Environments/WorldMap/Blueprints/WM_Camera.PLACEHOLDER-CLASS__TVPostProcessBP_C_156
// 0x0000 (0x0000)
class PLACEHOLDER_CLASS__TVPostProcessBP_C_156
{
public:
	static class UClass* StaticClass();
};

