#pragma once
#include "FN_Basic.h"

#include "FN_WeakSpot_parameters.h"
#include "FN_CoreUObject_enums.h"
#include "FN_CoreUObject_structs.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_FortniteGame_enums.h"
#include "FN_FortniteGame_structs.h"
#include "FN_FortniteGame_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: WeakSpot
*/

// BlueprintGeneratedClass /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C
// 0x014C (0x0424)
class AWeakSpot_C : public AFortCrackEffect
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x02D8 (0x0004)
	class UPointLightComponent*                                                                          PointLight;                                        // 0x02DC (0x0004)
	class UDecalComponent*                                                                               Decal;                                             // 0x02E0 (0x0004)
	class UParticleSystemComponent*                                                                      AttachedFlareParticle;                             // 0x02E4 (0x0004)
	class UParticleSystemComponent*                                                                      AnimatedBackgroundRingsParticleEffect;             // 0x02E8 (0x0004)
	class UStaticMeshComponent*                                                                          CrackModel;                                        // 0x02EC (0x0004)
	class UStaticMeshComponent*                                                                          SphereHitLocator;                                  // 0x02F0 (0x0004)
	class UCapsuleComponent*                                                                             CollisionComponent;                                // 0x02F4 (0x0004)
	class UParticleSystemComponent*                                                                      DamageEffect;                                      // 0x02F8 (0x0004)
	float                                                                                                CrackPathAnimation_Animation_along_path_A821E81A4A7DE9E54A34FFA4C0F808DB; // 0x02FC (0x0004)
	ETimelineDirection                                                                                   CrackPathAnimation__Direction_A821E81A4A7DE9E54A34FFA4C0F808DB; // 0x0300 (0x0001)
	uint8_t                                                                                              UnknownData_301[0x3];                              // 0x0301 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            CrackPathAnimation;                                // 0x0304 (0x0004)
	float                                                                                                ParticleScaleTimeline_FirstTimeScale_FB17FC154EE00C450C643C9E1F0E3CAE; // 0x0308 (0x0004)
	float                                                                                                ParticleScaleTimeline_Scale_FB17FC154EE00C450C643C9E1F0E3CAE; // 0x030C (0x0004)
	ETimelineDirection                                                                                   ParticleScaleTimeline__Direction_FB17FC154EE00C450C643C9E1F0E3CAE; // 0x0310 (0x0001)
	uint8_t                                                                                              UnknownData_311[0x3];                              // 0x0311 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            ParticleScaleTimeline;                             // 0x0314 (0x0004)
	FVector                                                                                              InitialScaleAnimation_ColorTrack_1D97E47B41E4DD80FCCA45BAD9FA9013; // 0x0318 (0x000C)
	float                                                                                                InitialScaleAnimation_Test_1D97E47B41E4DD80FCCA45BAD9FA9013; // 0x0324 (0x0004)
	float                                                                                                InitialScaleAnimation_TargetScaleDown_1D97E47B41E4DD80FCCA45BAD9FA9013; // 0x0328 (0x0004)
	float                                                                                                InitialScaleAnimation_Scaleup_1D97E47B41E4DD80FCCA45BAD9FA9013; // 0x032C (0x0004)
	ETimelineDirection                                                                                   InitialScaleAnimation__Direction_1D97E47B41E4DD80FCCA45BAD9FA9013; // 0x0330 (0x0001)
	uint8_t                                                                                              UnknownData_331[0x3];                              // 0x0331 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            InitialScaleAnimation;                             // 0x0334 (0x0004)
	float                                                                                                Timeline_0_ScaleDown_544AE05F40294D09C3C361AB7BCF6C4E; // 0x0338 (0x0004)
	float                                                                                                Timeline_0_FadeAwayBounce_544AE05F40294D09C3C361AB7BCF6C4E; // 0x033C (0x0004)
	ETimelineDirection                                                                                   Timeline_0__Direction_544AE05F40294D09C3C361AB7BCF6C4E; // 0x0340 (0x0001)
	uint8_t                                                                                              UnknownData_341[0x3];                              // 0x0341 (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_0;                                        // 0x0344 (0x0004)
	FVector                                                                                              Timeline_1_ColorTrack_AD84D9E348CF41B732F862B5A325E3EC; // 0x0348 (0x000C)
	float                                                                                                Timeline_1_SphereMultiplier_AD84D9E348CF41B732F862B5A325E3EC; // 0x0354 (0x0004)
	float                                                                                                Timeline_1_Crack_Timeline_AD84D9E348CF41B732F862B5A325E3EC; // 0x0358 (0x0004)
	ETimelineDirection                                                                                   Timeline_1__Direction_AD84D9E348CF41B732F862B5A325E3EC; // 0x035C (0x0001)
	uint8_t                                                                                              UnknownData_35D[0x3];                              // 0x035D (0x0003) MISSED OFFSET
	class UTimelineComponent*                                                                            Timeline_1;                                        // 0x0360 (0x0004)
	class UMaterialInstanceDynamic*                                                                      animatingMID;                                      // 0x0364 (0x0004)
	class UMaterialInstanceDynamic*                                                                      SecondAnimatingMID;                                // 0x0368 (0x0004)
	FVector                                                                                              CrackCurrentScale;                                 // 0x036C (0x000C)
	float                                                                                                CurrentCrackAmount;                                // 0x0378 (0x0004)
	float                                                                                                ParticleScaleVariable;                             // 0x037C (0x0004)
	float                                                                                                ScaleAwayVariable;                                 // 0x0380 (0x0004)
	class UMaterialInstanceDynamic*                                                                      MID_for_the_sphere_hit_locator;                    // 0x0384 (0x0004)
	class USoundBase*                                                                                    Impact_Sound;                                      // 0x0388 (0x0004)
	class USoundBase*                                                                                    SpawnSound;                                        // 0x038C (0x0004)
	TArray<FVector>                                                                                      MaterialControlPoints;                             // 0x0390 (0x000C)
	class UMaterialInstanceDynamic*                                                                      CrackFinderMID;                                    // 0x039C (0x0004)
	class UStaticMeshComponent*                                                                          CrackFinderMesh1;                                  // 0x03A0 (0x0004)
	float                                                                                                _1;                                                // 0x03A4 (0x0004)
	class UClass*                                                                                        CrackFinderMeshWTF;                                // 0x03A8 (0x0004)
	class UCurveVector*                                                                                  NOOOOO;                                            // 0x03AC (0x0004)
	class UFortSpline*                                                                                   newCrackSpline;                                    // 0x03B0 (0x0004)
	float                                                                                                TextureTilingPerWorldUnitDivisor;                  // 0x03B4 (0x0004)
	bool                                                                                                 NewVar;                                            // 0x03B8 (0x0001)
	bool                                                                                                 NewVar0;                                           // 0x03B9 (0x0001)
	uint8_t                                                                                              UnknownData_3BA[0x2];                              // 0x03BA (0x0002) MISSED OFFSET
	float                                                                                                CrackTravelPlayRate;                               // 0x03BC (0x0004)
	FVector                                                                                              initial_crack_location;                            // 0x03C0 (0x000C)
	FVector                                                                                              Initial_particle_location;                         // 0x03CC (0x000C)
	class USoundBase*                                                                                    SoundCrack_Level_01;                               // 0x03D8 (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_02;                               // 0x03DC (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_03;                               // 0x03E0 (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_04;                               // 0x03E4 (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_05;                               // 0x03E8 (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_06;                               // 0x03EC (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_07;                               // 0x03F0 (0x0004)
	TArray<class USoundBase*>                                                                            Crack_sounds;                                      // 0x03F4 (0x000C)
	class USoundBase*                                                                                    SoundCrack_Level_08;                               // 0x0400 (0x0004)
	class USoundBase*                                                                                    SoundCrack_Level_09;                               // 0x0404 (0x0004)
	class UMaterialInstanceDynamic*                                                                      ScytheMaterial;                                    // 0x0408 (0x0004)
	TArray<class UStaticMeshComponent*>                                                                  ReticleArray;                                      // 0x040C (0x000C)
	float                                                                                                First_Crack_Actor_Size_Multiplier;                 // 0x0418 (0x0004)
	float                                                                                                Spline_Tangent_Offsets;                            // 0x041C (0x0004)
	float                                                                                                Second_Crack_Actor_size_Multiplier;                // 0x0420 (0x0004)
public:
	void NewFunction(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:NewFunction
	void UserConstructionScript(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:UserConstructionScript
	void CrackPathAnimation__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:CrackPathAnimation__FinishedFunc
	void CrackPathAnimation__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:CrackPathAnimation__UpdateFunc
	void ParticleScaleTimeline__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:ParticleScaleTimeline__FinishedFunc
	void ParticleScaleTimeline__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:ParticleScaleTimeline__UpdateFunc
	void InitialScaleAnimation__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:InitialScaleAnimation__FinishedFunc
	void InitialScaleAnimation__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:InitialScaleAnimation__UpdateFunc
	void Timeline_0__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_0__UpdateFunc
	void Timeline_0__Kill__EventFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_0__Kill__EventFunc
	void Timeline_1__FinishedFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_1__FinishedFunc
	void Timeline_1__UpdateFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_1__UpdateFunc
	void Timeline_1__FinishedAnimatingSphere__EventFunc(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:Timeline_1__FinishedAnimatingSphere__EventFunc
	void ReceiveBeginPlay(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:ReceiveBeginPlay
	void OnFadeOut(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:OnFadeOut
	void OnHitCrack(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:OnHitCrack
	void OnStartDirectionEffect(); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:OnStartDirectionEffect
	void OnBounceAnimationUpdate(FFortBounceData BounceData); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:OnBounceAnimationUpdate
	void ExecuteUbergraph_WeakSpot(int32_t EntryPoint); // Function /Game/Effects/Fort_Effects/BluePrints/WeakPointEffect/WeakSpot.WeakSpot_C:ExecuteUbergraph_WeakSpot
public:
	static class UClass* StaticClass();
};

