#pragma once
#include "FN_Basic.h"

#include "FN_WriteOutTextToTheScreen_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_Engine_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: WriteOutTextToTheScreen
*/

// BlueprintGeneratedClass /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C
// 0x006C (0x02AC)
class AWriteOutTextToTheScreen_C : public AActor
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x0240 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh2;                                       // 0x0244 (0x0004)
	class UStaticMeshComponent*                                                                          StaticMesh1;                                       // 0x0248 (0x0004)
	FString                                                                                              CurrentString;                                     // 0x024C (0x000C)
	bool                                                                                                 NewVar;                                            // 0x0258 (0x0001)
	uint8_t                                                                                              UnknownData_259[0x3];                              // 0x0259 (0x0003) MISSED OFFSET
	float                                                                                                TotalAnimationTime;                                // 0x025C (0x0004)
	TArray<FString>                                                                                      CurrentStringArray;                                // 0x0260 (0x000C)
	int32_t                                                                                              LineCounter;                                       // 0x026C (0x0004)
	int32_t                                                                                              CurrentChar;                                       // 0x0270 (0x0004)
	int32_t                                                                                              CurrentLetter;                                     // 0x0274 (0x0004)
	int32_t                                                                                              PreviousLetter;                                    // 0x0278 (0x0004)
	FString                                                                                              Curre;                                             // 0x027C (0x000C)
	TArray<class UTextRenderComponent*>                                                                  TextLineArray;                                     // 0x0288 (0x000C)
	TArray<class UStaticMeshComponent*>                                                                  NewVar0;                                           // 0x0294 (0x000C)
	int32_t                                                                                              String_Anim_Target_Index;                          // 0x02A0 (0x0004)
	int32_t                                                                                              Initial_String_Anim_Index;                         // 0x02A4 (0x0004)
	float                                                                                                Line_Height;                                       // 0x02A8 (0x0004)
public:
	void Line(); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:Line
	void UserConstructionScript(); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:UserConstructionScript
	void ReceiveTick(float DeltaSeconds); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:ReceiveTick
	void WriteOutText(FString String, float TimePerCharacter, int32_t Anim_Start_String_Index__Length_Based_, int32_t Anim_End_String_Index__default___length_, bool Init_New_Line_, FLinearColor Color, bool Bold_, int32_t AdditionalLines); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:WriteOutText
	void ReceiveBeginPlay(); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:ReceiveBeginPlay
	void ErasePage(); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:ErasePage
	void MoveText(float NewHeight); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:MoveText
	void ExecuteUbergraph_WriteOutTextToTheScreen(int32_t EntryPoint); // Function /Game/Blueprints/Adventures/HomebaseTutorial/WriteOutTextToTheScreen.WriteOutTextToTheScreen_C:ExecuteUbergraph_WriteOutTextToTheScreen
public:
	static class UClass* StaticClass();
};

