#pragma once
#include "FN_Basic.h"

#include "FN_WorkerTooltipStatsWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: WorkerTooltipStatsWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C
// 0x0024 (0x01DC)
class UWorkerTooltipStatsWidget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UImage*                                                                                        Building_Icon;                                     // 0x01BC (0x0004)
	class UTextBlock*                                                                                    Building_Name;                                     // 0x01C0 (0x0004)
	class UTextBlock*                                                                                    BuildingSynergyTextBlock;                          // 0x01C4 (0x0004)
	class UHorizontalBox*                                                                                OccupyingBuildingBox;                              // 0x01C8 (0x0004)
	class UTextBlock*                                                                                    PersonalityTextBlock;                              // 0x01CC (0x0004)
	class UTextBlock*                                                                                    SetBonusTextBlock;                                 // 0x01D0 (0x0004)
	class UMyTownBuildingDefinitionData*                                                                 OccupiedBuildingDefinition;                        // 0x01D4 (0x0004)
	class UFortWorker*                                                                                   Worker_Item;                                       // 0x01D8 (0x0004)
public:
	void Construct(); // Function /Game/UI/Items/WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C:Construct
	void Tick(FGeometry MyGeometry, float InDeltaTime); // Function /Game/UI/Items/WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C:Tick
	void On_Worker_Preview_State_Changed(); // Function /Game/UI/Items/WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C:On Worker Preview State Changed
	void ExecuteUbergraph_WorkerTooltipStatsWidget(int32_t EntryPoint); // Function /Game/UI/Items/WorkerTooltipStatsWidget.WorkerTooltipStatsWidget_C:ExecuteUbergraph_WorkerTooltipStatsWidget
public:
	static class UClass* StaticClass();
};

