#pragma once
#include "FN_Basic.h"

#include "FN_WeaponTooltipDPSWidget_parameters.h"
#include "FN_Engine_enums.h"
#include "FN_Engine_structs.h"
#include "FN_UMG_enums.h"
#include "FN_UMG_structs.h"
#include "FN_UMG_classes.h"

/*
* =========================================================================================
* Generated by FortGen
* =========================================================================================
* PackageName: WeaponTooltipDPSWidget
*/

// WidgetBlueprintGeneratedClass /Game/UI/Items/WeaponTooltipDPSWidget.WeaponTooltipDPSWidget_C
// 0x0010 (0x01C8)
class UWeaponTooltipDPSWidget_C : public UUserWidget
{
public:
	FPointerToUberGraphFrame                                                                             UberGraphFrame;                                    // 0x01B8 (0x0004)
	class UTextBlock*                                                                                    _Text__Label;                                      // 0x01BC (0x0004)
	class UTextBlock*                                                                                    _Text__Value;                                      // 0x01C0 (0x0004)
	float                                                                                                DPS;                                               // 0x01C4 (0x0004)
public:
	void Construct(); // Function /Game/UI/Items/WeaponTooltipDPSWidget.WeaponTooltipDPSWidget_C:Construct
	void ExecuteUbergraph_WeaponTooltipDPSWidget(int32_t EntryPoint); // Function /Game/UI/Items/WeaponTooltipDPSWidget.WeaponTooltipDPSWidget_C:ExecuteUbergraph_WeaponTooltipDPSWidget
public:
	static class UClass* StaticClass();
};

